[{"custom_id":"lo_s01_e01","season":"1","episode_number":"1","episode_title":"Prescription for Death","air_date":"","source_notes":"Pilot episode. Father (Vietnam medic) accuses ER doctors of killing his daughter who came in with sore throat.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Suzanne Morton dies in ER after being given meperidine by drunk Dr. Auster, which fatally interacted with her phenelzine (antidepressant). Dr. Ekballa Raza initially suspected but proven innocent when investigation reveals he wrote correct drug (acetaminophen) and falsified chart under pressure. Raza faced public scrutiny and career threats as foreign doctor before being cleared."},{"custom_id":"lo_s01_e02","season":"1","episode_number":"2","episode_title":"Subterranean Homeboy Blues","air_date":"","source_notes":"Transcript shows Laura di Biasi shoots two young men on subway after perceived threat. Michael Jones (aka Mosquito Mosket) dies; Darnell Chenault paralyzed. Case revolves around self-defense vs. premeditated revenge.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Laura di Biasi, a former dancer turned hospital technician, shoots two young men (Darnell Chenault and Michael Jones/Mosket) on a subway after they allegedly threaten her. She claims self-defense; prosecution argues premeditated revenge stemming from a prior subway attack that ended her dance career. Jones/Mosket dies. The case focuses on di Biasi as defendant throughout—no falsely accused innocent parties are identified. Prosecution eventually offers a plea deal when new information about Mosket's criminal history creates reasonable doubt on murder charges. No person in this episode meets the criteria of being publicly accused then proven/strongly implied innocent."},{"custom_id":"lo_s01_e03","season":"1","episode_number":"3","episode_title":"The Reaper's Helper","air_date":"","source_notes":"Transcript appears complete with full courtroom scenes and investigation details.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Jack Curry is arrested and prosecuted for the murder of Bobby Holland, a gay man with AIDS. Curry admits to pulling the trigger but claims it was assisted suicide - that Holland wanted to die rather than suffer from AIDS. The prosecution argues Curry committed murder regardless of Holland's wishes. While Curry was initially suspected of serial murder (similar cases in LA and San Francisco), all three victims had AIDS and evidence suggests Holland may have wanted to die (he trashed his own apartment, paid off debts). However, Holland also had an appointment to discuss AZT treatment, suggesting he wanted to live. Ultimately, the jury acquits Curry of murder/manslaughter but convicts on reckless endangerment (a misdemeanor). No one in this episode is falsely accused and later proven innocent - Curry did pull the trigger on all three victims, the question was whether it constituted murder or assisted suicide."},{"custom_id":"lo_s01_e04","season":"1","episode_number":"4","episode_title":"Kiss the Girls and Make Them Die","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Paige Bartlett is strangled in her apartment. Two men had sexual contact with her that night: Steve Feinstein (ponytail boyfriend who dumped her) and Ned Loomis (ex-boyfriend who was with her later). Feinstein is initially suspected but has a solid alibi. Loomis is convicted of her murder. Steve Feinstein was publicly accused of murder, questioned by detectives multiple times, and labeled a suspect despite his alibi, causing exposure at his workplace and among his social circle before being cleared."},{"custom_id":"lo_s01_e05","season":"1","episode_number":"5","episode_title":"Happily Ever After","air_date":"","source_notes":"Classic Law & Order format with clear investigation pivot from Willie Tivnan to Janet Ralston and Gil Himes","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Alan Ralston is murdered in a parking garage. Willie Tivnan, a Black man with a criminal record, is arrested after his fingerprints are found on a crack pipe at the scene and Janet Ralston identifies him. However, detectives discover evidence pointing to Janet Ralston and her lover Gil Himes as the actual killers who planned the murder for insurance money. Willie is eventually cleared, but only after being publicly accused, arrested, and held on $100,000 bail."},{"custom_id":"lo_s01_e06","season":"1","episode_number":"6","episode_title":"Everybody's Favorite Bagman","air_date":"","source_notes":"Full transcript available. Episode involves a conspiracy to murder Charles Halsey, who was serving as a bagman for corrupt officials. Two young black men initially accused.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Councilman Charles Halsey is stabbed and later dies. Two black teenagers (Simonize Jackson and Tremaine Lewis) are initially arrested for the attack after being found with his possessions. They confess to robbery but claim Halsey was already wounded when they arrived. Investigation reveals Halsey was a bagman in a municipal corruption scheme. Anthony Scalisi (mob enforcer) actually stabbed Halsey on orders from corrupt officials (Deputy Commander Jefferson, Borough President Conti, Councilman Van Damme). The two teenagers were innocent of the stabbing, only guilty of robbery of an already-wounded man."},{"custom_id":"lo_s01_e07","season":"1","episode_number":"7","episode_title":"By Hooker, by Crook","air_date":"","source_notes":"Transcript appears complete with full courtroom and detective scenes.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Irv Diamond dies after a heart attack while with prostitute Jolene Curtis. Driver Cookie Molina removes Diamond from the hotel, dumps him in Central Park, and hits him with a bat to fake a mugging. Investigation leads to Laura Winthrop's high-end prostitution ring 'Poppy Escorts.' Jolene is HIV-positive, raising reckless endangerment concerns. Cookie testifies against Winthrop in exchange for a walk. Winthrop ultimately pleads to involuntary manslaughter. No person was falsely accused then cleared - Diamond's death investigation correctly identified those responsible (Cookie, Jolene, Winthrop). The case focused on prosecuting the actual perpetrators of the prostitution ring and Diamond's death."},{"custom_id":"lo_s01_e08","season":"1","episode_number":"8","episode_title":"Poison Ivy","air_date":"","source_notes":"Transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Officer Freddo Parisi shoots Tommy Richardson, a Princeton student, claiming self-defense during a drug deal. Investigation reveals Richardson never had a gun—Parisi planted his weapon after the shooting. Silky Ford, who sold the gun, is initially misidentified but protected by Parisi's threats. Partner Davis covers for Parisi until confronted with evidence. Richardson is publicly portrayed as a drug dealer during investigation/trial, destroying his reputation as a community hero. Parisi commits suicide before verdict."},{"custom_id":"lo_s01_e09","season":"1","episode_number":"9","episode_title":"Indifference","air_date":"","source_notes":"Transcript of Law & Order S1E9. Episode focuses on child abuse case involving Dierdre 'Didi' Lowenstein. Both parents are accused and tried; mother Carla confesses and pleads to manslaughter, testifies against husband Jacob who is convicted of murder.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"No qualifying persons found. Both Carla and Jacob Lowenstein were accused of murdering their daughter Didi, and both were ultimately convicted (Carla of manslaughter via plea, Jacob of murder). Neither was proven or strongly implied innocent. The episode's focus is on the tragic death of an abused child and the prosecution of both parents responsible for her death. No false suspects or wrongly accused individuals appear in the transcript."},{"custom_id":"lo_s01_e10","season":"1","episode_number":"10","episode_title":"Prisoner of Love","air_date":"","source_notes":"Transcript analyzed for false accusation patterns","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Artist Victor More dies during a sexual asphyxiation session. Commissioner Henry Rothman is charged with manslaughter after his fingerprint is found on a Polaroid taken during More's death. Evidence shows Elizabeth Hendrick, a wealthy patron, was present and ordered Rothman not to save More. Rothman initially testifies against Hendrick, then recants under her influence and commits suicide. Hendrick is ultimately arrested based on Polaroids Rothman left behind. No individuals were falsely accused and later proven innocent; the investigation correctly identified the perpetrators."},{"custom_id":"lo_s01_e11","season":"1","episode_number":"11","episode_title":"Out of the Half-Light","air_date":"","source_notes":"Transcript shows a 16-year-old girl claims to have been raped by white police officers. Investigation reveals she fabricated the story to get permission for an abortion (she was pregnant by boyfriend Jordan Hill). Congressman Eaton uses the case for political purposes. FBI rape kit comes back negative. Girl and mother eventually admit the hoax.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Astrea Crawford, 16, claims white police officers raped her and wrote racial slurs on her body. Two uniformed officers (Teal and Rudolph) are publicly named by Congressman Eaton. Investigation reveals the rape never occurred - Astrea fabricated the story because she was pregnant by boyfriend Jordan Hill and wanted an abortion but feared her father's reaction. FBI rape kit negative. Officers Teal and Rudolph are cleared with substantiated alibis. Case becomes politically charged with Congressman Eaton using it to attack the justice system, despite knowing or suspecting it was false."},{"custom_id":"lo_s01_e12","season":"1","episode_number":"12","episode_title":"Life Choice","air_date":"","source_notes":"Abortion clinic bombing; Mary Donovan dies delivering bomb she thought would be set at night; revealed she was actually seeking abortion","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Anti-abortion activists Rose Schwimmer and Celeste McClure conspire to bomb Chelsea Women's Choices clinic. Mary Donovan, believing she's delivering a bomb for the cause, dies in the explosion. Investigation reveals Mary was actually pregnant and seeking an abortion under a false ID provided by her boyfriend Patrick Dunn. Patrick is briefly arrested as co-conspirator based on fingerprints on the fake ID, but he was actually helping Mary get an abortion, not plant a bomb. The episode explores the abortion debate while prosecuting Schwimmer and McClure for murder."},{"custom_id":"lo_s01_e13","season":"1","episode_number":"13","episode_title":"A Death in the Family","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Officer Rennick, a corrupt cop who was skimming money from drug busts and killed dealer Ricky Powers, attempts to murder his partner Officer Sandoval on a rooftop to silence her. She kills him in self-defense. Brutus Walker is initially suspected of killing Rennick but is later cleared. A 15-year-old girl, Ravina Price, is briefly suspected when her fingerprints are found on the murder weapon. The episode explores police corruption and the breakdown of the partner bond."},{"custom_id":"lo_s01_e14","season":"1","episode_number":"14","episode_title":"The Violence of Summer","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Three young men (Metzler, Hanauer, and Ryan Cutrona) are accused of gang-raping reporter Monica DeVries. The case is dismissed due to victim's repressed memory and lack of DNA match. Investigation reveals a fourth perpetrator, Timothy Pruiting, who actually committed the rape while the three younger defendants primarily held the victim. Ryan Cutrona, the youngest and most reluctant participant, eventually testifies against Pruiting. The three younger men are re-arrested for rape (holding/accessory roles), but they are factually less culpable than initially accused of being the primary rapists."},{"custom_id":"lo_s01_e15","season":"1","episode_number":"15","episode_title":"The Torrents of Greed: Part 1","air_date":"","source_notes":"This is Part 1 of a two-part episode. Resolution likely occurs in Part 2.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Isaac Skolnick is brutally beaten in his candy store over a bootlegged cigarette conspiracy. Edgar Hoover, a homeless man, is initially accused but later cleared when the real attacker (Joe Pilefsky) is identified. Hoover dies shortly after. The case expands into organized crime involving the Masucci family. Harvey Beigal cuts a deal to testify about a separate murder (Russell Mackey), which allows him to walk on the Skolnick assault conspiracy despite being the one who ordered it. The Mackey case collapses due to perjured testimony from Pilefsky (part of Masucci's strategy), and Beigal's plea bargain stands despite the outcome."},{"custom_id":"lo_s01_e16","season":"1","episode_number":"16","episode_title":"The Torrents of Greed: Part 2","air_date":"","source_notes":"Transcript appears complete. This is Part 2 of a multi-part episode dealing with organized crime.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Following a failed prosecution of mob boss Frank Masucci for murder (set up via perjured testimony in Part 1), Stone pursues various members of the Masucci crime family. Laurel McGinty, a buildings inspector, is accused of bribery and threatened with prosecution to flip on Harvey Beigal (Masucci's brother-in-law). She is proven innocent of the primary crime narrative (the murders) but guilty of the bribery she's accused of. Joe Pilefsky is coerced through threats and a staged prison incident into cooperating. The episode culminates with Masucci being murdered, orchestrated by his own sister Katherine Beigal."},{"custom_id":"lo_s01_e17","season":"1","episode_number":"17","episode_title":"Mushrooms","air_date":"","source_notes":"Transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"An 11-month-old baby is killed and his 12-year-old brother critically wounded in a drive-by shooting. Police initially suspect the older brother Gregory Winters of drug dealing, but he is proven innocent. The real crime was a botched contract killing by drug dealer Michael Ingrams against real estate agent Ned Kay, who stole $300,000 from him. The 14-year-old hit man went to the wrong apartment (315 Jacobs Place instead of 315 Jameson Place)."},{"custom_id":"lo_s01_e18","season":"1","episode_number":"18","episode_title":"The Secret Sharers","air_date":"","source_notes":"Transcript appears truncated mid-trial","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Jose Urbano, a drug dealer and parolee, is shot at a church fair. Initially, Hector Cartagena (Urbano's associate) is suspected and arrested. However, evidence later reveals that Nicky Guzman shot Urbano in revenge for raping Guzman's fiancée Lucy Rivers. Alicia Rivers (Lucy's sister) is also arrested for conspiracy but charges are dismissed. Both Cartagena and Alicia are publicly accused but later cleared. The transcript ends mid-trial for Nicky Guzman."},{"custom_id":"lo_s01_e19","season":"1","episode_number":"19","episode_title":"The Serpent's Tooth","air_date":"","source_notes":"Transcript appears complete through trial and arrest of Petrovich.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Karl and Evelyn Jarmon are murdered in their home. Their sons Greg and Nick are arrested based on fingerprints on the murder weapon, powder residue, financial motive ($10M inheritance), and weak alibi. The boys had history of abuse from their father. Later investigation reveals business partner Alex Petrovich orchestrated the murders as part of Russian organized crime scheme to take over Jarmon Printing. Charges against the sons are dropped; Petrovich is convicted."},{"custom_id":"lo_s01_e20","season":"1","episode_number":"20","episode_title":"The Troubles","air_date":"","source_notes":"Transcript shows Law & Order S1E20 'The Troubles' involving IRA member Ian O'Connell and federal prisoners.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A federal prisoner (Ahmed Mustafa) is murdered while in transit. Initially both surviving prisoners (Savino Montez and Ian O'Connell) are suspects. Montez is later found hanged in his cell, initially staged as suicide but proven to be murder by prison guard Patrick McCarter on O'Connell's orders. O'Connell, an IRA member held for 5 years without charges, is eventually prosecuted for Mustafa's murder after being granted asylum. Multiple people experience serious consequences from accusations before being cleared or shown innocent."},{"custom_id":"lo_s01_e21","season":"1","episode_number":"21","episode_title":"Sonata for Solo Organ","air_date":"","source_notes":"Transcript appears complete with full courtroom resolution.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Drew MacDaniel is found in Central Park missing a kidney, which was illegally harvested and transplanted into Joanna Woodleigh. Dr. James Reberty and nurse Elaine Hale are arrested for the crime. While Reberty initially tries to shift blame to Hale, both are eventually convicted. Phillip Woodleigh (Joanna's father) is also prosecuted for conspiracy after evidence shows he knowingly paid for the illegal organ procurement. No innocent persons are falsely accused in this episode - the investigation correctly identifies the perpetrators from the start."},{"custom_id":"lo_s01_e22","season":"1","episode_number":"22","episode_title":"The Blue Wall","air_date":"","source_notes":"Transcript shows a case about evidence tampering in a money laundering prosecution. Three bankers were acquitted after computer discs showing drug money trails were erased. Investigation reveals conspiracy involving Congressman Wilson, Chief O'Farrell, Officer McCrory, and Detective Shearer.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Three bankers accused of money laundering were acquitted after evidence (computer discs) was tampered with. Captain Cragen was investigated and publicly suspected by IAD but proven innocent when he wore a wire that implicated Chief O'Farrell. The actual conspirators were O'Farrell, Congressman Wilson, McCrory, and Shearer."},{"custom_id":"lo_s02_e01","season":"2","episode_number":"1","episode_title":"Confession","air_date":"","source_notes":"Transcript involves Det. Max Greevey's murder investigation and subsequent coerced confession by Det. Mike Logan.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Detective Max Greevey is murdered before testifying in a grand jury corruption case. His partner Mike Logan tracks down and coerces a confession from Daniel Magadan Jr. at gunpoint in an alley. Though Magadan confessed and was ultimately convicted, the confession was coerced under threat of death. The episode focuses on the legal consequences of Logan's conduct and the admissibility of evidence derived from the coerced confession. Magadan is convicted of first-degree murder and sentenced to 25 years to life."},{"custom_id":"lo_s02_e02","season":"2","episode_number":"2","episode_title":"The Wages of Love","air_date":"","source_notes":"Transcript analyzed per rubric","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Edward Cullen and his girlfriend Alexandra Beckett are murdered. Doug Phillips, Alexandra's ex-boyfriend, is arrested based on prints, motive (jealousy), and phone records. He is later cleared when evidence shows Melanie Cullen (Edward's estranged wife) committed the murders. Phillips was publicly arrested and indicted before being cleared."},{"custom_id":"lo_s02_e03","season":"2","episode_number":"3","episode_title":"Aria","air_date":"","source_notes":"19-year-old actress Priscilla Blaine dies from amitriptyline overdose (200+ mg, 8+ tablets). Her mother Elizabeth Blaine pushed her into pornography to fulfill her own failed acting dreams. Priscilla left a desperate taped monologue for her mother a week before death. Mother is convicted of criminally negligent homicide.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"No falsely accused innocent persons are identified in this episode. The investigation consistently focuses on the victim's mother, Elizabeth Blaine, who is ultimately convicted. While the legal theory shifts from suicide to accidental overdose during trial, no other suspects are pursued or publicly accused then cleared. This is a case about parental pressure leading to death, not mistaken identification."},{"custom_id":"lo_s02_e04","season":"2","episode_number":"4","episode_title":"Asylum","air_date":"","source_notes":"Nathan Robbins stabbed to death during street robbery. Christian Tatum ('Lemonhead') initially accused, later cleared. James Polesky convicted.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Nathan Robbins is stabbed to death outside a coffee shop. Christian Tatum ('Lemonhead'), a homeless man with severe mental illness, is arrested when police find the victim's ring in his jacket pocket. He claims his friend 'James' did the stabbing. Investigation proves James Polesky committed the murder; Tatum accepts plea deal and testifies against Polesky. Tatum suffers severe mental deterioration from trial stress and anti-psychotic medication, ending up institutionalized at Bellevue in a 'rubber cell.'"},{"custom_id":"lo_s02_e05","season":"2","episode_number":"5","episode_title":"God Bless the Child","air_date":"","source_notes":"Transcript appears complete through trial testimony.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Parents Ted and Nancy Driscoll are charged with manslaughter after their daughter Dinah dies from untreated strep throat due to their religious beliefs forbidding medical treatment. The case focuses on their Church of All Saints faith in spiritual healing. There are no falsely accused innocent parties—the parents are the defendants throughout, and while the prosecution struggles with proving their guilt, they are never cleared or replaced by other suspects. The housekeeper Mrs. Amado and church practitioner Sharon Barlow are witnesses, not accused persons."},{"custom_id":"lo_s02_e06","season":"2","episode_number":"6","episode_title":"Misconception","air_date":"","source_notes":"Transcript appears truncated at final cross-examination","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Amy Newhouse is attacked and loses her pregnancy. Initially, detectives suspect her boyfriend Chris (a former disbarred lawyer turned cabbie). Evidence later points to her boss David Alcott, with whom she had an affair. Alcott is arrested and publicly tried for murder, then assault. Eventually it's revealed Amy and Chris orchestrated the entire scheme: Chris was the actual father (not Alcott), they blackmailed Alcott, then staged the attack themselves to file a civil suit. The transcript cuts off during Amy's cross-examination about whether they knew the legal definition of murder in NY."},{"custom_id":"lo_s02_e07","season":"2","episode_number":"7","episode_title":"In Memory Of","air_date":"","source_notes":"Episode involves a 30-year-old cold case; victim Tommy Keegan, age 8, killed in 1962; remains found in 1992/1993","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Two men (Dorfman and Conover) living in the same building as victim Tommy Keegan were suspected by police and neighbors after the boy's 1962 disappearance. Ed Conover faced public suspicion and a separate accusation of approaching a boy at a church youth group. Both men were innocent; the actual killer was Thaddeus Messimer, the father of Tommy's friend Julie, who pled guilty 31 years later."},{"custom_id":"lo_s02_e08","season":"2","episode_number":"8","episode_title":"Out of Control","air_date":"","source_notes":"Transcript appears complete through trial verdict","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Andrea Fermi accuses fraternity members Ted Campion and Joel Holder of gang rape at a Halloween party. The case involves extensive investigation and trial, ending with both defendants acquitted. Andrea herself is not proven innocent of any accusation - she is the accuser/victim. Her ex-boyfriend Gary Burnham initially lies but cooperates after plea deal. No person in this episode qualifies as falsely accused then proven innocent with public harm."},{"custom_id":"lo_s02_e09","season":"2","episode_number":"9","episode_title":"Renunciation","air_date":"","source_notes":"Transcript provided","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"A bartender is killed in a hit-and-run. Investigation reveals his wife Jenna Kealey was having an affair with her 16-year-old student Roy Pack. Roy confesses to the murder, claiming Jenna manipulated him. Jenna claims she tried to hire a hit man (David Kaufer) but renounced the plan, and that Roy acted alone out of obsession. However, the prosecution discovers Kaufer was lying - Jenna paid him to pretend to be a hit man to manipulate Roy into committing the murder, creating a false renunciation story as insurance. Both Roy and Jenna are guilty - Roy of the actual killing, Jenna of conspiracy and manipulation."},{"custom_id":"lo_s02_e10","season":"2","episode_number":"10","episode_title":"Heaven","air_date":"","source_notes":"Transcript of Law & Order S2E10. 53 people died in an arson attack on a social club (El Cielo). Investigation reveals conspiracy involving forged green cards.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"An arson attack on El Cielo social club kills 53 people. Police initially suspect Guillermo Ruiz, a drunk ex-boyfriend of a barmaid who threatened the club. Ruiz is brought in for questioning and his apartment searched, but his landlord provides an alibi (he was home asleep by 11:30). Investigation shifts to arson-for-profit targeting club owner Jose Rivera/Marcos, but Marcos dies in the fire. Police then identify Cesar Pescador through stolen green card use at hospital. Pescador confesses he was hired by Domingo Guerra to send a 'message' to Salvadorans who were threatening to expose Guerra's forged green card scheme. Guerra and INS agent James Collins are ultimately charged with the murders."},{"custom_id":"lo_s02_e11","season":"2","episode_number":"11","episode_title":"His Hour Upon the Stage","air_date":"","source_notes":"Transcript appears truncated at end during tape playback","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Broadway producer Joshua Foster is found murdered, frozen for 5 years. Investigation reveals he was killed by his fiancée Leslie Hart and partner Gary Wallace after threatening to expose drug money funding their show. Mario Forcelli is initially investigated as mob-connected, but cleared. Both Hart and Wallace are publicly exposed through arrest, indictment, and trial."},{"custom_id":"lo_s02_e12","season":"2","episode_number":"12","episode_title":"Star Struck","air_date":"","source_notes":"SVU episode, not original Law & Order. Transcript shows opening with SVU intro ('sexually-based offenses'). Victim Marnie Owens is a teacher murdered after sexual assault. Main suspect Phillip Montrose eventually indicted for manslaughter.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"High school teacher Marnie Owens is raped and murdered. Multiple people are investigated and publicly exposed before Phillip Montrose is indicted. Ethan Chance, a student, is wrongly accused and arrested publicly. Dr. Byron Marks is interrogated and exposed. Marcus Cole is questioned. All are later cleared when evidence points to Montrose, who eventually gets indicted for manslaughter (not murder) after testimony about victim's sexual history influences grand jury."},{"custom_id":"lo_s02_e13","season":"2","episode_number":"13","episode_title":"Severance","air_date":"","source_notes":"Transcript appears complete through trial/plea resolution","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Professional hitman Frank Kemp murders bookkeeper Janet Torrens (who was cooperating with FBI against defense contractor Charles Martine) plus two advertising executives (Craig Hovis and Peter Coyle) who witnessed the killing. Lawyer Larry Teasdale served as intermediary between Martine and Kemp. All three are arrested and eventually plead guilty after Kemp agrees to testify. No innocent persons were falsely accused - the investigation correctly identified all perpetrators from the start."},{"custom_id":"lo_s02_e14","season":"2","episode_number":"14","episode_title":"Blood Is Thicker...","air_date":"","source_notes":"Transcript appears truncated mid-sentence during final testimony.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Lois Ryder is murdered in an apparent mugging. Detectives investigate husband Jonathan Ryder, who tries to frame the murder as the work of a serial mugger. Dr. Joel Friedman (Lois's lover) is initially suspected. Henry Willard, a mugger, is arrested after pawning Lois's jewelry but claims he found it in a dumpster. Evidence suggests Jonathan Ryder killed his wife and planted evidence to frame the mugger. Transcript ends mid-trial during Friedman's testimony about identifying the pin Lois was wearing."},{"custom_id":"lo_s02_e15","season":"2","episode_number":"15","episode_title":"Trust","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Jaime Maser, age 15, shoots and kills his friend Robbie Fenwick with his father's .357 Magnum in what he claims is an accidental shooting during a 'trust' game. Investigation reveals a prior sealed juvenile shooting of Graham Campbell two years earlier with identical circumstances. Jaime is tried as an adult, initially acquitted by reason of mental defect (claiming Tracon intoxication), but then convicted of murder in the second degree for the Campbell shooting after the sealed record is opened and his mother testifies he threatened her with a gun saying 'Graham didn't believe me either.' No falsely accused persons identified in this episode."},{"custom_id":"lo_s02_e16","season":"2","episode_number":"16","episode_title":"Vengeance","air_date":"","source_notes":"Serial killer case; multiple victims murdered before episode begins; focus on prosecuting Albert Cheney for Judy Bream murder","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Detectives investigate the murder of Judy Bream, strangled in her apartment. They connect her death to two prior murders and identify Albert Cheney, a bookkeeper with access to victims' information through doctors' files and a prior conviction for a similar killing. Cheney is arrested and tried. His wife initially provides a false alibi but later testifies against him after being charged as an accessory. No innocent persons are publicly accused or harmed by false accusations in this episode - the investigation correctly identifies the perpetrator from the start."},{"custom_id":"lo_s02_e17","season":"2","episode_number":"17","episode_title":"Sisters of Mercy","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A teenage girl at a Catholic rehab facility accuses a nun of sexual molestation. Investigation reveals the nun was innocent and the girl fabricated the story to discredit the nun. The real perpetrator was the male Executive Director who had been sexually exploiting vulnerable teenage girls at the facility. Sister Bettina was publicly accused, investigated, and arrested before being cleared when the truth emerged."},{"custom_id":"lo_s02_e18","season":"2","episode_number":"18","episode_title":"Cradle to Grave","air_date":"","source_notes":"Transcript appears complete through the sting operation setup at end","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A baby (Henry Ward) freezes to death in an unheated apartment. His mother Jackie Ward is initially accused and arrested, but investigation reveals the building superintendent (Tirado) and enforcer (Turner) intentionally shut off heat to harass tenants on behalf of landlord Iris Corman. Jackie is cleared; Turner is convicted but gets mistrial; prosecutors pursue Corman. Jackie Ward was publicly accused, arrested, and held at Central Booking before being cleared when the true perpetrators were identified."},{"custom_id":"lo_s02_e19","season":"2","episode_number":"19","episode_title":"The Fertile Fields","air_date":"","source_notes":"Transcript appears complete through closing arguments","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Ezra Shore, a Jewish diamond dealer, is beaten and burned. Initial investigation focuses on four Black teenagers (Fontaine Robinson, Cyrus Tanner, Harley Monks, and Reginald Beggs) based on witness statements and Reggie's claim he saw his friends commit the murder. The teens are arrested and indicted, but Reggie recants on the stand, admitting he lied for 'juice' (street credibility). The case is withdrawn from the grand jury. Later investigation reveals Ezra's brother Isaac was laundering money for Joseph Tashjian, who actually killed Ezra when he threatened to expose the operation. Three innocent teens were publicly arrested, perp-walked, and indicted for a murder they didn't commit."},{"custom_id":"lo_s02_e20","season":"2","episode_number":"20","episode_title":"Intolerance","air_date":"","source_notes":"Complete transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Tim Chong, a 17-year-old star physics student, is murdered. Police initially pursue gang-related theories due to his former White Tigers affiliation. Ron Borland is first arrested when his gun is matched to the murder weapon, but is later cleared when detectives discover his wife Marian and son Randy were the actual killers, motivated by academic competition between Tim and Carl Borland for a prestigious science prize. Ron Borland appears to have planted evidence on himself to protect his family."},{"custom_id":"lo_s02_e21","season":"2","episode_number":"21","episode_title":"Silence","air_date":"","source_notes":"Transcript appears complete through courtroom testimony scene","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Councilman James Vogel is murdered after being blackmailed over his sexual orientation. The investigation reveals Harold Dwyer (a prisoner) and attorney Peter Colson ran a blackmail scheme targeting multiple gay men through prison pen-pal correspondence. While other victims (George Harris, Jay Lingard) were blackmailed, none appear to have suffered public exposure or material harm beyond paying the blackmail. The case centers on the actual perpetrators (Dwyer/Colson) rather than falsely accused parties. Edward Vogel (the victim's father) knew about the blackmail and paid it to keep his son's sexuality secret, but this doesn't qualify him as falsely accused of a crime."},{"custom_id":"lo_s02_e22","season":"2","episode_number":"22","episode_title":"The Working Stiff","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Marshall McFadden, a wealthy takeover specialist, is murdered. Simon Vilanis, a terminally ill former factory worker who lost his job, health insurance, and pension after McFadden's takeover, becomes the primary suspect when his stolen gun is identified as the murder weapon. He is arrested and charged. Investigation reveals the real killers were union enforcer Joey Palmieri (hired by his cousin Eddie Palmieri) at the direction of banker Dwight Corcoran, who paid $100,000 through McFadden's charity foundation to prevent McFadden from testifying about bank fraud. Vilanis is cleared."},{"custom_id":"lo_s03_e01","season":"3","episode_number":"1","episode_title":"Skin Deep","air_date":"","source_notes":"Transcript appears complete through resolution.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Photographer Julian Decker is murdered. Angela Brant, a model who worked as a prostitute through Decker, is accused and prosecuted for murder. Evidence includes her DNA matching vaginal secretions in victim's pajamas, her prints on murder weapon, lies about alibi. She nearly pleads guilty to protect her daughter. Eventually revealed that her 15-year-old daughter Tracy killed Decker after sexual relationship, and Angela attempted to take the blame. Angela is cleared and charges dismissed when father's testimony establishes her alibi."},{"custom_id":"lo_s03_e02","season":"3","episode_number":"2","episode_title":"Conspiracy","air_date":"","source_notes":"Complex conspiracy case involving assassination of activist Marcus Tate. Multiple suspects accused and cleared.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Marcus Tate, leader of African-American Congress, is assassinated. Mitchell Koblin arrested based on eyewitness testimony and gun possession. Trial reveals weak ballistics evidence and racial tensions. Koblin acquitted on murder but convicted on weapons charge. Post-trial investigation suggests possible conspiracy involving AAC insiders Roland Books and Otis Cook, but insufficient evidence for prosecution."},{"custom_id":"lo_s03_e03","season":"3","episode_number":"3","episode_title":"Forgiveness","air_date":"","source_notes":"Transcript appears complete through closing arguments","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Beth Milgram is murdered after breaking up with boyfriend Tommy Beltran. Detectives initially investigate her father Curtis Milgram due to a violent past and insurance policy, but he has an alibi (speeding ticket 80 miles away). Tommy Beltran confesses and is prosecuted for murder two. Defense argues diminished capacity/crime of passion. No innocent persons were publicly accused or harmed by false accusations in this episode."},{"custom_id":"lo_s03_e04","season":"3","episode_number":"4","episode_title":"The Corporate Veil","air_date":"","source_notes":"Transcript appears complete through courtroom scene. Focus is on corporate liability for defective pacemakers causing deaths.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Roberto Martinez, 18, dies when his pacemaker fails. Investigation reveals the device had corroded leads from a defective shipment. Initially Dr. Trevor Hellems is accused of unnecessary surgery and implanting a used pacemaker. Later, Jeffrey Suiter (who recycled/resold pacemakers with altered expiration dates) is arrested for murder. Both are eventually cleared or charges dismissed when evidence shows the real culprit was BioNorm Industries knowingly using defective components. The corporation used Steven Cleary (low-level technician) as a shield from liability."},{"custom_id":"lo_s03_e05","season":"3","episode_number":"5","episode_title":"Wedded Bliss","air_date":"","source_notes":"Transcript appears truncated mid-sentence at the end.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"Investigation into murders of two Mexican teenagers (María and Eduardo Carranza) and inspector Ira Bender who were killed by Rudy Armandariz and Ellis/Betty Drake. The teenagers were enslaved in a sweatshop, handcuffed to beds. No innocent persons were publicly accused or harmed by false accusations in this episode - the investigation correctly identifies the perpetrators (Rudy Armandariz and the Drakes) from early on. The case focuses on proving their guilt, not on clearing innocent suspects."},{"custom_id":"lo_s03_e06","season":"3","episode_number":"6","episode_title":"Helpless","air_date":"","source_notes":"Episode focuses on Dr. Alex Merritt, a gynecologist who sexually assaults patients under the guise of medical examinations. Multiple victims identified; main prosecution involves police psychologist Dr. Elizabeth Olivet.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Dr. Alex Merritt is accused of sexually assaulting multiple female patients during gynecological examinations. The episode follows the prosecution of Merritt for raping Dr. Elizabeth Olivet, a police psychologist who deliberately returned to his office to gather evidence after hearing complaints from her patient Diane Perkins. Though initially convicted by a jury, the judge dismisses the verdict claiming entrapment. Merritt is later re-arrested after his nurse testifies and additional victims come forward. No false suspects are identified in this episode—the focus is entirely on prosecuting the actual perpetrator."},{"custom_id":"lo_s03_e07","season":"3","episode_number":"7","episode_title":"Self Defense","air_date":"","source_notes":"Transcript appears truncated mid-sentence at end. Full trial outcome and verdict unclear.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"George Costas, a jewelry store owner, shoots and kills brothers Garland and Cecil Booker during an attempted robbery. While Costas claims self-defense, evidence suggests he executed Garland Booker outside the store after the initial confrontation. The brothers were the actual perpetrators attempting robbery, so no innocent persons were falsely accused. Costas is the defendant claiming justifiable homicide. The transcript ends mid-trial, making final disposition unclear."},{"custom_id":"lo_s03_e08","season":"3","episode_number":"8","episode_title":"Prince of Darkness","air_date":"","source_notes":"Transcript appears complete through final scene showing aftermath of Christobal killing Gaitan.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Manuel Ortega and his wife are murdered at a restaurant. Investigation reveals Manuel worked as a travel agent booking flights for Colombian drug cartel members and hit men. Evidence suggests Manuel killed dealer Felix Arias (who harassed his wife), and the cartel sent hit man Javier Gaitan as retaliation. Gaitan is arrested, tried, and convicted of both murders. At his sentencing, victim's father Juan Christobal shoots Gaitan dead in the courtroom. Initially presented as grieving father, Christobal is later revealed to be a cartel operative who killed Gaitan to prevent him from cooperating with authorities. No innocent persons are publicly accused or harmed by false accusations in this episode - the investigation correctly identifies Gaitan as the restaurant shooter, and all other suspects (Manuel, Ramon) are actually guilty of their accused crimes."},{"custom_id":"lo_s03_e09","season":"3","episode_number":"9","episode_title":"Point of View","air_date":"","source_notes":"Transcript shows Tommy Duff was accused/investigated as a possible mob associate and womanizer, but the episode reveals he was actually a victim of a contract killing disguised as self-defense.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Tommy Duff is murdered on the street. Mary Kostrinski claims self-defense against attempted rape, but investigation reveals she was paid $30,000 by mob boss Jimmy Scanlon to kill Duff, who had been stealing from Scanlon. Kostrinski used a false rape claim and feminist defense to cover a contract killing. While Duff was initially investigated as a suspect in various mob activities, he was the victim, not falsely accused. No qualifying persons for the dataset."},{"custom_id":"lo_s03_e10","season":"3","episode_number":"10","episode_title":"Consultation","air_date":"","source_notes":"Transcript appears truncated mid-testimony. Final sections missing.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Nigerian woman Kelani Amoda dies of heroin overdose after drug-filled condom ruptures during smuggling operation. Investigation reveals Chief Nwaka orchestrated smuggling ring using Nigerian immigrants. Philip Marietta (employer) initially accused but later becomes cooperating witness. Babatunde Amoda (Kelani's husband) publicly confronted as possible conspirator but proven innocent. Fabian Ayinde (janitor/swallower) accused, arrested, then deported before trial. Transcript ends mid-trial with defense witness testifying."},{"custom_id":"lo_s03_e11","season":"3","episode_number":"11","episode_title":"Extended Family","air_date":"","source_notes":"Transcript appears complete through trial verdict and closing scene.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Seven-year-old Samantha Silver disappears from a department store. Investigation initially focuses on Harold Zorn, a stock clerk with a prior sex abuse conviction, before discovering the girl was taken by her mother's allies who claim the father molested her. Gary Silver is accused of sexually abusing his daughter, publicly tried, and acquitted. The case involves coached testimony, disputed medical evidence, and a mother who wanted to flee the country. A former stock clerk with a sex abuse record is also publicly accused before being cleared."},{"custom_id":"lo_s03_e12","season":"3","episode_number":"12","episode_title":"Right to Counsel","air_date":"","source_notes":"Transcript appears truncated mid-dialogue at end","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Barbara Spiegelman, 61, is murdered. Her boyfriend Stephen Gregg is arrested, fingerprints found on knives in drawer. He pleads guilty to manslaughter (7-21 years) via plea deal with attorney Sally Knight. Post-plea, prosecutors discover Gregg's allocution contradicts forensics (he said victim was seated; ME says standing). Investigation reveals Kevin Doyle, Barbara's estate attorney, had stronger motive ($500K executor commission, $400K IRS debt). Doyle's fingerprints found at scene, his alibi false. Gregg's charges withdrawn; Doyle arrested and tried. Transcript ends mid-cross-examination, suggesting potential conspiracy between Doyle and Knight to frame/railroad Gregg. Gregg accepted plea despite innocence, likely coerced by incompetent/unethical counsel."},{"custom_id":"lo_s03_e13","season":"3","episode_number":"13","episode_title":"Night & Fog","air_date":"","source_notes":"Transcript appears complete through trial and plea negotiation scenes.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"David Steinmetz confesses to assisting his wife Ursula's suicide via sleeping pills, then admits he smothered her with a pillow when the pills didn't work fast enough. Investigation reveals he may actually be Jacub Skulman, a Jewish ghetto policeman wanted for war crimes in Poland. His wife discovered his true identity before her death. He ultimately pleads guilty to Murder Two to protect his daughter from perjury charges and to seal the trial record. No innocent persons were falsely accused in this episode—Steinmetz was guilty of murdering his wife throughout."},{"custom_id":"lo_s03_e14","season":"3","episode_number":"14","episode_title":"Promises to Keep","air_date":"","source_notes":"Transcript appears complete through sentencing hearing","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Dan Garrett murders his girlfriend Jennifer Gorham after his psychiatrist Dr. Diane Meade engages in a sexual relationship with him and allegedly manipulates him into eliminating Jennifer as a threat. Both are ultimately convicted - Meade for criminally negligent homicide, Garrett for manslaughter. No innocent persons are accused; both defendants are guilty of their respective crimes."},{"custom_id":"lo_s03_e15","season":"3","episode_number":"15","episode_title":"Mother Love","air_date":"","source_notes":"Transcript shows police initially suspect Jonas Stark (nicknamed 'Skate') of murdering Dawn Bryan, a drug addict. Evidence (gun prints, motive) points to Stark. However, investigation reveals Dawn's mother Virginia Bryan actually killed her daughter (mercy killing at Dawn's request). Father Fred Bryan planted the murder weapon to frame Stark.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Jonas Stark was falsely accused of murdering Dawn Bryan. He was arrested twice, subjected to interrogation, had a line-up conducted, and faced $500,000 bail for murder charges. His prints were on the gun clip because he had given the gun to Dawn for protection. The actual killer was Dawn's mother Virginia Bryan (mercy killing). Dawn's father Fred Bryan planted evidence in a sewer pipe to frame Stark. Grand jury ultimately indicted Virginia Bryan only for weapons possession (misdemeanor), not manslaughter."},{"custom_id":"lo_s03_e17","season":"3","episode_number":"17","episode_title":"Conduct Unbecoming","air_date":"","source_notes":"Transcript appears complete through closing arguments.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Lt. Janet Hagen is found dead in a hotel room after a Navy party. Ensign Walters confesses to accidentally killing her during a drunken encounter and is convicted by military court-martial. Detectives discover forensic evidence proving Hagen's fatal injury occurred 20+ minutes before Walters touched her. They identify Captain Bunker as the actual killer—Bunker had a history with Hagen from the Naval Academy where she filed a harassment complaint that derailed his career. Walters is proven innocent; Bunker is arrested and tried for murder."},{"custom_id":"lo_s03_e18","season":"3","episode_number":"18","episode_title":"Animal Instinct","air_date":"","source_notes":"Transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Dr. Fay Walsh, a research scientist, is murdered in her university lab. Initially, animal rights activist Dirk Chesney is suspected due to threats and past radical actions. Later, evidence points to Professor Donald Walsh (victim's husband) and administrator Susan Boyd in a conspiracy. Walsh is tried and acquitted after Boyd's testimony falls apart on the stand. Eventually revealed that Boyd suffers from erotomania - a delusional belief she was having an affair with Walsh - and she alone murdered Fay Walsh to remove the 'obstacle' to her fantasy relationship."},{"custom_id":"lo_s03_e19","season":"3","episode_number":"19","episode_title":"Virus","air_date":"","source_notes":"Transcript appears complete through courtroom testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A computer virus inserted into Hogan-Hayes Clinic's blood analyzer causes insulin overdoses, killing 2 patients and putting 3+ in comas. Police initially suspect nurse Rodriguez (who was alone with patients briefly), then hacker John Cook. Cook's father Robert had sued Dr. Hogan for malpractice (diabetic retinopathy), suggesting motive. Evidence against John Cook excluded due to illegal search; prosecutors pivot to charging father Robert Cook with conspiracy, hoping son will confess to save father."},{"custom_id":"lo_s03_e20","season":"3","episode_number":"20","episode_title":"Securitate","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Nicolas Iliescu, a furniture store owner, is murdered. Investigation reveals a credit card fraud scheme. His employee Tommy Zanescu and brother Alex Iliescu are accused. Tommy is accused of murder but has alibi; he and accomplice found murder weapon/car. Alex is arrested for murder but case dismissed on evidence suppression. Alex is then murdered by his son Leon, who confesses. Karen Iliescu initially confesses to protect Leon. Tommy and initially two punk rockers (Wayne Jeffers and accomplice) face false murder accusations with public exposure."},{"custom_id":"lo_s03_e21","season":"3","episode_number":"21","episode_title":"Manhood","air_date":"","source_notes":"Episode centers on Officer Rick Newhouse, a gay cop shot and killed during a drug bust when backup deliberately delayed responding.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Officer Rick Newhouse, a closeted gay police officer, is killed during a confrontation with drug dealers when fellow officers deliberately delayed backup due to anti-gay bias. The prosecution charges three officers with murder two but all are acquitted despite evidence of intentional delay. A dealer (Lucho Martinez) was initially arrested for the murder but the case reveals the real cause was police homophobia. Officer Craig McGraw, also gay and Newhouse's partner, feared for his own safety."},{"custom_id":"lo_s03_e22","season":"3","episode_number":"22","episode_title":"Benevolence","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Kathy McKenna, a deaf university student, is murdered. Initially, her ex-boyfriend Paul Crandall is accused, arrested, and publicly charged based on threatening phone transcripts. After linguistic analysis reveals a hearing person wrote the threats, investigation shifts to Kathy's mentor Dr. Gordon Bryce, who killed her when she planned to leave for California. Crandall was publicly arrested and charged before being cleared."},{"custom_id":"lo_s04_e01","season":"4","episode_number":"1","episode_title":"Sweeps","air_date":"","source_notes":"Transcript appears complete through trial testimony. Rick Mason trial still in progress at end.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Rick Mason, host of tabloid TV show 'Final Confession,' arranges on-air confrontation between child molester Dr. Joseph Vinton and victim Scott Fisher. Scott's estranged father Sid Fisher shows up and shoots Vinton dead on live TV. Investigation reveals Mason manipulated Scott into calling his father with the location, anticipating violent confrontation for ratings. Mason is prosecuted for manslaughter and facilitation. No innocent persons are falsely accused in this episode - Sid Fisher committed the murder he's charged with, and Rick Mason is the actual target of the prosecution who allegedly facilitated it."},{"custom_id":"lo_s04_e02","season":"4","episode_number":"2","episode_title":"Volunteers","air_date":"","source_notes":"Transcript appears truncated at end during defense closing argument.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Roland Kirk, a homeless man with mental illness and crack addiction, is beaten nearly to death with rebar in an alley. Initial suspects include George Siddell (red hat homeless man) and Dr. Creighton (dentist who administered CPR). Investigation reveals Harold Morrissey beat Kirk in retaliation for mugging his wife earlier that evening. Both Siddell and Creighton were innocent of the attack but were publicly suspected/investigated."},{"custom_id":"lo_s04_e03","season":"4","episode_number":"3","episode_title":"Discord","air_date":"","source_notes":"Full transcript available","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Julia Wood, a 19-year-old college student, accuses rock star C-Square (Clarence Carmichael) of rape after going to his hotel suite. The case proceeds to trial where C-Square is convicted of rape in the first degree. No innocent persons were publicly accused or harmed by false accusations in this episode. The defendant was found guilty of the crime he was accused of committing."},{"custom_id":"lo_s04_e04","season":"4","episode_number":"4","episode_title":"Profile","air_date":"","source_notes":"Transcript appears complete through courtroom scenes but cuts off mid-sentence at end","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Serial killer Arthur Tunney shoots four people (three fatally) with a sawed-off shotgun in racially-motivated attacks after his mother was killed by black teenagers. Police develop a profile with FBI help and arrest Tunney based on eyewitness voice ID, weapon match, and white supremacist literature. Defense attorney Horace McCoy challenges the evidence. No innocent persons are publicly accused; the investigation correctly identifies the perpetrator. Tunney is granted bail despite prosecution objections."},{"custom_id":"lo_s04_e05","season":"4","episode_number":"5","episode_title":"Black Tie","air_date":"","source_notes":"Transcript appears truncated during final arguments in appeal hearing","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"Jonathan Keyes dies in his penthouse. After investigation, his wife Danielle is arrested and convicted of murdering him via insulin overdose. The episode focuses on the investigation and trial, with closing scenes showing the beginning of an appeal. No innocent persons are falsely accused or publicly harmed - the investigation correctly identifies the killer (Danielle Keyes). The housekeeper Helga and girlfriend Cathy Rogers provide testimony but are never accused themselves. Lance Keyes (the son) hires a PI to find evidence against his stepmother, but is not himself accused. Transcript ends mid-appeal argument, but conviction stands."},{"custom_id":"lo_s04_e06","season":"4","episode_number":"6","episode_title":"Pride and Joy","air_date":"","source_notes":"Transcript appears complete through trial testimony but cuts off before verdict","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Frank McKinnon, a building superintendent, is found dead with head trauma in what initially appears to be a burglary gone wrong. Investigation reveals his son Sean killed him and staged a break-in. The defense claims Frank was abusive and Sean acted in self-defense, but evidence shows Sean was actually the abuser—repeatedly beating his father and controlling the family. Sean's sister Maureen testifies against him about the pattern of abuse, while mother Catherine supports Sean's false narrative. No innocent persons were falsely accused with public exposure or material harm."},{"custom_id":"lo_s04_e07","season":"4","episode_number":"7","episode_title":"Apocrypha","air_date":"","source_notes":"Transcript appears complete through trial testimony but cuts off mid-sentence during Hendricks' testimony about apocalyptic beliefs.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A car bomb in a Wall Street garage kills one person. Detectives initially suspect Assad Asalam, an Egyptian diplomat whose leased Mercedes was used in the bombing. He is questioned but has an alibi with State Department officials and reports the car stolen. The victim is identified as Wendy Berman, a 19-year-old runaway involved with Daniel Hendricks' Acherusian Temple cult. Hendricks is ultimately charged with felony murder based on kidnapping (through brainwashing), but the initial suspect Asalam was publicly accused and cleared."},{"custom_id":"lo_s04_e08","season":"4","episode_number":"8","episode_title":"American Dream","air_date":"","source_notes":"Transcript appears complete through trial and acquittal","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Phillip Swann was convicted 8 years ago of murdering Sidney Cohen based on accomplice Russell Bobbitt's testimony. When Cohen's body is found in a different location than Bobbitt testified, Swann gets a new trial, represents himself, and is acquitted. The episode focuses on Swann's guilt and his manipulation of the system, not on innocent people harmed by false accusations. While some witnesses invested with Swann and lost money, they were not accused of crimes. The only person who might qualify is Russell Bobbitt (the accomplice witness), but his fate is unclear at transcript end and he was likely complicit in some capacity given the evidence. No qualifying innocent persons harmed by false accusations are present in this episode."},{"custom_id":"lo_s04_e09","season":"4","episode_number":"9","episode_title":"Born Bad","air_date":"","source_notes":"Transcript appears complete through most of trial but cuts off mid-sentence during plea negotiation discussion.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"A 13-year-old runaway, Johnny Lasky, is found beaten to death. Investigation reveals he was killed by his 14-year-old foster brother Chris Pollit during a fight after a burglary attempt. Chris is tried as an adult; defense argues XYY chromosome syndrome made him genetically predisposed to violence. No false accusations or wrongly accused persons identified in this episode - the actual perpetrator (Chris) is identified early and remains the defendant throughout."},{"custom_id":"lo_s04_e10","season":"4","episode_number":"10","episode_title":"The Pursuit of Happiness","air_date":"","source_notes":"Transcript appears complete through courtroom proceedings and plea negotiation scene","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"William Cooper, 56, owner of a meat distribution business, is shot to death in his office. Investigation reveals his wife Irina (26, Russian mail-order bride) was having an affair with Alex Nunez, a lab technician. Evidence shows Nunez killed Cooper after Irina arranged for her husband to be alone at the office. Both are arrested and tried. The case involves a coerced abortion, Cooper's controlling behavior toward Irina, and her desire to bring her son from Russia. No innocent persons were publicly accused or harmed by false accusations - the investigation correctly identified the perpetrators from the start."},{"custom_id":"lo_s04_e11","season":"4","episode_number":"11","episode_title":"Golden Years","air_date":"","source_notes":"Transcript appears complete through trial testimony but cuts off mid-sentence during priest's visit to Stone.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Mildred Bauer, 82, is found dead after an apparent burglary. Initially suspected burglar Maria Gonzales (the live-in maid) and her boyfriend Felix Ortega are cleared when evidence emerges that granddaughter Laura Bauer systematically starved her grandmother to death. Maria becomes a key witness against Laura, who is arrested for murder. The case reveals Maria was wrongly accused of burglary and faced deportation, while Laura is ultimately tried for depraved indifference homicide."},{"custom_id":"lo_s04_e12","season":"4","episode_number":"12","episode_title":"Snatched","air_date":"","source_notes":"Transcript appears complete through verdict reading but cuts off mid-sentence at end","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Jason Bregman stages his own kidnapping with accomplices Watson and Navarro to extort $4 million from his father Sol. When the scheme goes wrong and Jason is shot, Watson and Navarro claim Jason was the mastermind. No innocent persons are falsely accused - Jason was complicit, and Watson/Navarro are guilty of the crimes charged (larceny, though acquitted of attempted murder). The case involves a spoiled son exploiting his wealthy father, not false accusations against innocent parties."},{"custom_id":"lo_s04_e13","season":"4","episode_number":"13","episode_title":"Breeder","air_date":"","source_notes":"Transcript appears complete through courtroom testimony but cuts off during final scene with Savitts' lawyer.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Young woman Debra Elkins gives birth and claims her baby was stolen. Investigation reveals she promised the baby to multiple couples for money. Dorothy Baxter, a desperate infertile woman who believed she had a contract for the baby, kidnaps the infant from the hospital. Baxter is arrested but ultimately receives a suspended sentence. The episode focuses on private adoption fraud, with Baxter being the primary falsely accused party who suffers public arrest and prosecution despite being portrayed sympathetically as a victim of Elkins' scheme."},{"custom_id":"lo_s04_e14","season":"4","episode_number":"14","episode_title":"Censure","air_date":"","source_notes":"Transcript appears complete. Episode focuses on Judge Joel Thayer stalking/threatening Janet Rudman and her child, then falsely accusing ADA Claire Kincaid of misconduct when she investigates.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Judge Joel Thayer stalks Janet Rudman and threatens her child after their affair. When ADA Claire Kincaid investigates, Thayer retaliates by falsely claiming she made sexual advances toward him, resulting in her professional censure. Kincaid is later vindicated when evidence proves Thayer's guilt."},{"custom_id":"lo_s04_e15","season":"4","episode_number":"15","episode_title":"Kids","air_date":"","source_notes":"Episode centers on accidental shooting of Angel Ramirez by Kevin Parker, who was trying to shoot gun dealer Juan Domingo. Multiple false suspects before the truth emerges.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"14-year-old Angel Ramirez is shot and killed on the street. Initially appears random, but investigation reveals Kevin Parker (16) shot at gun dealer Juan Domingo (who had shot Parker's friend Ricky Morales) and accidentally hit Angel. Juan Domingo is falsely accused of Angel's murder before evidence points to Parker. Multiple students are questioned, Billy Wojak is arrested for holding guns in his locker. Case ends in mistrial after key witness Domingo is killed in suspicious circumstances."},{"custom_id":"lo_s04_e16","season":"4","episode_number":"16","episode_title":"Big Bang","air_date":"","source_notes":"Transcript appears truncated mid-sentence during final scene with Prof. Munson testimony discussion.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Florence Manning is killed by a mail bomb. Her estranged husband, physicist Edward Manning, is initially suspected due to divorce proceedings and his new girlfriend. Max Weiss, a struggling physicist, is arrested after bomb materials are found in his lab drawer. Weiss initially claims Manning hired him, but prosecutors discover Weiss had his own motive: Manning stole his scientific theory and sabotaged his grant application. The case reveals Weiss targeted Manning but accidentally killed Manning's estranged wife at their old shared address. Manning is also investigated for scientific theft/larceny but appears to avoid full cooperation to protect his reputation."},{"custom_id":"lo_s04_e17","season":"4","episode_number":"17","episode_title":"Mayhem","air_date":"","source_notes":"Transcript appears truncated mid-sentence at end","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Episode involves multiple murders on a single day. Ken Scofield is shot in Battery Park; Drew Washington is killed in a robbery; Scott Hexter becomes primary suspect in Scofield killing based on witness descriptions and parking tickets for tan Chevy in area. Hexter is arrested despite providing alibi (movies) he cannot verify. Evidence shows his car in Forest Park at time of Queens murder AND in Riverdale (hit-and-run) 10 minutes after Battery Park murder - physically impossible. Transcript ends before resolution, but strong implication Hexter may be wrongly accused. Also features Louisa D'Angelo who kills abusive husband (actual perpetrator, not false suspect). No other clearly innocent accused persons identified with sufficient public exposure/harm."},{"custom_id":"lo_s04_e18","season":"4","episode_number":"18","episode_title":"Wager","air_date":"","source_notes":"Transcript appears truncated at end; final dialogue cut off mid-sentence","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Benny Williams, business manager and father of baseball star Pat Williams, is beaten to death. Initially, investigators focus on Papa Doc (Henry Doinel), a bookmaker Benny owed money to, and Joey Lang, Papa Doc's enforcer. Papa Doc is arrested and charged with murder. However, evidence emerges that Pat Williams may have lied about his gambling activity and his whereabouts the night of the murder. The transcript ends abruptly during what appears to be a confrontation with Pat about the truth. Papa Doc appears to be innocent or at least wrongly charged based on developing evidence pointing toward Pat."},{"custom_id":"lo_s04_e19","season":"4","episode_number":"19","episode_title":"Sanctuary","air_date":"","source_notes":"Episode involves a hit-and-run case (Joshua Berger) and subsequent riot murder (Isaac Roberts). Complex racial tensions and legal maneuvering around both cases.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Joshua Berger, a Jewish businessman, hits and kills 12-year-old Damon Fox in Harlem. Forensic evidence shows he was not speeding (20-25 mph). An eyewitness (Bobby) fabricated testimony claiming Berger was going 50 mph, likely coached by Reverend Ott. Grand jury refuses to indict Berger based on forensic evidence contradicting eyewitness. Berger pleads to leaving the scene. This triggers a riot where Isaac Roberts kills John De Santis (mistaken for Jewish). Roberts is tried for murder but jury deadlocks; DA declines retrial."},{"custom_id":"lo_s04_e20","season":"4","episode_number":"20","episode_title":"Nurture","air_date":"","source_notes":"Transcript appears complete through courtroom scenes but cuts off mid-sentence at end.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"A 10-year-old girl, Wendy Sylvester, goes missing from her foster home. Police discover she was taken by Arnette Fenady, a volunteer poetry teacher who had previously been arrested for attempting to kidnap another child. Fenady believes she is rescuing abused children and confuses them with her own dead daughter, Crystal. The case examines the foster care system's failures and Fenady's mental illness. No innocent parties are falsely accused—Fenady is guilty of kidnapping, and the investigation correctly identifies her as the perpetrator. Wendy ultimately lies on the stand to protect Fenady, whom she sees as having saved her from an abusive situation."},{"custom_id":"lo_s04_e21","season":"4","episode_number":"21","episode_title":"Doubles","air_date":"","source_notes":"Transcript appears truncated mid-sentence. Final dialogue cuts off during legal discussion about Korey Burke's diary.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Tennis prodigy Korey Burke is attacked at practice - her wrist broken, ending her season. Initial suspect Alan Lovitz (obsessed fan) is cleared by lineup. Marc Kenner confesses to being hired by rival player Alison Hall for $10k, but recants when his confession is suppressed. Prosecutors then suspect Korey's father Mitchell Burke orchestrated the attack to preserve endorsement money when Korey wanted to quit. Transcript reveals Korey has history of 'accidents' and sees psychiatrist. Final twist suggests Korey may have arranged her own injury to escape her father's pressure. Alison Hall arrested and charged despite weak motive. Transcript ends mid-legal argument about Korey's psychiatric diary as potential exculpatory evidence."},{"custom_id":"lo_s04_e22","season":"4","episode_number":"22","episode_title":"Old Friends","air_date":"","source_notes":"Transcript appears truncated at the end during Ann Madsen's testimony.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Harry Renkmeyer is found dead, initially appearing to be pushed into traffic by a homeless man named Rudy. Investigation reveals Renkmeyer was shot before being run over. Ann Madsen, CEO of Nature's Way baby food company, is coerced into testifying against her business partner Steven Green after initially lying under oath out of fear of the Russian mob (Gruskov family). Rudy is arrested but later cleared when autopsy shows shooting, not traffic accident. Ann Madsen commits perjury under threat, then is arrested for it to force her cooperation."},{"custom_id":"lo_s05_e01","season":"5","episode_number":"1","episode_title":"Second Opinion","air_date":"","source_notes":"Transcript appears complete through courtroom testimony. Episode centers on Dr. Nancy Haas, a non-MD scientist offering alternative cancer treatment with apricot seeds, accused of murdering Ann Bennett by convincing her to forgo surgery.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Ann Bennett dies of liver cancer after following Dr. Nancy Haas's metabolic therapy instead of having surgery. Investigation reveals Haas charged patients $75,000 for treatments using apricot seeds (containing trace cyanide/amygdaline). No innocent suspects are publicly accused; investigation focuses on Haas from early on. Nicholas Bennett is briefly considered but never publicly accused or confronted as a suspect. The case proceeds as a murder prosecution against Haas for fraudulently convincing patients to avoid life-saving surgery."},{"custom_id":"lo_s05_e02","season":"5","episode_number":"2","episode_title":"Coma","air_date":"","source_notes":"Transcript appears truncated at end during Detective Logan's dialogue","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Sandra Dobson is shot and left in a coma. Police initially suspect a car radio thief named Jerome who was in the area. Jerome is arrested for radio thefts but denies shooting anyone. The investigation shifts to Michael Dobson, Sandra's husband, who is eventually arrested and tried for attempted murder/murder. The transcript appears to cut off during trial proceedings, so the final resolution is unclear."},{"custom_id":"lo_s05_e03","season":"5","episode_number":"3","episode_title":"Blue Bamboo","air_date":"","source_notes":"Transcript appears complete through trial testimony but cuts off mid-sentence during final discussion.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Japanese businessman Shiunro Hayashi is murdered in his hotel room. Investigation initially focuses on hotel employee Danny Zabel and his brother-in-law Charles Kett (who robbed another hotel guest previously). Zabel is arrested as accomplice but later cleared when Kett has alibi. Singer Suzy is questioned after being with Hayashi but cleared when forensics show different woman's hair. Investigation ultimately leads to Martha Bowen, who killed Hayashi after he forced her into prostitution in Japan a year earlier. Two innocent people publicly accused: Danny Zabel and Suzy."},{"custom_id":"lo_s05_e04","season":"5","episode_number":"4","episode_title":"Family Values","air_date":"","source_notes":"Transcript appears truncated at the end during Maggie's testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Laura Madsen is found dead in the East River. Victor Conner (her ex-husband) is initially suspected due to a history of domestic violence and a recent argument over custody papers. He is publicly investigated but later cleared when the timeline and evidence point to Steve Martell (Laura's current husband) and potentially Maggie Conner (Laura's daughter). The transcript ends mid-testimony, making full analysis incomplete."},{"custom_id":"lo_s05_e05","season":"5","episode_number":"5","episode_title":"White Rabbit","air_date":"","source_notes":"Transcript appears truncated mid-testimony. Analysis may be incomplete.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Episode concerns a 1971 armed robbery of Nucon Technologies where Officer Vincent Perella was killed. In present day (1994), the stolen money and murder weapon are recovered from a safe deposit box. Investigation reveals Susan Forrest (living under alias Rita Levitan) was involved. However, Henry Maybrook (security guard) and his cousin Eddie were falsely accused of the vault burglary before the real perpetrators were identified. Professor William Goodwin was also accused but appears to have actually aided Susan Forrest (partial involvement). Transcript cuts off during Margaret Pauley's testimony, making complete analysis difficult."},{"custom_id":"lo_s05_e06","season":"5","episode_number":"6","episode_title":"Competence","air_date":"","source_notes":"Transcript appears complete through final courtroom resolution. Lieutenant Van Buren shoots James Gordon (mentally retarded, unarmed 14-year-old) during attempted ATM robbery. Zack Rowland (accomplice with gun) initially accused, later charged with felony murder.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Lt. Van Buren shoots unarmed, mentally retarded 14-year-old James Gordon during ATM encounter, believing accomplice Zack Rowland had a gun. James dies; Van Buren faces investigation and grand jury. No-billed by grand jury prioritizing public safety over scrutiny of police conduct. Zack charged with felony murder after gun recovered. Episode explores competence to commit crime, prosecutorial withholding of evidence (bracelet motive), and racial dynamics in justice system. James Gordon qualifies as innocent person harmed by false accusation of attempted robbery—he lacked mental capacity to form criminal intent and was buying girlfriend's bracelet with legitimately earned money."},{"custom_id":"lo_s05_e07","season":"5","episode_number":"7","episode_title":"Precious","air_date":"","source_notes":"Transcript appears truncated at the end during plea discussion. Episode centers on Eileen and Martin Willach, whose infant Emily dies. Investigation reveals two prior infant deaths (Daniel, Caroline) and an incident with foster child Gary.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Baby Emily Willach is reported kidnapped from Central Park but is found dead in a cooler by the Hudson River. Investigation reveals Martin Willach faked the kidnapping to cover up the death. Focus shifts to mother Eileen Willach, suspected of smothering Emily and potentially two previous biological children plus harming a foster child. However, a bald man with a camera was witnessed in the park that morning and became an early suspect before being cleared. The case ends in a hung jury (9-3 for conviction) with prosecution seeking retrial."},{"custom_id":"lo_s05_e08","season":"5","episode_number":"8","episode_title":"Virtue","air_date":"","source_notes":"Transcript appears complete through defense opening; episode focuses on sexual coercion/quid pro quo harassment rather than traditional rape case","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Lyssa Wesley dies in car crash after alleged rape by Councilman Spencer Talbert. Investigation reveals pattern of sexual coercion at his former law firm. Sarah Maslin initially claims rape but recants, revealing quid pro quo sexual harassment (partnership in exchange for sex). Prosecution pivots to larceny by extortion theory. Episode centers on distinguishing forcible rape from coerced consent under threat of career destruction."},{"custom_id":"lo_s05_e09","season":"5","episode_number":"9","episode_title":"Scoundrels","air_date":"","source_notes":"Transcript appears complete through trial testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Lawyer Arthur Kopinsky is murdered. Initial investigation focuses on Carl Piselli, who was publicly accused of the murder and cleared via alibi. John Curren, a Tappan victim, is then arrested and tried. The case reveals Kopinsky was running a scam on Tappan victims while also blackmailing Tappan over hidden money. Tappan manipulated Curren into killing Kopinsky. Both Piselli and initially John Curren qualify as falsely accused persons who suffered public exposure and consequences."},{"custom_id":"lo_s05_e10","season":"5","episode_number":"10","episode_title":"House Counsel","air_date":"","source_notes":"Transcript appears complete through courtroom hearing scene","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"David Lempert, a city Parks Department accountant, is murdered after serving as a juror in mob boss Vincent Dosso's trial. Investigation reveals Lempert was bribed to hang the jury. Defense attorney Paul Kopell helped facilitate jury tampering by bribing a court clerk to identify vulnerable jurors. Lempert was later killed, likely because he became a liability. The episode focuses on prosecuting Dosso and Kopell for conspiracy to murder. No falsely accused innocent persons are identified in the transcript - Furini and Dosso appear to be the actual perpetrators, and Kopell facilitated the crime. Lempert was a victim who accepted a bribe but was not accused of a crime he didn't commit."},{"custom_id":"lo_s05_e11","season":"5","episode_number":"11","episode_title":"Guardian","air_date":"","source_notes":"Transcript appears truncated during Matthew Blanchard's cross-examination testimony.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Katie Blanchard, a wealthy heroin addict, is found dead behind a dumpster. Her brother Matthew and family adviser Jerome Kamen are accused at different points. Matthew injected Katie with heroin and called Kamen when she started convulsing. Kamen took her from the apartment but left her to die instead of seeking medical help. Matthew was initially suspected and later testified against Kamen. The transcript cuts off during cross-examination, making final disposition unclear."},{"custom_id":"lo_s05_e12","season":"5","episode_number":"12","episode_title":"Progeny","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Dr. Eileen Reed, an abortion provider, is murdered. Nancy Gunther infiltrates the clinic under a false name to gather information. Randall Jenkins shoots Dr. Reed for revenge after his wife had an abortion. Drew Seeley, a defrocked priest and anti-abortion activist, confesses to orchestrating the murder to put abortion on trial but ultimately admits he couldn't pull the trigger himself. Nancy Gunther's infiltration and information gathering directly enabled the murder, and she was publicly exposed during the investigation and trial. Dr. Simon Reed (the victim's husband) was publicly questioned and suffered emotional harm related to the accusation that he wanted his wife to stop performing abortions (though this is a stretch as he was more a witness than accused)."},{"custom_id":"lo_s05_e13","season":"5","episode_number":"13","episode_title":"Rage","air_date":"","source_notes":"Transcript appears complete through courtroom testimony but cuts off mid-sentence during Bryant's cross-examination of Cooke.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"Wallace Holbrook, a Wall Street executive, is murdered in his home. Initially staged as a suicide, investigation reveals his neck was broken and the shotgun wound was postmortem. Police focus on Bud Greer, Holbrook's top trader, who made $7 million but was actually running phantom trades. Greer is arrested based on fingerprints at the scene and motive (Holbrook discovered the fraud). Defense claims racial bias and introduces 'black rage' defense. No innocent suspects are publicly accused or harmed - Greer appears to be the actual perpetrator throughout the investigation."},{"custom_id":"lo_s05_e14","season":"5","episode_number":"14","episode_title":"Performance","air_date":"","source_notes":"Transcript appears complete through trial and appeal scenes","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Two teenage boys, Shane Sutter and Kyle Winters, are arrested and convicted for raping 16-year-old Corey Russell on videotape. The case involves a points-for-sex competition among a clique called the Mack Rangers. The convictions are overturned on appeal due to excluded evidence about the Rangers, leading to a conspiracy case strategy. No individuals are proven or strongly implied innocent after being publicly accused in this episode."},{"custom_id":"lo_s05_e15","season":"5","episode_number":"15","episode_title":"Seed","air_date":"","source_notes":"Transcript appears complete through court proceedings. Episode focuses on fertility fraud investigation.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Episode centers on Dr. Jordan Gilbert, a fertility doctor who commits fraud by using his own sperm for artificial insemination procedures while claiming to use anonymous donors, and by lying to patients about pregnancies. Susan Parker, one of his patients, has a violent breakdown at her husband's workplace (believing he caused her miscarriage), resulting in her death by security guard. Investigation reveals Gilbert's extensive fraud scheme affecting dozens of patients. While Gilbert's actions harm many people through deception, no one is falsely accused of a crime they didn't commit. Brandon Parker is initially suspected of spousal abuse causing the miscarriage, but evidence supports his account of self-defense, and Susan Parker was never actually pregnant (Gilbert's lie). The episode is about medical/financial fraud, not false criminal accusations with public exposure."},{"custom_id":"lo_s05_e16","season":"5","episode_number":"16","episode_title":"Wannabe","air_date":"","source_notes":"Transcript appears complete through most of final scene but cuts off mid-sentence during negotiation about Stewart Barclay's testimony deal.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"William Prescott, an accountant, is shot and killed. Initially suspected is union baggage handler Harrigan over job cuts, then Jimmy Rose (who was acquitted of a prior murder with the same gun). The gun is traced to Colin Harrigan (Tom's son), a expelled prep school student who had threatened another student. Colin is arrested based on gunpowder residue on gloves, but the case is dismissed when the search warrant is suppressed. Tom Harrigan (the father) then confesses to protect his son, but his allocution contains factual errors proving he didn't do it. The actual shooter appears to be Colin Harrigan, with conspiracy involvement by wealthy student Stewart Barclay, whose father (school board chairman/legal counsel) tries to negotiate immunity for his son's testimony."},{"custom_id":"lo_s05_e17","season":"5","episode_number":"17","episode_title":"Act of God","air_date":"","source_notes":"Transcript appears truncated mid-sentence during suppression hearing argument.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"A building explosion kills 12-year-old Robbie Cuneo. Police initially suspect general contractor Buzz Palley due to financial motive and lies, then arrest him. Later evidence shifts focus to Hank Chappel (husband of Palley's girlfriend Chris), who had access to explosives and fired warning shots at Palley. Chappel is convicted. Post-conviction, police realize Palley never returned to the scene the night of the bombing, suggesting he set it. New wiretap evidence leads to arrests of both Palley and Chris Chappel, with defense arguing Hank Chappel was wrongfully convicted. Transcript ends mid-suppression hearing."},{"custom_id":"lo_s05_e18","season":"5","episode_number":"18","episode_title":"Privileged","air_date":"","source_notes":"Transcript appears truncated mid-testimony (Mrs. Bartlett's account). Missing conclusion of trial/verdict.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"David and Eileen Lerner are murdered in their bed in a former brownstone owned by divorce attorney Warren Bartlett. Steven Smith, Bartlett's foster son, killed them during an alcoholic blackout, believing he was in his old bedroom attacking his abusive foster parents. Under hypnosis, Smith reveals childhood abuse by foster mother Leah Bartlett. Defense argues justifiable homicide/self-defense based on repressed trauma. No false suspects are identified—investigation correctly identifies Smith as perpetrator from the start via fingerprint evidence. Transcript ends mid-trial during Mrs. Bartlett's testimony about her abuse of Steven."},{"custom_id":"lo_s05_e19","season":"5","episode_number":"19","episode_title":"Cruel and Unusual","air_date":"","source_notes":"Transcript appears complete through courtroom scenes. Focus is on Dr. Colter's aversion therapy clinic for autistic children and Kevin Jeffries' death.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Kevin Jeffries, an autistic teen, dies in police custody from a cerebral thrombosis caused by repeated trauma to his carotid artery. Initial suspect is Detective Mike Logan for restraint during custody. Investigation reveals Kevin was a patient at Dr. Colter's behavioral clinic where aversion therapy including electric shocks and a 'buzzbox helmet' was used. Night worker Joe Garvey is briefly arrested for assault before Dr. Colter becomes the primary suspect for murder. Episode explores consent, medical ethics, and parents' desperation for treatment of severely autistic children."},{"custom_id":"lo_s05_e20","season":"5","episode_number":"20","episode_title":"Bad Faith","air_date":"","source_notes":"Transcript appears truncated at end during Family Services worker testimony","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"Detective Billy Morino is found dead in Riverside Park from apparent suicide staged as murder. Investigation reveals he was molested as a child by Father Joe Krolinsky and had recently confronted Krolinsky about past abuse. Morino appears to have accepted $50,000 from Krolinsky before dying by suicide. Defense claims Morino was Krolinsky's accomplice in procuring other children. Detective Mike Logan testifies under subpoena that young Morino once tried to recruit him for Krolinsky. Episode focuses on prosecuting Krolinsky for decades of abuse using conspiracy theory with church as unindicted co-conspirator. No one is falsely accused then cleared - the victim (Morino) is dead, and the perpetrator (Krolinsky) is actually guilty of the abuse."},{"custom_id":"lo_s05_e21","season":"5","episode_number":"21","episode_title":"Purple Heart","air_date":"","source_notes":"Transcript appears complete through courtroom proceedings but cuts off mid-sentence at end","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Cab driver Danny Johnson is murdered. Initially appears to be a robbery, but detectives discover he was carrying $15,000 to repay a loan shark. Charles Kovac, a plumber/junkie, is identified as the killer but is then found murdered. Police theory: Johnson's wife Denise hired Kovac to kill her husband, then killed Kovac to silence him. Evidence includes a phone call from Kovac to Denise and the murder weapon traced to her former workplace. During trial, prosecutors also discover evidence she had previously hired another man (Lattimer) to kill her husband two months earlier, which failed. Multiple people are falsely suspected during the investigation."},{"custom_id":"lo_s05_e22","season":"5","episode_number":"22","episode_title":"Switch","air_date":"","source_notes":"Transcript appears complete through trial/hearing scenes","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Dr. Lillian Hampton, a psychiatrist at a free clinic, is murdered. Initially, detectives suspect her ex-husband, then investigate patients Edward Brennig and Paul White (both cleared via alibis). Megan Nelson, Hampton's patient with Multiple Personality Disorder, becomes a suspect after one of her 'alters' (Bobby) confesses. However, Bobby's confession contains a factual error proving he wasn't present. The real killer is Megan's father Frank Nelson, who killed Hampton after she helped Megan recover a repressed memory of Frank murdering Megan's mother 18 years earlier. Frank is publicly arrested. Megan is arrested for conspiracy but charges are dismissed without prejudice. Bobby's false confession is an attempt to protect Megan from having to testify against her father."},{"custom_id":"lo_s05_e23","season":"5","episode_number":"23","episode_title":"Pride","air_date":"","source_notes":"Transcript appears complete through trial testimony.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Gay City Councilman Richard Durban is shot and killed. Initial investigation focuses on his live-in boyfriend Joe Gibb, a prostitute/pimp. Police threaten to expose married city employee Leo Barnett's secret gay life to coerce testimony about Gibb's alibi. Gibb is publicly accused and arrested, his apartment searched, stolen property recovered. Later evidence shifts to Councilman Kevin Crossley, who is ultimately tried for the murder. Both Gibb and Barnett suffer public exposure as false suspects."},{"custom_id":"lo_s06_e01","season":"6","episode_number":"1","episode_title":"Bitter Fruit","air_date":"","source_notes":"Transcript appears complete through investigation and trial.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"12-year-old Jody Gaines is found dead. Investigation focuses on Nick Capetti, a glazier with a criminal record, after evidence connects him to the crime scene. Karen Gaines (the victim's mother) shoots Capetti in court before trial. Later revealed that Karen hired Capetti to kidnap Jody to terrorize her ex-husband; the girl's death was unintended. The bus driver was initially suspected but cleared."},{"custom_id":"lo_s06_e02","season":"6","episode_number":"2","episode_title":"Rebels","air_date":"","source_notes":"Transcript appears complete through final dialogue line but cuts off mid-sentence during final interrogation of Caridad Montero.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"NYU student Tommy Bell is stabbed to death at Strokers bar. Initial investigation focuses on girlfriend Caridad Montero's ex-boyfriend Igor (Daniel Smith) as prime suspect based on Caridad's testimony. However, Milton 'Stiletto' Stillman confesses to the murder before grand jury. Evidence emerges that Caridad may have set Tommy up by giving him a Yankee Rebel jacket to wear, knowing it would provoke violence. Igor was publicly accused and arrested but appears innocent of the murder itself. Stiletto's confession may be coerced by gang pressure. Transcript ends mid-interrogation of Caridad, preventing full resolution certainty."},{"custom_id":"lo_s06_e03","season":"6","episode_number":"3","episode_title":"Savages","air_date":"","source_notes":"Transcript appears complete through trial and sentencing hearing arguments.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Undercover cop Bobby Croft is murdered. Initially, detectives suspect drug dealer Ted Quinlan, who had alibis and was not arrested. The case shifts to accountant Paul Sandig, who was laundering money for Quinlan and killed Croft to prevent testimony. Quinlan was publicly accused, arrested for money laundering, and later given immunity to testify against Sandig. Episode becomes first test of NY's new death penalty statute."},{"custom_id":"lo_s06_e04","season":"6","episode_number":"4","episode_title":"Jeopardy","air_date":"","source_notes":"Transcript appears complete through trial dismissal and investigation of judicial corruption.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Three people are murdered at a computer magazine office. Peter Nicodos is arrested for killing his brother Eddie and two coworkers, motivated by Eddie's role in exposing Peter's affair (leading to blackmail). Judge Hynes systematically excludes key evidence and dismisses the case mid-trial. Investigation reveals Hynes received a $600k preferential loan (saving $300k in interest) from the Nicodos family bank, constituting a bribe. Multiple innocent people were publicly accused during the investigation before Peter was identified as the killer."},{"custom_id":"lo_s06_e05","season":"6","episode_number":"5","episode_title":"Hot Pursuit","air_date":"","source_notes":"Transcript appears complete through trial phase; ends mid-sentence during plea negotiation","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Leslie Harlan claims she was kidnapped by Leon Trapp and forced to participate in robberies/murders. Investigation reveals she may have been a willing participant. She knew the Vivant Room bartender's nickname and likely suggested it as a target. No innocent persons were falsely accused with public exposure or material harm in this episode - the investigation correctly identified the perpetrators (Leon Trapp and Leslie Harlan) from the beginning. The legal question centers on whether Harlan acted under duress or was a voluntary participant, not whether she was wrongly accused."},{"custom_id":"lo_s06_e06","season":"6","episode_number":"6","episode_title":"Paranoia","air_date":"","source_notes":"Transcript appears complete through courtroom testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"College student Alison Reich is murdered in her dorm room. Police initially suspect Merril Grupp, a student who wrote violent sexual fantasies about a character matching Alison's description on an online bulletin board and had stolen her underwear. He is publicly interrogated and accused. Later, evidence points to Alison's roommate Megan Maslin as the actual killer. Grupp was innocent of murder but guilty of theft and cyberstalking behavior."},{"custom_id":"lo_s06_e07","season":"6","episode_number":"7","episode_title":"Humiliation","air_date":"","source_notes":"Transcript appears complete through trial and post-conviction investigation revealing Julia Danforth may have framed her husband.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Prostitute Gwyn George is murdered. Dr. Mark Danforth admits using her services and is arrested, tried, and convicted of her murder based on circumstantial evidence including $2000 withdrawals matching money found on victim, registered .22 Colt (murder weapon type), and his wife Julia's suspicious testimony. Post-conviction, Claire discovers Julia may have known about Mark's activities all along and possibly killed Gwyn herself to frame Mark, including making anonymous tip calls and deliberately fumbling testimony to ensure conviction."},{"custom_id":"lo_s06_e08","season":"6","episode_number":"8","episode_title":"Angel","air_date":"","source_notes":"Transcript shows Leah Coleman accused multiple individuals during investigation before confessing to killing her own baby.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Leah Coleman reports her baby Rachel kidnapped from church. She initially describes seeing a young Puerto Rican man in the back row. Police pursue this lead, question a suspect (Ricardo with 12 earrings), and conduct a lineup. Later, during a walk-through with Detective Curtis, Leah confesses she smothered Rachel and cremated her in the building's furnace. The episode centers on Leah's trial, where she's convicted of murder despite an insanity defense. The false suspects were exposed publicly during the investigation and press conference."},{"custom_id":"lo_s06_e09","season":"6","episode_number":"9","episode_title":"Blood Libel","air_date":"","source_notes":"Transcript appears complete through courtroom testimony phase. Defense attorney Roy Payne attempting to argue conspiracy theory that Jewish investigators framed Matt Hastings to protect Richard Kovax.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Art teacher Sarah Aronson is murdered at Advanced Studies high school. Investigation initially focuses on Richard Kovax (math teacher selling grades) and Eddie Camarillo (student), both later cleared. Matt Hastings, a high-achieving student involved in grade-buying scheme, is ultimately charged. Kovax faced accusations of both financial corruption and potential involvement in murder; Camarillo was accused of murder conspiracy. Both experienced public exposure and consequences before being cleared or having their roles clarified."},{"custom_id":"lo_s06_e10","season":"6","episode_number":"10","episode_title":"Remand","air_date":"","source_notes":"Transcript appears complete through trial testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Sal Munoz served 30 years for the 1965 rape and stabbing of Cookie Costello before his conviction was set aside due to his attorney's conflict of interest. A new trial reveals that Munoz was questioned for 6 hours without Miranda warnings (before Miranda was decided), picked from a questionable lineup, and may have been beaten. While Munoz is ultimately retried, the episode focuses heavily on the flawed original investigation and prosecution. Cookie Costello was publicly exposed during both the original investigation and the new trial, with her pregnancy, gambling activities, and sexual history revealed in court."},{"custom_id":"lo_s06_e11","season":"6","episode_number":"11","episode_title":"Corpus Delicti","air_date":"","source_notes":"Transcript appears complete through trial testimony but cuts off during cross-examination of Mrs. Grayson","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"Episode centers on the murder of Ruth Thomas by Lyle Christopher, a con man who killed her to silence her threats of exposure. Christopher also ran an insurance fraud scheme killing horses, using hired killer Tibor Nichols. Richard Brandson hired Nichols to kill his daughter's underperforming show horse Mr. Wickets. No persons shown to be falsely accused then cleared - Christopher appears guilty throughout, Brandson confesses/cooperates, Nichols confesses. The case revolves around proving the murder without a body."},{"custom_id":"lo_s06_e12","season":"6","episode_number":"12","episode_title":"Trophy","air_date":"","source_notes":"Transcript appears truncated mid-testimony. Diana Hawthorne's direct testimony cuts off.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Serial killer Simon Brooks murders young black boys, leaving notes saying 'They must be destroyed.' Police arrest Andrew Dillard, who is convicted and serves 5 years. Brooks continues killing after his mother dies. When Brooks confesses to all murders, it's revealed ADA Diana Hawthorne concealed witness statement pointing to Brooks and coached handwriting expert to strengthen case against Dillard. Dillard sues and settles for $3M. Hawthorne is charged with criminal facilitation for enabling Brooks' later murders. Episode explores prosecutorial misconduct and McCoy's role as Hawthorne's supervisor/lover during original case."},{"custom_id":"lo_s06_e13","season":"6","episode_number":"13","episode_title":"Charm City","air_date":"","source_notes":"Transcript appears truncated during McCoy's closing argument","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"A gas bomb kills 20 people on a subway. Baltimore detectives Pembleton and Bayliss assist NYPD in connecting the case to a similar Baltimore church bombing from 5 years earlier. Brian Egan, a white man with access to metallic arsenic, is arrested based on eyewitness ID and forensic evidence. Pembleton's interrogation violates constitutional rights, leading to exclusion of Egan's statement. The defense argues the prosecution is racially motivated against a white defendant. The trial proceeds with circumstantial evidence. Transcript ends mid-closing argument, verdict unknown."},{"custom_id":"lo_s06_e14","season":"6","episode_number":"14","episode_title":"Custody","air_date":"","source_notes":"Transcript appears complete through opening statements and testimony. Dialog cuts off mid-conversation between Claire and Paul about racism.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Social worker Lawrence Bello is murdered in a playground. Detectives discover he was running a foster care fraud scheme. Investigation reveals Jenny Mays, a former crack addict whose parental rights were terminated, hired her boyfriend Michael Walters to get her son's address from Bello, leading to Bello's death. Mays then kidnapped her son from his adoptive family (the Corbins). Defense argues institutional racism in child welfare system justified her actions."},{"custom_id":"lo_s06_e15","season":"6","episode_number":"15","episode_title":"Encore","air_date":"","source_notes":"Transcript appears truncated at end during Dobson's final statement","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Emily Dobson is murdered in Central Park. Evidence points to Luis Cruz, a former enforcer for mobster Joey Giabone. Police arrest Michael Dobson (Emily's husband) for hiring Cruz, believing it parallels his first wife's murder. Jessica Nash (Dobson's girlfriend/employee) and Antonio (busboy) testify about their affair, establishing motive. Cruz is captured and claims Dobson hired him for $10,000, but the money has Joey Giabone's fingerprints. Jessica Nash initially believed Dobson was getting a divorce (never confirmed). The transcript ends mid-sentence with Dobson apparently about to reveal Giabone threatened his children. Unclear if Dobson actually hired Cruz or if Giabone was involved independently. Multiple people were publicly accused/exposed during investigation."},{"custom_id":"lo_s06_e16","season":"6","episode_number":"16","episode_title":"Savior","air_date":"","source_notes":"Transcript appears truncated at the end during Jack's statement about Chester Manning.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Joyce Weber and her son Billy are murdered; daughter Jenna survives. Husband Ron Weber is accused based on financial motive (lost job, insurance money, debt) and missing alibi during blackout drinking. Trial proceeds with expert testimony on 'family annihilators.' Multiple suspects emerge: Ron Weber (husband), Chester Manning (Jenna's ex-boyfriend with criminal record), and Sergei Yentakov (mobster Joyce was helping OCCB sting). Transcript ends mid-trial, outcome unclear. Ron Weber appears to qualify as falsely accused if innocent, as does Chester Manning who was questioned as suspect."},{"custom_id":"lo_s06_e17","season":"6","episode_number":"17","episode_title":"Deceit","air_date":"","source_notes":"Transcript appears complete through investigation/pre-trial phase. Episode centers on murder of gay lawyer Elliot Wells by unclear perpetrator - focus shifts from environmental activist to drag queen ex-lover Tony to closeted senior partner Jerold Dixon to potentially Dixon's wife Sela.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Lawyer Elliot Wells is murdered. Investigation cycles through multiple suspects: environmental activist Larry Philbert (cleared via alibi), Wells' drag queen ex-lover Tony Conneca (used as police informant in sting operation), and closeted senior partner Jerold Dixon (arrested twice, wife provides alibi). Multiple people publicly accused/exposed before true perpetrator identified. Episode explores themes of closeted homosexuality, workplace discrimination, and marital deception in 1990s legal world."},{"custom_id":"lo_s06_e18","season":"6","episode_number":"18","episode_title":"Atonement","air_date":"","source_notes":"Transcript appears complete through trial testimony but cuts off mid-sentence at the end during discussion of Frederick Scannell.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Model Sharon Lasko is murdered. Multiple men are investigated: photographer Rick Kasteler (who had sex with her but didn't kill her), basketball player Ken Soames (argued with her but alibi holds), drug dealer Frederick Scannell (questioned but unclear from truncated transcript), and limo driver Johnny Stivers (ultimately arrested and tried). Kasteler is publicly accused and his marriage/career are threatened before being cleared. The transcript cuts off before revealing final verdict or whether Scannell was further pursued."},{"custom_id":"lo_s06_e19","season":"6","episode_number":"19","episode_title":"Slave","air_date":"","source_notes":"Transcript appears truncated mid-sentence at end.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Mr. Merrick is initially suspected of murdering his wife Carol in their bedroom while drunk. Police use coercive interrogation tactics implying he committed the crime during a blackout. Later evidence (ballistics showing the shot came from 50-100 yards away, not close range) proves the bullet came from outside, from a rooftop across the street. The actual shooter was 13-year-old Lonnie Rickman, who was aiming at Clayton Doyle (a failed hit ordered by drug dealer Ross Morales) but accidentally killed Carol Merrick. Mr. Merrick was publicly accused, interrogated under coercion, and subjected to powder residue testing before being cleared. Transcript ends abruptly during investigation of Morales."},{"custom_id":"lo_s06_e20","season":"6","episode_number":"20","episode_title":"Girlfriends","air_date":"","source_notes":"Transcript appears complete through mid-trial testimony where Shelly Taggert is about to accuse her father of the murder.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"College senior Bridget Kaylin is found murdered in a university library. Initially suspected to be the work of a campus rapist, investigation reveals she was involved in prostitution, along with friends including Shelly Taggert who organized the operation (partly involving her father's shoe business clients). Multiple innocent people are investigated and publicly exposed during the prostitution/murder investigation. Shelly Taggert is eventually charged with murder, flees to Europe, returns, and at trial attempts to blame her father Barry Taggert."},{"custom_id":"lo_s06_e21","season":"6","episode_number":"21","episode_title":"Pro Se","air_date":"","source_notes":"Transcript appears complete through testimony but cuts off mid-sentence during Patricia Smith's testimony about Jimmy's apartment in Hoboken.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A schizophrenic man (James Smith) murders four people at a vintage clothing store. Early in the investigation, two black teenagers (Jerome and Liana) are accused based on a confrontation at the store shortly before the murders. Jerome was threatened with criminal charges and both were subjected to interrogation before being cleared when the real perpetrator (Smith) was identified. The episode focuses primarily on Smith's trial and his prior stalking case plea-bargained by ADA Kincaid."},{"custom_id":"lo_s06_e22","season":"6","episode_number":"22","episode_title":"Homesick","air_date":"","source_notes":"Transcript appears truncated at end during final scene with Claire and Jack.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"A five-month-old baby, Evan Karmel, dies from nicotine poisoning found in baby food. The au pair, Lila Crenshaw, is arrested after pesticide is found in her room and her diary reveals she hated caring for the baby. After a mistrial (7-5 against conviction), the prosecution changes theory to depraved indifference based on her failure to respond to the baby's distress. The transcript ends mid-conversation suggesting Ben Karmel may have lied about timeline, but is incomplete."},{"custom_id":"lo_s06_e23","season":"6","episode_number":"23","episode_title":"Aftershock","air_date":"","source_notes":"This episode focuses on the emotional aftermath of an execution (Mickey Scott) and does not contain a traditional investigation with false accusations. The episode is character-driven, exploring how the execution affects various members of the criminal justice system.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"This episode departs from the typical Law & Order format. It centers on the execution of Mickey Scott, who raped and murdered Adele Saunders. The episode follows various characters (Briscoe, Curtis, McCoy, Claire Kincaid, Van Buren) through their day off as they process the execution's emotional impact. There are no criminal investigations, no false accusations, and no innocent people harmed by the justice system. The episode is a character study examining moral ambiguity, burnout, and the personal toll of working in criminal justice."},{"custom_id":"lo_s07_e01","season":"7","episode_number":"1","episode_title":"Causa Mortis","air_date":"","source_notes":"Transcript appears complete through courtroom proceedings; ends mid-sentence during discussion of Mercer/Wrightman relationship.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Fernando Salva carjacks and murders Maureen Rankin, a teacher and mother of four. Despite strong evidence including an audio recording of the crime and the murder weapon, both are suppressed due to legal technicalities. Salva's fiancée Anna Galvez initially appears complicit (helped select paint color for stolen car, knew about gun's location) but is ultimately cleared when it becomes apparent she was manipulated by defense attorneys Mercer and Wrightman who represented both defendants to create privilege issues. The episode focuses on prosecutorial frustration with evidence suppression rather than wrongful accusations of innocent people."},{"custom_id":"lo_s07_e02","season":"7","episode_number":"2","episode_title":"I.D.","air_date":"","source_notes":"Transcript appears complete through courtroom proceedings. Twin sister identity swap case.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A woman is found murdered in an elevator. Detectives trace her to a hotel where they find her 'sister' Lucy Sullivan. Later evidence reveals the victim was actually Lucy Sullivan, and the surviving sister is Joanne Sullivan Dunbar, who killed her twin to assume her identity and escape mob connections from her gambling scam activities with husband William Dunbar. The case involves identity fraud and double jeopardy issues when the prosecution discovers mid-trial they've been prosecuting the wrong sister's murder."},{"custom_id":"lo_s07_e03","season":"7","episode_number":"3","episode_title":"Good Girl","air_date":"","source_notes":"Transcript appears truncated at end (mid-sentence during jury discussion).","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Charley Monroe, a black college freshman, is murdered in his apartment. Danielle Mason, an 18-year-old white woman, is arrested after her fingerprints are found at the scene. She claims Monroe drugged and raped her with Rohypnol, then she killed him in self-defense when he attempted to assault her again. Police investigation reveals she knew Monroe (calls to his pager, he worked on her street as magazine salesman) and lied about being at the library. Monroe had a sealed juvenile record for sexual assault at age 12. The case becomes racially charged; Monroe's family accuses the DA of refusing to prosecute because victim is black and defendant is white. A judge orders McCoy to seek indictment. At trial, defense attacks Lt. Van Buren for withholding Monroe's juvenile record and claims prosecution is driven by 'black community' pressure. Transcript ends mid-trial during jury tampering controversy."},{"custom_id":"lo_s07_e04","season":"7","episode_number":"4","episode_title":"Survivor","air_date":"","source_notes":"Transcript appears complete through resolution of Petersen's charges being dropped and focus shifting to Judith Sandler.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Stephen Campbell, a coin dealer, is murdered at his gallery. Richard Petersen (wealthy businessman whose rare coins Campbell held) becomes primary suspect after investigators find stolen coins in his apartment and his prints on the safe. Evidence later points to Judith Sandler, daughter of Holocaust survivors, who believed the Petersen coins were stolen from her family by Nazis. Petersen is arrested and held on $2M bail before charges are eventually dropped. Search evidence against Sandler is suppressed due to coercion related to her Holocaust-related trauma."},{"custom_id":"lo_s07_e05","season":"7","episode_number":"5","episode_title":"Corruption","air_date":"","source_notes":"Transcript appears truncated mid-sentence during Officer Abrams testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Detective John Flynn kills drug dealer Ruben Morales in what he claims is self-defense. Investigation reveals Flynn was paid by drug lord Hector Garcia to eliminate Morales, who was cooperating with the DA. Flynn is arrested for murder but makes a deal with the Hellman Commission investigating police corruption. As part of his testimony, Flynn falsely accuses his former colleague Detective Lennie Briscoe of stealing evidence five years earlier. The actual thief was Officer Dave Spence (now deceased). Briscoe faces public accusations before the commission until Officer Betty Abrams provides alibi testimony. Transcript cuts off during her cross-examination."},{"custom_id":"lo_s07_e06","season":"7","episode_number":"6","episode_title":"Double Blind","air_date":"","source_notes":"Transcript appears complete through courtroom argument.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"A janitor, Greg Franklin, is murdered with explosive-tipped bullets by Alan Sawyer, a schizophrenic college student participating in a drug study. Franklin was earlier falsely accused of stealing tranquilizers from Hudson University, causing him to quit, but this accusation does not meet the threshold for inclusion (no documented public exposure or material consequences beyond job change). The actual perpetrator, Alan Sawyer, is mentally ill and confesses. Dr. Christian Varick, the psychiatrist conducting the drug study, is later charged with manslaughter for recklessly ignoring Alan's relapse and threats. No qualifying false suspects with public exposure and material harm."},{"custom_id":"lo_s07_e07","season":"7","episode_number":"7","episode_title":"Deadbeat","air_date":"","source_notes":"Transcript appears complete through interrogation of Kirby but cuts off mid-sentence at end.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Michael Webber (alias Michael Malone) is murdered in a hotel. Detectives initially suspect James and Peter Pogosian, two car brokers who came to meet him. They are arrested with a gun but released when ballistics don't match. Victoria Lewis, Webber's fiancée, is briefly misled about his identity. Eventually Max Schaeffer, Webber's former father-in-law, confesses to the killing after being confronted with evidence. The Pogosians suffered public arrest and detention despite being innocent of the murder."},{"custom_id":"lo_s07_e08","season":"7","episode_number":"8","episode_title":"Family Business","air_date":"","source_notes":"Transcript appears truncated mid-sentence during Greer's testimony about suborning perjury allegations.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Richard Spiegel, CFO of Bergreen's department store, is murdered. Investigation reveals he was having an affair with designer Paul Medici while Spiegel's wife Kate was also involved with Medici. Spiegel planned to expose co-president Laura Bergreen's embezzlement of employee 401k funds. Both sisters become suspects. Kate receives immunity to testify against Laura, claiming Laura threatened Spiegel. However, father Seymour Bergreen testifies Kate confessed to the murder, creating reasonable doubt. Paul Medici is initially suspected due to affair and business dispute but is cleared. Transcript ends mid-trial with perjury allegations."},{"custom_id":"lo_s07_e09","season":"7","episode_number":"9","episode_title":"Entrapment","air_date":"","source_notes":"Transcript appears complete through courtroom dismissal scene. Episode involves Roland Books shooting, Huey Tate accused, entrapment hearing results in dismissal.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Roland Books and his bodyguard Otis Cooke are shot outside a restaurant. Huey Tate (son of Books' predecessor Marcus Tate) is accused based on a recorded conversation with Angela Roney where he discusses killing Books. At an Isaacson entrapment hearing, it's revealed Roney was a former FBI informant. The judge dismisses charges, finding Roney acted as a government agent who manufactured the crime. Evidence suggests Roney may have actually committed the shooting herself using Tate's car without his knowledge."},{"custom_id":"lo_s07_e10","season":"7","episode_number":"10","episode_title":"Legacy","air_date":"","source_notes":"Transcript appears complete through trial testimony","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Jim Shepard is shot in the head but survives. Investigation reveals a professional hit man (Howard Philips/Dr. Paul Sackett) hired by Estelle Muller, who believes Shepard murdered her son Rick Muller five years earlier. The detectives investigate Rick's death (initially ruled accidental fall while rock climbing). Exhumation reveals two skull fractures—one from the fall, one from a blunt instrument. Shepard is arrested for Rick Muller's murder. Estelle Muller hired the hit man and is willing to plead guilty to attempted murder if the prosecution goes after Shepard. The prosecution builds a case that Shepard and Robin (Rick's wife, now Shepard's wife) were having an affair and killed Rick, though evidence is circumstantial. No person in this episode qualifies as falsely accused then proven/strongly implied innocent with public exposure and consequent harm."},{"custom_id":"lo_s07_e11","season":"7","episode_number":"11","episode_title":"Menace","air_date":"","source_notes":"Transcript appears truncated mid-sentence at end.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"Karen Whatney jumps from Brooklyn Bridge after traffic altercation with Mike McDugan. Investigation reveals arson conspiracy: Harold Dorning hired arsonist Dave Randall to burn factory, Karen knew about it and attempted extortion. Dorning paid McDugan to silence her. McDugan chased/terrorized Karen on bridge; she jumped to escape. No innocent persons publicly accused - investigation correctly identified guilty parties (Dorning, McDugan, Randall). Transcript ends abruptly during arrest scene."},{"custom_id":"lo_s07_e12","season":"7","episode_number":"12","episode_title":"Barter","air_date":"","source_notes":"Transcript appears truncated mid-sentence at end","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Shelly Ganz is murdered in her building's parking garage. Initial investigation focuses on her ex-boyfriend Peter Messina and business/co-op conflicts. Enrique Flores is arrested based on witness IDs and boot prints. Later, Susan Tashjian is murdered, revealing the actual target. Investigation shifts to loan shark Bunny Russo who allegedly hired hitmen to kill defaulting borrowers and collect insurance. Flores confesses to two murders but won't testify against Russo. The episode explores a scheme where borrowers work off debts by killing other borrowers for insurance money. Transcript ends abruptly during case preparation."},{"custom_id":"lo_s07_e13","season":"7","episode_number":"13","episode_title":"Matrimony","air_date":"","source_notes":"Transcript appears complete through trial and post-trial discussion but cuts off mid-sentence at the very end.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Peter Triandos, 74-year-old wealthy philanthropist, is strangled with Christmas lights. Police initially suspect Luis Polanco (father of scholarship student) after argument at party, then focus on young wife Kim Triandos (22, former stripper). Kim and her lawyer Oliver Shain conspired to marry Triandos for money. Robert Mallors (personal assistant/executor) also becomes suspect. Kim acquitted at trial despite strong circumstantial case. Post-trial, evidence emerges that Shain was embezzling from scholarship fund and may have conspired with Kim's mother."},{"custom_id":"lo_s07_e14","season":"7","episode_number":"14","episode_title":"Working Mom","air_date":"","source_notes":"Transcript appears truncated mid-sentence during final summation","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Gilbert Keene, retired cop and security chief, is murdered in his car. Initial investigation focuses on prostitutes. Jane Tennick is accused of involvement due to blackmail relationship with Keene. Hillary Colson and Sondra Benton are revealed as suburban call girls running Topaz Enterprises. Hillary is arrested and tried for Keene's murder, claiming self-defense during rape. Louis Colson (husband) provides alibi then recants under pressure. Transcript cuts off during closing arguments."},{"custom_id":"lo_s07_e15","season":"7","episode_number":"15","episode_title":"D-Girl","air_date":"","source_notes":"Transcript appears complete through arrest of Evan Grant","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Body of film executive Heidi Ellison found dismembered in river. Initially suspect Carl Thurston cleared by alibi (in prison when murder occurred). Investigation focuses on Heidi's personal trainer Evan Grant, who had sexual relationship with victim and whose acting contract she put on hold before her death. Grant arrested after blood evidence links him to crime scene. No innocent persons publicly accused or materially harmed by false accusations in this episode."},{"custom_id":"lo_s07_e16","season":"7","episode_number":"16","episode_title":"Turnaround","air_date":"","source_notes":"Transcript appears truncated mid-sentence at end.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Heidi Ellison, a movie executive, is murdered and dismembered. Initially, her boyfriend Evan Grant is accused and arrested. Later, evidence points to her ex-husband Eddie Newman. Detective Miller is implicated in potentially planting evidence (silk fibers) in Newman's car, creating doubt about the integrity of the investigation. Grant is ultimately portrayed as innocent, having been publicly accused, arrested, and subjected to legal proceedings before the focus shifts to Newman."},{"custom_id":"lo_s07_e17","season":"7","episode_number":"17","episode_title":"Showtime","air_date":"","source_notes":"Transcript appears truncated mid-sentence during cross-examination.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Heidi Ellison is murdered and her ex-husband Eddie Newman is charged. During the sexual harassment lawsuit discovery, executives at Mattawin Studios are recorded threatening to kill Heidi. Detective Curtis has an affair with Lisa Lundquist, a studio exec who dislikes Newman, leading to accusations of bias. Defense argues Dr. Dan Duval (Heidi's therapist who betrayed confidences to studio execs) killed her when she discovered his misconduct. Ben Hollings, Heidi's boss facing harassment suit, also had motive but was alibi'd in London. The defense theory centers on Duval as alternate perpetrator, though Newman is strongly implied guilty throughout. Transcript ends mid-cross-examination."},{"custom_id":"lo_s07_e18","season":"7","episode_number":"18","episode_title":"Mad Dog","air_date":"","source_notes":"Transcript appears truncated at end during final confrontation scene","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Lewis Darnell, a convicted serial rapist released on parole after 18 years, becomes the primary suspect in the rape-murder of teenager Teresa Perez. Despite investigation, police find no physical evidence linking him to the crime. McCoy attempts to keep Darnell incarcerated using civil commitment statutes for dangerous sexual predators, but courts deny the application. No innocent person is publicly accused or harmed by false accusation in this episode - Darnell remains the sole suspect throughout, and the case against Teresa Perez's actual killer is never resolved. The episode focuses on the legal battle over Darnell's civil commitment rather than wrongful accusation."},{"custom_id":"lo_s07_e19","season":"7","episode_number":"19","episode_title":"Double Down","air_date":"","source_notes":"Transcript appears complete through courtroom cross-examination scene","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A liquor store robbery leads to the death of off-duty Officer Russell Schaeffer. Detectives initially suspect Rodolfo Rodriguez when his stolen car is found at the scene. Rodriguez and his girlfriend Sylvia are arrested and publicly questioned, but are quickly cleared when car service records show the actual perpetrator Henry Harp carjacked driver Mitchell Titus. Rodolfo and Sylvia suffer public exposure and police confrontation in their home despite being innocent victims of car theft."},{"custom_id":"lo_s07_e20","season":"7","episode_number":"20","episode_title":"We Like Mike","air_date":"","source_notes":"Transcript appears truncated mid-sentence at end","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Matthew Sherman is murdered during an apparent robbery. Mike Bodak, who helped Sherman change a tire shortly before the murder, becomes the primary suspect. He is arrested at his wedding rehearsal dinner in front of family and guests. Evidence includes Sherman's blood on Bodak's jacket. Days later, Ricardo Garcia confesses to the murder and Bodak is released. However, due to procedural errors, Garcia's confession and physical evidence are suppressed. Bodak becomes crucial as the only witness who can identify Garcia, but receives threatening calls attempting to intimidate him from testifying."},{"custom_id":"lo_s07_e21","season":"7","episode_number":"21","episode_title":"Passion","air_date":"","source_notes":"Transcript appears complete through arrest of Charles Evans","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Joni Timberman, a book editor, is murdered in her lover Charles Evans' apartment. Police initially suspect Evans, then arrest his girlfriend Diane Posner based on E-ZPass records and victim's hair in her car. Posner attempts suicide in jail to protect Evans. Investigation reveals Evans was actually the killer; Posner had been covering for him after he confessed to her and she saw blood on his shirt. Posner was wrongfully arrested, publicly exposed through media/trial prep, attempted suicide, and suffered severe legal/reputational harm before Evans was identified as the true perpetrator."},{"custom_id":"lo_s07_e22","season":"7","episode_number":"22","episode_title":"Past Imperfect","air_date":"","source_notes":"Transcript appears truncated mid-trial testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Former model Christine Sandler is murdered. Investigation initially focuses on her ex-husband Jimmy Burke and son Douglas Burke before discovering her biological daughter Sonja Harland killed her. Multiple people publicly accused and cleared, including Burke (questioned at recording studio, alibi confirmed via blood test) and Douglas (accused in interrogation, blood evidence ruled him out). Grant Silverman also implicated as accomplice but excluded from person_rows as his involvement was post-crime assistance only."},{"custom_id":"lo_s07_e23","season":"7","episode_number":"23","episode_title":"Terminal","air_date":"","source_notes":"Transcript appears truncated during Coburn's testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"A shooting at a pier following a Jewish charity singles cruise kills two people. Initially suspected as anti-Jewish terrorism, the investigation reveals the shooter was Hank Coburn, a travel agent in financial trouble who killed to prevent a check from bouncing. Todd Wexman/Larry Rice was an innocent bystander using a pseudonym to attend singles events while married. The episode features a political subplot where the governor removes DA Schiff for refusing to seek the death penalty."},{"custom_id":"lo_s08_e01","season":"8","episode_number":"1","episode_title":"Thrill","air_date":"","source_notes":"Transcript appears complete through courtroom proceedings on severance motion. Episode involves thrill killing of delivery driver Matthew Wheeler by two young men, Joey Timon and Dale Kershaw (Tagger).","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Matthew Wheeler, a 20-year-old delivery driver, is murdered in a thrill killing by Joey Timon and Dale Kershaw. The investigation leads to both perpetrators who are actually guilty. No innocent persons are falsely accused with public exposure or material harm. The case involves a recorded confession to a priest that creates legal complications, but no false suspects meet the criteria for inclusion."},{"custom_id":"lo_s08_e02","season":"8","episode_number":"2","episode_title":"Denial","air_date":"","source_notes":"Transcript appears complete through trial but cuts off during closing arguments.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A newborn baby is found dead and buried at a construction site. Christina Talbert (17, college student) and her boyfriend Tommy Horton are arrested for murder after detectives determine Christina gave birth at a hotel and the baby was strangled. Christina's father Warren Talbert later admits to finding and burying the baby, claiming it died of natural causes, but the M.E. confirms strangulation. Both students maintain the baby was alive when they left it in the hotel room. Warren Talbert refuses to testify and is jailed for contempt, while his wife testifies that he confessed to finding the baby alive. The defense argues Warren Talbert may have killed the baby himself, creating reasonable doubt about the students' guilt."},{"custom_id":"lo_s08_e03","season":"8","episode_number":"3","episode_title":"Navy Blues","air_date":"","source_notes":"Transcript appears truncated mid-testimony during Blair's direct examination","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"Navy Chief Robert Stroud is found murdered. His pilot, Lt. Kirstin Blair, eventually admits to shooting him, claiming self-defense during a struggle after he pulled a gun when she tried to end their affair. The episode focuses on the legal battle over whether her shooting was murder or justified/accidental self-defense. No false suspects are identified or publicly accused; the investigation moves from a serial mugger theory to focusing on Blair, who ultimately admits to the shooting but claims it was accidental/self-defense. The transcript is incomplete, ending mid-trial."},{"custom_id":"lo_s08_e04","season":"8","episode_number":"4","episode_title":"Harvest","air_date":"","source_notes":"Transcript appears complete through courtroom testimony","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Nancy O'Neal is shot by Elias Camacho in a random street shooting. She is declared brain dead and her organs are harvested by Dr. Cosgrove. The case focuses on whether Camacho's gunshot or Cosgrove's premature organ harvesting caused her death. While there are investigative pivots (initial focus on husband Marty O'Neal, later identifying Camacho, then charging Dr. Cosgrove), no one is proven innocent of a false accusation with public exposure and consequent harm. Marty O'Neal is briefly suspected but never publicly accused or charged. The Ramos brothers are charged with facilitation but receive dismissals in exchange for testimony - they were partially involved as witnesses who fled but did not themselves commit the shooting."},{"custom_id":"lo_s08_e05","season":"8","episode_number":"5","episode_title":"Nullification","air_date":"","source_notes":"Militia group (New Sons of Liberty) robs armored car; member Phil Christie acts as own counsel, attempts jury nullification strategy","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Three militia members rob an armored car killing a guard. Two robbers (Matthew Brant and Greg Kubie) are identified at scene; Brant is killed, Kubie hospitalized. Investigation reveals they belong to militia group 'New Sons of Liberty' led by Phil Christie. All 20 members charged with conspiracy. Christie represents himself, employs jury nullification strategy claiming they're at war with US government. Trial ends in hung jury/mistrial. No falsely accused persons identified—all defendants were actual participants or co-conspirators."},{"custom_id":"lo_s08_e06","season":"8","episode_number":"6","episode_title":"Baby, It's You","air_date":"","source_notes":"Transcript appears complete through detective banter at end, includes full investigation arc.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"14-year-old model Brittany Janaway dies from toxic shock syndrome caused by rape. Police initially investigate fashion designer Paul Delacourte, then focus on Johnny Ramirez, former babysitter's son. The Janaways' lawyer conducts parallel investigation with profiler, posts $250,000 reward, and leaks information to media, creating massive public exposure for Ramirez before he's located or interviewed. Transcript ends before resolution, but Ramirez is clearly publicly identified as suspect via media campaign and reward posting."},{"custom_id":"lo_s08_e07","season":"8","episode_number":"7","episode_title":"Blood","air_date":"","source_notes":"Transcript appears truncated mid-sentence during Frances Houston's testimony.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Karin Burdett is found dead after falling from her balcony. Her husband Josh Burdett, a pharmaceutical executive who has been passing as white despite being African American, is initially suspected after forensics suggests she was pushed. The case revolves around their biracial baby given up for adoption, which Karin wanted back. Detectives also investigate Morris Keach as a potential biological father. Eventually, Josh's ex-wife Frances Houston is revealed as the killer, motivated by not wanting her son's racial identity exposed. Multiple suspects are publicly accused before the true perpetrator is identified."},{"custom_id":"lo_s08_e08","season":"8","episode_number":"8","episode_title":"Shadow","air_date":"","source_notes":"Transcript appears complete through conclusion of case.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Bail bondsman Manny Ehrlich is murdered. Oscar Liriano, who jumped bail, becomes the prime suspect. However, the investigation reveals Ehrlich was killed by ADA Charlie Harmon, who was fixing cases with defense attorney Arvin Baker. The DA's office conducts a 'shadow prosecution' - a phony murder case against Liriano (with his consent) to expose the corruption. Liriano is publicly arrested and prosecuted for murder despite being innocent, solely to investigate Harmon and Baker's corruption scheme."},{"custom_id":"lo_s08_e09","season":"8","episode_number":"9","episode_title":"Burned","air_date":"","source_notes":"Transcript appears complete through courtroom proceedings and final confrontation with Carl Anderton.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A woman hears a murder confession on an answering machine at a man's apartment. Investigation reveals the call was meant for a previous tenant, Roy Lawlor, whose 5-year-old daughter Dee-Dee died in a fire two years earlier. Lawlor was originally blamed for the fire (drunk, passed out with cigarette). Evidence eventually points to Lawlor's teenage son Terry (from first marriage) who set the fire. Roy Lawlor was publicly accused and investigated for his daughter's death before being cleared when Terry became the suspect."},{"custom_id":"lo_s08_e10","season":"8","episode_number":"10","episode_title":"Ritual","air_date":"","source_notes":"Murder case involving cultural practice of female genital mutilation","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Josef Moussad is murdered after planning to have his niece undergo female genital mutilation. Multiple suspects are investigated before Eric Martin, the girl's father, confesses to killing Moussad to protect his daughter. Dr. Nasser is detained as a suspected terrorist before his true role as the surgeon is revealed. Farrah Patel, Moussad's girlfriend, is suspected by witnesses. The case concludes with Martin accepting a manslaughter plea."},{"custom_id":"lo_s08_e11","season":"8","episode_number":"11","episode_title":"Under the Influence","air_date":"","source_notes":"Transcript appears complete through courtroom scenes and plea deal.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Bernard Dressier kills three people in a drunk driving hit-and-run. His girlfriend Susan Young was a passenger. Dressier is charged with first-degree murder based on intent, but his extreme intoxication (15 drinks on the flight) undermines intent. McCoy initially withholds exculpatory evidence (flight attendant statement) but later introduces it in court, leading to a plea deal for vehicular manslaughter. No innocent people are falsely accused or publicly exposed in this episode - the investigation correctly identifies Dressier as the perpetrator from the start."},{"custom_id":"lo_s08_e12","season":"8","episode_number":"12","episode_title":"Expert","air_date":"","source_notes":"Transcript appears complete through trial testimony but cuts off mid-sentence during final courtroom scene.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A shooting in a restaurant bathroom targets Dr. Leon Mayer, an expert witness. Initially suspected are Michael Thompson (thought to be target of hit by Willie Felker) and victim's family members from prior cases. Milton Garner killed as bystander. Lindsay Carson, daughter of Arthur Rigg (convicted despite Mayer's testimony), is ultimately charged. Thompson publicly accused based on detective theory; Larry (victim's brother from prior case) also publicly questioned. Both later cleared when Carson identified as shooter."},{"custom_id":"lo_s08_e13","season":"8","episode_number":"13","episode_title":"Castoff","air_date":"","source_notes":"Transcript appears truncated at defense closing argument","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Social worker Jennifer Gaylin is murdered. Randy Johnson, a young man she helped, becomes an early suspect after witnesses report he had been trying to contact her and she was avoiding him. He is publicly questioned but cleared when evidence points to serial killer Eddie Chandler, who targeted people involved in alternative lifestyles. Randy suffered public accusation despite being innocent."},{"custom_id":"lo_s08_e14","season":"8","episode_number":"14","episode_title":"Grief","air_date":"","source_notes":"Transcript appears complete through Mrs. Singer's breakdown at end","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"George Harding is initially accused of raping Leslie Russo (psychiatric patient), but investigation reveals Roger (another patient) was actually her partner. The Russo brothers beat Harding based on false accusation. Harding is then correctly identified as having raped Wendy Singer (coma patient) - but was paid by her mother to do so. Jimmy Baxter was also falsely implicated early on."},{"custom_id":"lo_s08_e15","season":"8","episode_number":"15","episode_title":"Faccia a Faccia","air_date":"","source_notes":"Transcript appears complete through trial prep; final scenes may be cut off mid-sentence.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A murdered witness protection informant (Nick Lagrassa/Nicky Shakes) is found in Central Park. Johnny DeMayo is initially presented as the hitman who killed Lagrassa on orders from mob boss Alberto Napoli. DeMayo falsely confesses to the murder to gain witness protection and credibility with Napoli. The actual shooter was Vicky Grant, whose father was one of Lagrassa's 23 victims. She killed Lagrassa independently to stop him from profiting from a book deal. DeMayo is publicly exposed as a cooperating witness and perjurer; his girlfriend Vicky Grant is accused then revealed as the actual killer."},{"custom_id":"lo_s08_e16","season":"8","episode_number":"16","episode_title":"Divorce","air_date":"","source_notes":"Transcript appears to be cut off mid-sentence during final courtroom scene. Molly Kilpatrick denies making threatening statement to her lawyer Sheila Atkins.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Dr. Linda Burk, a therapist conducting marriage counseling and Catholic annulment evaluations, is murdered in her hospital office. Police initially suspect Leonard Gardner, a mentally ill homeless man who claimed to be Pope Adrian VI and wore the victim's hat. He is cleared by alibi (in custody at time of murder). Investigation then focuses on Molly Kilpatrick, a divorcing mother contesting her ex-husband's annulment petition. Molly is arrested despite weak physical evidence. The transcript ends abruptly during a courtroom hearing where her own divorce lawyer, Sheila Atkins, is compelled to reveal Molly's alleged threat against Dr. Burk, which Molly denies making."},{"custom_id":"lo_s08_e17","season":"8","episode_number":"17","episode_title":"Carrier","air_date":"","source_notes":"Transcript appears complete through Kenny Stark's girlfriend Leslie's testimony about him disclosing illness.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"May Kiley dies at a party from a gunshot. Billy Fields is initially accused of murder but his story that the gun accidentally went off during May's distress about having AIDS is corroborated. The case pivots to Kenny Stark ('Twist'), who deliberately infected multiple young women with HIV including May. Billy is cleared; Stark becomes the actual criminal target for intentional HIV transmission resulting in death."},{"custom_id":"lo_s08_e18","season":"8","episode_number":"18","episode_title":"Stalker","air_date":"","source_notes":"Transcript appears truncated mid-cross-examination","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Andrea Blake is stalked via e-mail by 'Giovanni' and eventually murdered. Police initially suspect Louis Dutton (voyeur photographer) and Russell Lowery (convicted hacker). Blake fabricated first attack (threw herself down stairs) after police wouldn't help, creating credibility issues. Lowery ultimately charged with murder and attempted murder. Transcript ends mid-trial, unclear if conviction obtained. Key issue: 911 tape excluded because Blake lied about first attack, undermining her credibility when she identified killer as 'Giovanni.'"},{"custom_id":"lo_s08_e19","season":"8","episode_number":"19","episode_title":"Disappeared","air_date":"","source_notes":"Transcript appears truncated at end during Ben Odell's statement","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Paul and Donna Ericson and developer Faber are kidnapped and later found murdered. Building manager Faber is initially the prime suspect due to legal disputes with the Ericsons over his coffee bar, but he himself is kidnapped and killed. The actual killer is Matthew Odell, a mentally ill political extremist who targeted gentrifiers. Faber was wrongly suspected and then became a victim."},{"custom_id":"lo_s08_e20","season":"8","episode_number":"20","episode_title":"Burden","air_date":"","source_notes":"Transcript appears complete through trial testimony but cuts off mid-sentence during Dr. Semenko's testimony.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"12-year-old quadriplegic Michael Sutter dies from poison hemlock. Initially his mother Lois is suspected (she had an alibi with a lover), then his father Joe Sutter is arrested and charged. Eventually Dr. Lyle Semenko, the boy's physician, is revealed as the actual killer—a serial mercy killer with 17+ deaths across multiple hospitals. Both parents endured public accusation, arrest (father), and trial testimony despite being innocent."},{"custom_id":"lo_s08_e21","season":"8","episode_number":"21","episode_title":"Bad Girl","air_date":"","source_notes":"Transcript appears complete through courtroom finale and interview scene.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Officer Dana Flynn is murdered in Riverside Park. Jesse Rosado is found shot at the scene, initially suspected of the murder. Detectives discover Monica Johnson (using alias Monica Summers) was on the same bus and followed Flynn into the park. Investigation reveals Rosado was an innocent bystander who tried to stop the attack and was shot by Flynn in her final moments. Monica is convicted of first-degree murder and sentenced to death. She later claims religious conversion and waives appeals, creating legal and moral controversy."},{"custom_id":"lo_s08_e22","season":"8","episode_number":"22","episode_title":"Damaged","air_date":"","source_notes":"Transcript appears truncated at end during Valerie's testimony.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"A school shooting involves Sally Maxwell (14) shooting at three boys who raped her mentally disabled sister Valerie. Sally is accused of attempted murder of teacher Amanda Novak (innocent bystander hit by stray bullet). The three boys (Hayden, Randy, Roscoe) are initially accused/convicted of rape but Judge Wright sets aside the jury verdict, declaring them innocent despite evidence they knew Valerie was mentally disabled. The episode explores false accusations in multiple directions: Sally accused of intentionally shooting the teacher (she was shooting at the boys who shot first), and the rape case where the judge controversially rules the sex was consensual despite Valerie's mental disability."},{"custom_id":"lo_s08_e23","season":"8","episode_number":"23","episode_title":"Tabloid","air_date":"","source_notes":"Transcript appears complete through trial testimony but cuts off mid-cross-examination","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Maggie Abbott, appellate court nominee, dies after running into traffic while being pursued by tabloid columnist Phil Marco. Marco is initially suspected of causing her death through harassment. He pleads guilty to minor charges but is later murdered. Warren Abbott confesses to killing Marco to protect his daughter Laura from a story about her birth origins, but prosecutor suggests Warren manipulated media for business purposes."},{"custom_id":"lo_s08_e24","season":"8","episode_number":"24","episode_title":"Monster","air_date":"","source_notes":"Transcript appears complete through plea agreement scene","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"10-year-old Malika Richardson is brutally raped and left in a coma. Police initially arrest Owen Stokes based on witness IDs and his confession (obtained through coercive interrogation). Later evidence reveals the actual perpetrator was Jesse Castillo, a security guard with access to the crime scene. Stokes was publicly accused, arrested, indicted, and faced mob violence before being exonerated."},{"custom_id":"lo_s09_e01","season":"9","episode_number":"1","episode_title":"Cherished","air_date":"","source_notes":"Transcript appears complete through trial testimony but cuts off mid-sentence during Megan Connery's testimony.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"A baby dies from medical neglect. Initially, 7-year-old Nicholas Waring is suspected and arrested for murder after confessing to attacking the baby. The M.E. later determines the baby died of heart failure before Nicholas touched her, exonerating him. The real culprits are the adoptive parents (the Connerys) who abandoned a sick baby they got from Russia, and Dr. Kostov who facilitated adoption fraud. Nicholas suffered public arrest, removal from home, and psychiatric lockup based on false murder accusation."},{"custom_id":"lo_s09_e02","season":"9","episode_number":"2","episode_title":"DWB","air_date":"","source_notes":"Transcript appears truncated mid-testimony. Final outcome unclear.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"Floyd Michaels, a black auxiliary police officer, is profiled, beaten, and killed by NYPD officers Carlson, Fratelli, and Dietrich after a traffic stop. The episode focuses on prosecuting the officers, with witness cooperation issues and immunity debates. No innocent persons are falsely accused; the victim Michaels is proven innocent of any wrongdoing (suspected robbery surveillance target). Transcript ends mid-trial testimony from Fratelli, who pleaded guilty and is testifying against his co-defendants."},{"custom_id":"lo_s09_e03","season":"9","episode_number":"3","episode_title":"Bait","air_date":"","source_notes":"Transcript appears complete through arraignment/grand jury deliberations but cuts off mid-sentence at end.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Kevin Stanton (17) is shot and lies about a carjacking by 'two black guys.' Investigation reveals he was working as an underage informant for Detective Rivera. Drug dealers Mathis and Benvenidez are arrested for shooting Kevin and killing his girlfriend Sarah. Kevin's lies stem from Rivera threatening him to stay silent. Two other juveniles (Eddie and cousin Ricky) were arrested by Rivera in May; Eddie claims Rivera framed them for refusing to inform. The episode explores Rivera's obstruction and possible manslaughter charges for letting kids walk into danger."},{"custom_id":"lo_s09_e04","season":"9","episode_number":"4","episode_title":"Flight","air_date":"","source_notes":"Transcript appears complete through final scene discussing Allgen Corporation's sales practices.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A 5-year-old boy dies from V.R.S.A. bacterial infection. Investigation reveals he was deliberately injected. Theresa Copeland, the father's mistress, is initially suspected and publicly accused. She is later cleared when evidence shifts to Aaron Downing, the father, who embezzled money and planned to flee. Theresa faced workplace exposure, arrest threat, and interrogation based on her affair and proximity to the murder weapon, but was innocent of the murder."},{"custom_id":"lo_s09_e05","season":"9","episode_number":"5","episode_title":"Agony","air_date":"","source_notes":"Transcript appears complete through deliberation scene","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Matt Bergstrom is arrested and pleads guilty to torturing Katharine Lansing and killing a mailman. Later evidence reveals Michelle Ashford's brother committed the crimes at her instigation to eliminate romantic competition. Bergstrom (a serial killer) is proven innocent of these specific crimes but guilty of six other murders he led police to. Creates prosecutorial dilemma: can't let Bergstrom go free, can't convict wrong person."},{"custom_id":"lo_s09_e06","season":"9","episode_number":"6","episode_title":"Scrambled","air_date":"","source_notes":"Transcript appears complete through courtroom arguments; may be truncated at very end during judge's statement.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"An embryologist is murdered during a break-in at a fertility clinic. The perpetrator, Francis Curran (a former police detective working as a chauffeur), was hired by Arlene Galvin to destroy frozen embryos from her ex-husband's first marriage. Curran is arrested and confesses, implicating Arlene Galvin. No individuals are wrongfully accused then proven innocent. The legal conflict centers on whether embryos constitute property (affecting felony murder charges) and custody disputes between two ex-wives over frozen embryos."},{"custom_id":"lo_s11_e01","season":"11","episode_number":"1","episode_title":"Endurance","air_date":"","source_notes":"Transcript appears truncated mid-testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"A fire kills a severely disabled boy (Ian Parnell). Initially detectives suspect the store owner (Richie Zweck) for insurance fraud, then the ex-husband (Colin Parnell). Both are cleared. The mother, Megan Parnell, is ultimately charged with murder two for setting the fire. Transcript ends mid-trial during her testimony, so final verdict unknown. Two innocent people (Zweck and Colin) were publicly accused/investigated."},{"custom_id":"lo_s11_e02","season":"11","episode_number":"2","episode_title":"Turnstile Justice","air_date":"","source_notes":"Transcript appears truncated during closing arguments","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Stephanie Donnatelli is murdered on a subway platform by Brian Gallant, a mentally ill man released from Riker's without medication or evaluation. The episode focuses on prosecuting Phillip Andrews, CEO of SMJ Medical Services (the HMO managing Riker's medical care), for manslaughter. Dr. Sanders initially emerges as a suspect/responsible party but becomes a witness against Andrews after being threatened with charges. Raffi Lorraine, a homeless man, is initially suspected but proves to be a witness. The transcript cuts off during closing arguments."},{"custom_id":"lo_s11_e03","season":"11","episode_number":"3","episode_title":"Dissonance","air_date":"","source_notes":"Transcript appears truncated mid-sentence during final courtroom scene.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Natalie Dreisner, a 24-year-old violinist with the Manhattan Symphony Orchestra, is found murdered in her dressing room. Initially, detectives suspect stage hand Jay Brannigan, who stole her $1 million del Gesu violin. However, Brannigan has a solid alibi for the time of murder. The investigation then focuses on conductor Carl Reger, who was having an affair with Dreisner. Reger is arrested and tried for murder based on motive (Dreisner was leaving him professionally and personally), means (his wife's registered gun), and opportunity (alibi issues with E-Z Pass records). Jay Brannigan, though guilty of theft, is cleared of murder and suffered public exposure and arrest for a crime he did not commit."},{"custom_id":"lo_s11_e04","season":"11","episode_number":"4","episode_title":"Standoff","air_date":"","source_notes":"Transcript appears truncated mid-sentence during Bennett's testimony.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Rafael Alejo, a gang leader, is stabbed to death at Rikers. Detectives initially suspect Hector Diaz, who was also stabbed in the incident. However, Diaz is revealed to be an undercover officer. Investigation shifts to Judd Larson (a lifer who actually committed the murder) and Corrections Officer Peter Bennett, who allegedly arranged the killing to avenge his girlfriend Angela Donahue's rape by Alejo. Diaz was wrongly suspected and publicly questioned/accused before his undercover status was revealed. Transcript cuts off during Bennett's trial testimony."},{"custom_id":"lo_s11_e05","season":"11","episode_number":"5","episode_title":"Return","air_date":"","source_notes":"Transcript appears complete through trial testimony but cuts off mid-cross-examination of Eli Becker","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Murder-for-hire case where Saul Caplan is killed during a staged robbery. Multiple employees investigated before evidence points to Eli Becker, the victim's partner's son, who hired Sal Bonafiglio to arrange the murder. Early suspects include stockroom workers questioned about theft. Transcript ends mid-trial cross-examination."},{"custom_id":"lo_s11_e06","season":"11","episode_number":"6","episode_title":"Burn Baby Burn","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Detective Jake Kearsey is shot and killed outside an apartment at 35 St. Nicholas Avenue while attempting to locate a witness (Albert Rosa) for an unrelated robbery case. The shooter is Lateef Miller, a former Black Panther and current community activist, who was inside his girlfriend Selina Watts' apartment. Miller claims self-defense, stating Kearsey pointed a gun at him first after he opened the door. The episode explores police-community tensions and racial issues, with Miller's defense arguing Kearsey was a racist cop who acted aggressively. Miller is tried for Murder in the First Degree. No false suspects are identified - Miller is the only suspect throughout, and the case centers on whether his self-defense claim is valid. While there are discussions of police conduct and racial profiling, no innocent person is wrongly accused of the murder itself."},{"custom_id":"lo_s11_e07","season":"11","episode_number":"7","episode_title":"Amends","air_date":"","source_notes":"Transcript appears complete through final courtroom confession scene.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Detectives reopen a 1981 cold case murder of 16-year-old Marybeth Mosley. Initial suspect Fred Jenks (plumber) was cleared by alibi but remained under suspicion for years. Michael Sarno, wealthy ambassador's son with rape history, is eventually arrested. Detective Tommy Brannigan confesses in court that Inspector Holsick pressured him to abandon Sarno investigation in exchange for promotion to First Grade, and arranged for murder weapon to disappear from Property Room. Jenks suffered work/reputation harm from being primary suspect despite solid alibi."},{"custom_id":"lo_s11_e08","season":"11","episode_number":"8","episode_title":"Thin Ice","air_date":"","source_notes":"Transcript appears complete through courtroom testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Russell Crider, a youth hockey coach, is beaten to death in a parking garage. Initially, detectives focus on his teenage player Keith Taylor after finding Keith's hockey stick with the victim's blood. Keith is interrogated, his home searched, and he is ordered by a judge to provide voice samples for a 911 call match. Keith lies to protect his father Ray Taylor, who actually committed the murder in a rage after Keith was suspended from a game. Keith is publicly accused, arrested as an adult for murder, and forced to testify against his father only after a plea deal."},{"custom_id":"lo_s11_e09","season":"11","episode_number":"9","episode_title":"Hubris","air_date":"","source_notes":"Transcript appears complete through mistrial declaration and final scene.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Richard Morriston/Mark Landry murders four people including his girlfriend Gail Churchill after she discovers he's a con man who previously killed another girlfriend in Utah. No innocent persons are publicly accused or harmed by false accusations in this episode. The case focuses on prosecuting the actual perpetrator, who represents himself at trial and manipulates a juror, resulting in a mistrial."},{"custom_id":"lo_s11_e10","season":"11","episode_number":"10","episode_title":"Whose Monkey Is It Anyway?","air_date":"","source_notes":"Transcript appears truncated mid-sentence at end. Mrs. Peavey's conversation with prosecutors is incomplete.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"George Peavey, a security guard, breaks into a research lab to free monkeys infected with AIDS virus. One monkey escapes and bites researcher Ronald Lee, who dies from anaphylactic shock. Peavey confesses to the break-in and is charged with manslaughter. His defense argues justification based on animal welfare. His girlfriend Maxine Walden is questioned but Peavey explicitly states she was not involved. No one is falsely accused - Peavey is the actual perpetrator and confesses. The case focuses on whether his actions were justified, not on wrongful accusation."},{"custom_id":"lo_s11_e11","season":"11","episode_number":"11","episode_title":"Sunday in the Park with Jorge","air_date":"","source_notes":"Transcript appears truncated during defendant's testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Susan Capp is murdered in Central Park during Puerto Rican Day Parade chaos. Police initially pursue suspects from parade wilding incidents, then focus on Seth Teitel (victim's husband's business partner) who had financial motive. Seth is arrested and tried, but new witness testimony leads to charges against Nestor Salazar, who actually committed the murder. Seth is exonerated after public trial."},{"custom_id":"lo_s11_e12","season":"11","episode_number":"12","episode_title":"Teenage Wasteland","air_date":"","source_notes":"Transcript appears truncated mid-sentence during McCoy's closing argument","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Chinese restaurant owner Thomas Ngai is murdered during a food delivery to a vacant apartment. Homeless veteran Marvin Warner is initially suspected based on his blanket at the scene and history of confrontations at that location. Warner is cleared when he explains teenagers forced him out and took his blanket. Investigation reveals five teenagers (Mitch Regan, Peter Franco, Chris Donnels, Nick Simms, Heather Russo) lured Ngai to rob him of food, then murdered him when he saw their faces. Warner was publicly accused and arrested before being cleared."},{"custom_id":"lo_s11_e13","season":"11","episode_number":"13","episode_title":"Phobia","air_date":"","source_notes":"Transcript appears complete through courtroom testimony but may be truncated before final verdict","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"A gay man (Bradford Mandel) is beaten to death and his adopted son kidnapped by the biological father (Robert Kelley) and mother (Celia Goddard). The biological father is prosecuted for murder; the biological mother cooperates and testifies against him. No false suspects are identified or accused - police quickly identify the correct perpetrators through evidence at the scene and ransom call tracking. Gene Burdick opportunistically made a fake ransom call but was not wrongly accused of the murder/kidnapping itself - he admitted to the ransom scam. The case centers on the murder prosecution of the actual guilty party."},{"custom_id":"lo_s11_e14","season":"11","episode_number":"14","episode_title":"A Losing Season","air_date":"","source_notes":"Transcript appears complete through trial testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Dena Meredith, a pregnant bank loan officer, is found shot in the trunk of her stolen car. Two carjackers (Gabor Hartunian and Mark) are initially suspected but are later proven innocent—they stole the car after she was already shot and in the trunk. The real perpetrators are Marcus Cole (hired killer), Henry Williams (coordinator), and Chris Cody (NBA player who fathered Dena's baby and ordered the hit to avoid child support). The carjackers faced public accusation and arrest before being cleared."},{"custom_id":"lo_s11_e15","season":"11","episode_number":"15","episode_title":"Swept Away - A Very Special Episode","air_date":"","source_notes":"Transcript appears complete through courtroom testimony. Reality TV show 'Deal With It' cast member Wes Tatum dies after rooftop fight with Paul Wyler. Network VP Byron Stark charged with manslaughter for inciting the confrontation.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Wesley Tatum dies after being pushed off a roof during a fight with castmate Paul Wyler. Wyler is initially arrested for murder, but dying declaration reveals Wes was told to provoke the fight by network executive Byron Stark for ratings. Wyler becomes prosecution witness against Stark. The show's executive producers (Kaufmans) were also arrested but appear to have cooperated, implicating Stark as the one who orchestrated the confrontation."},{"custom_id":"lo_s11_e16","season":"11","episode_number":"16","episode_title":"Bronx Cheer","air_date":"","source_notes":"Transcript appears truncated mid-sentence at end","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Angela Jarrell is murdered; investigation leads to drug dealer Francis Partell (aka 'Taz'). Detectives discover Partell may have committed a 1998 Bronx murder for which Tony Shaeffer is serving 25-to-life. Three witnesses (Verona, Pistone, Quintana) now identify Partell as the real shooter. Shaeffer was convicted based on two eyewitnesses, his 'confession' to girlfriend Valerie Mankowitz (bragging to impress her), and his mother's alibi being dismissed. Manhattan DA prosecutes Partell for the Bronx murder using jurisdictional exception. Transcript ends mid-negotiation; Tony Shaeffer remains wrongfully imprisoned throughout visible transcript."},{"custom_id":"lo_s11_e17","season":"11","episode_number":"17","episode_title":"Ego","air_date":"","source_notes":"Transcript appears truncated mid-sentence during cross-examination of Alice Marner","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Karen Hall, an investigator for the NY Attorney General's office, is murdered. Initial investigation by state troopers focuses on abduction from Albany train station based on weak eyewitness. NYPD discovers she was having affair with her supervisor Alec Conroy. Multiple people publicly accused/investigated before Conroy arrested. Alice Marner (Conroy's other mistress) provides false alibi, later testifies against him. Defense attorney suggests Marner herself committed the murder. Transcript cuts off during trial."},{"custom_id":"lo_s11_e18","season":"11","episode_number":"18","episode_title":"White Lie","air_date":"","source_notes":"Transcript appears complete through courtroom testimony but may be cut off at the end during redirect examination.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Daniel and Rosa Alvarez are murdered during a cocaine deal. Investigation reveals Caryn Wyman, an Army major's wife, smuggled cocaine from Colombia using military flights. She testifies against Joe Pena, who threatened her and killed the Alvarezes. Two building witnesses (doorman Conners and resident Brady) initially identify Pena but recant at trial, likely due to intimidation. However, neither witness was falsely accused themselves—they were intimidated out of testifying truthfully. Caryn Wyman was prosecuted but received probation in exchange for testimony. No person in this episode qualifies as being falsely accused and then proven/strongly implied innocent with public exposure or material harm as a consequence of that accusation."},{"custom_id":"lo_s11_e19","season":"11","episode_number":"19","episode_title":"Whiplash","air_date":"","source_notes":"Transcript appears complete through trial testimony","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Episode centers on a staged car accident insurance fraud ring. Hector Santiago dies from injuries sustained in a staged accident orchestrated by attorneys Petrie and Sanders, chiropractor Dr. Raleigh, and moving company owner Bill Reed. The investigation reveals a conspiracy where illegal immigrants were recruited as crash victims to generate fraudulent insurance claims. All defendants are prosecuted; no one falsely accused is later cleared. Mrs. Ndabe testifies about her husband's death in a similar staged accident."},{"custom_id":"lo_s11_e20","season":"11","episode_number":"20","episode_title":"All My Children","air_date":"","source_notes":"Transcript appears truncated at end during cross-examination of Jessie Lucas","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Scott Wilder is found shot dead at Wilshire School. Investigation initially focuses on homeless shelter residents, then drug connections. Detectives discover Scott was involved in extortion scheme with Jessie Lucas, who believed Peter Wilder was her father. Kinship analysis proves Peter wasn't her father. Jessie testifies that she backed out of meeting but Scott went ahead alone. Evidence (missing gun, red dust on shoes, $250K withdrawal) points to Peter Wilder killing his own son. Transcript ends mid-testimony at preliminary hearing."},{"custom_id":"lo_s11_e21","season":"11","episode_number":"21","episode_title":"Brother's Keeper","air_date":"","source_notes":"Transcript appears complete through investigation revealing Donald Lonegan killed Malloy and Cally killed witness Waziri","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"James Malloy is murdered at a driving range. Investigation reveals he was business partners with gangster Cally Lonegan and was dating Cally's niece Margaret, who died of a drug overdose from drugs Malloy provided. Cab driver Sebastian Waziri witnesses someone leaving Malloy's murder scene and is later killed. The case reveals Cally is an FBI informant protected by agents Innes and Washington. Ultimately, evidence shows Donald Lonegan (Cally's brother, Margaret's father) killed Malloy to avenge his daughter's death, while Cally killed witness Waziri to protect his brother. No one proven/strongly implied innocent is publicly exposed or harmed by false accusation."},{"custom_id":"lo_s11_e22","season":"11","episode_number":"22","episode_title":"School Daze","air_date":"","source_notes":"Transcript appears complete through arraignment and pretrial phases","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"School shooting at George Mason High kills 4, wounds 11. Police pursue multiple false leads before finding actual shooter Henry Semple. Howard Earl, a Black student, is publicly arrested and perp-walked based on witness tip, then cleared via alibi (was visiting mother in prison). Case against Semple later dismissed on Fourth Amendment grounds when gun evidence suppressed."},{"custom_id":"lo_s11_e23","season":"11","episode_number":"23","episode_title":"Judge Dread","air_date":"","source_notes":"Transcript appears complete through courtroom testimony but cuts off mid-sentence during final discussion","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Judge Linda Karlin survives assassination attempt by Frank Morris (killed by detective). Investigation reveals Morris visited Rikers inmate Randall Wylie before attack. Wylie charged with attempted murder based on jailhouse informant Jimmy McGowan's testimony that Wylie solicited the hit. Multiple innocent suspects publicly investigated before focusing on Wylie: Evan Bruce (threatening note writer), Vince Ellis (gun owner). Wylie claims entrapment by McGowan. Transcript ends mid-trial, ultimate verdict unknown."},{"custom_id":"lo_s11_e24","season":"11","episode_number":"24","episode_title":"Deep Vote","air_date":"","source_notes":"Transcript appears complete through courtroom proceedings about ballot counting motion.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Martha Krasner is shot and killed in what initially appears to be road rage. Investigation reveals she was killed by mistake - the intended target was investigative journalist Kate Pierce, who was working on a story about election fraud in a state senate race. The killer, Martin Blatt, was hired by Albert Bonatto on behalf of State Senator Anne Benton to prevent Pierce from exposing a scheme to rig voting machines and steal ballots. Multiple innocent people are investigated before the true conspiracy is uncovered."},{"custom_id":"lo_s13_e08","season":"13","episode_number":"8","episode_title":"Asterisk","air_date":"","source_notes":"Transcript appears complete through trial portion; includes defense objection to Roger Ellery testimony","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Kevin Seleeby, a professional baseball player, is arrested and tried for murdering his limo driver Norman Pratt. Two accomplices (agent Martin Stanley and cousin David Arkuss) testify against Seleeby in exchange for deals. Defense argues steroid-induced psychosis. Prosecution's motive theory (blackmail over steroid use) is blocked; actual motive (blackmail over Seleeby being gay) is also blocked due to attorney work-product privilege. No innocent persons are falsely accused then later cleared in this episode. The investigation quickly identifies Seleeby as the perpetrator through witness testimony and evidence, and he remains the defendant throughout."},{"custom_id":"lo_s16_e01","season":"16","episode_number":"1","episode_title":"Red Ball","air_date":"","source_notes":"Transcript appears complete through final courtroom scene and partial final dialogue.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Five-year-old Jennifer Clark is kidnapped from her mother's car. Detectives initially suspect the father Jimmy Clark due to custody/child support disputes. He is publicly confronted at his workplace and interrogated but proves innocent. The actual kidnapper, Dwight Jacobs, is arrested and uses the child's life to extort his freedom. Jennifer is ultimately recovered alive."},{"custom_id":"lo_s16_e02","season":"16","episode_number":"2","episode_title":"Flaw","air_date":"","source_notes":"Complex con scheme involving fake shooting, followed by real murder; mother-daughter team of con artists","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Patrick Sullivan is found murdered after a staged con. Initially investigators pursue David Glass as a witness to the con, but Glass is later found dead (suicide). Lorraine Dillon confesses to killing Sullivan in self-defense, claiming he molested her daughter April. April later testifies against Lorraine, claiming Lorraine killed Sullivan out of jealousy. Both women appear to have manipulated the system, with April ultimately revealed as having killed her own infant years earlier. The episode centers on who really killed Sullivan and reveals layers of deception between mother and daughter."},{"custom_id":"lo_s16_e03","season":"16","episode_number":"3","episode_title":"Ghosts","air_date":"","source_notes":"Original investigation 10 years prior to current episode; Rob Dolan wrongfully suspected of killing daughter Sara; Johnny Zona eventually convicted.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Rob Dolan was the prime suspect in his 12-year-old daughter Sara's rape and murder 10 years ago. Despite no arrest, he faced intensive police investigation, public suspicion, hired a lawyer immediately, and endured a decade of being viewed as having killed his own child. His wife Amy eventually died (implied stress-related). The real killer, Johnny Zona, is eventually identified via deathbed confession of accomplice Dan Flood. Dolan testifies at trial, finally vindicating himself."},{"custom_id":"lo_s16_e04","season":"16","episode_number":"4","episode_title":"Age of Innocence","air_date":"","source_notes":"Transcript appears complete through the verdict and final scene.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Robert Barrows is killed by a car bomb while trying to remove his comatose wife Karen's feeding tube. The investigation leads to Walter Byrd (bomb maker), Reverend Harlan Dwyre (who orchestrated the murder), and the Lamar family (Karen's parents and brother Steven). Steven Lamar planted the bomb. All suspects are actually guilty of involvement in the murder conspiracy. No innocent people were falsely accused with public exposure or material harm. The jury convicts Steven Lamar but deadlocks on Reverend Dwyre (mistrial)."},{"custom_id":"lo_s16_e05","season":"16","episode_number":"5","episode_title":"Life Line","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Teresa Richter, an aspiring journalist, is murdered while undercover investigating L-12 gang activities. Initially, gang members Beto Torres and Dolores (Lola) are investigated. Kevin Drucker, a businessman, is arrested and convicted for the murder. His son Patterson was incarcerated with L-12 gang members who coerced Kevin into killing Teresa by threatening Patterson's life. Diablo Morales, L-12 lieutenant, is later prosecuted as the one who ordered the hit through Kevin. Lola is investigated but never charged. Patterson Drucker, while involved in contraband smuggling, was a victim of coercion and ultimately released."},{"custom_id":"lo_s16_e06","season":"16","episode_number":"6","episode_title":"Birthright","air_date":"","source_notes":"Episode involves a nurse performing unauthorized sterilizations on young women, one of whom dies. Primary focus is on the nurse's culpability, but episode explores multiple victims of false/coerced medical procedures.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A street vendor, Sam Register, is murdered. Detectives initially pursue Traci Sands, a 16-year-old with a criminal record, as the primary suspect based on witness testimony and physical evidence. Traci dies in custody from complications of an unauthorized sterilization procedure. The case pivots to prosecuting Nurse Gloria Rhodes for Traci's death. Multiple other young women are revealed as victims of Rhodes' unauthorized sterilizations, performed without their knowledge or consent."},{"custom_id":"lo_s16_e07","season":"16","episode_number":"7","episode_title":"House of Cards","air_date":"","source_notes":"Transcript appears truncated mid-testimony during cross-examination of Arlene Tarrington","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"Chelsea Hagerty is murdered and her newborn stolen. Initially, her boyfriend Steve Monroe and ex Frank Stoll are investigated. Arlene Tarrington, who kidnapped the baby, is arrested for murder. She later claims Frank Stoll committed the murder as part of a baby-selling scheme. DNA reveals Stoll is the biological father, devastating Monroe who believed the child was his. Arlene testifies against Stoll. The transcript cuts off during cross-examination, making final resolution unclear."},{"custom_id":"lo_s16_e08","season":"16","episode_number":"8","episode_title":"New York Minute","air_date":"","source_notes":"Transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Trucking company owner Clayton Stack is murdered. Investigation reveals he was smuggling illegal immigrants and caused the deaths of 12 people when his refrigerated trailer malfunctioned. Lester Wilkes, a former employee Stack fired, is initially suspected but cleared. The case ultimately focuses on Nathaniel Prentiss, a member of the anti-immigration Countrymen Borderwatch group, who killed Stack. Terry Dorn, another Countryman, is revealed to have sabotaged Stack's truck (causing the 12 deaths) and manipulated Prentiss into the murder to cover up his own crimes."},{"custom_id":"lo_s16_e09","season":"16","episode_number":"9","episode_title":"Criminal Law","air_date":"","source_notes":"Three women named Sylvia Rossi murdered by Harlan Barnes (using Troy Hendricks identity) on orders from father Leland Barnes to eliminate witnesses from 9-year-old workplace shooting case. Leon Whitaker and wife also killed. Elaine Bowman survives but recants testimony.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Episode centers on witness elimination, not false accusations. Leland Barnes orchestrated murders of witnesses from his original trial through his son Harlan. No innocent persons were falsely accused - the perpetrators (Leland and Harlan Barnes) were correctly identified. Elaine Bowman recanted under pressure but was never accused of wrongdoing herself. The murdered Sylvia Rossis were victims, not accused parties."},{"custom_id":"lo_s16_e10","season":"16","episode_number":"10","episode_title":"Acid","air_date":"","source_notes":"Emily Newton was burned with drain cleaner 6 months before her suicide. Jason Corley was accused, case dismissed due to witness recantation, then re-prosecuted after confession obtained via sting operation.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Emily Newton dies by suicide after being facially disfigured with industrial drain cleaner 6 months prior. Detectives investigate her death and determine her ex-boyfriend Jason Corley threw the acid. Corley is arrested but the case is dismissed when witness Christine Hill recants her line-up ID due to intimidation. A sting operation using Corley's new girlfriend and victim's sister Callie leads to his confession. Corley pleads guilty to 25 years. No falsely accused persons identified in this episode - Corley was guilty throughout."},{"custom_id":"lo_s16_e11","season":"16","episode_number":"11","episode_title":"Bible Story","air_date":"","source_notes":"Transcript appears complete through trial testimony but cuts off mid-sentence at end","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Jeffrey Kilgore is murdered outside a synagogue while destroying a sacred Torah. Initially suspected of being an anti-Semitic hate crime perpetrator, Kilgore is later revealed to be hired by Eric Speicher (congregation president Barry Speicher's cousin) to desecrate the book as leverage to force sale of the building. Barry Speicher killed Kilgore when he caught him in the act. The Palestinian laundromat owner Fadi Abu Libdeh is also briefly suspected due to neighborhood tensions but is cleared."},{"custom_id":"lo_s16_e12","season":"16","episode_number":"12","episode_title":"Family Friend","air_date":"","source_notes":"Transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Philip Messick is murdered and his wife Valerie severely wounded in what appears to be a robbery. The detectives arrest Darrell Dennehy and Jay Fleckner. Valerie identifies Fleckner, but her testimony falters under cross-examination about her emotional state and certainty. Fleckner is acquitted. Retired detective Bob Cerullo (friend of the Messicks) later shoots Fleckner, claiming self-defense. Investigation reveals Cerullo and the deceased detective Dumar were selling stolen property through Messick to the mob. The gun on Fleckner was planted by Cerullo. At trial, Valerie Messick shockingly testifies she asked Cerullo to kill Fleckner and deliberately sabotaged her own testimony to ensure Fleckner's acquittal so Cerullo could kill him. Cerullo is convicted of murder. Multiple defendants from Cerullo's past cases file for new trials based on his admitted evidence planting."},{"custom_id":"lo_s16_e13","season":"16","episode_number":"13","episode_title":"Heart of Darkness","air_date":"","source_notes":"Tadhg Ruane was mentally ill (dysphoric mania) and suicidal. He was not accused of a crime; rather, he was the victim of a suspected murder staged as suicide. Multiple people were investigated as suspects but later cleared.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Journalist Tadhg Ruane's death is initially staged as suicide but investigated as murder. Multiple suspects are investigated and publicly questioned/arrested before the real circumstances emerge: assisted suicide involving his girlfriend Angela Burkett and brother Gerald Ruane. Alfred Biso (gun dealer) and Angela Burkett were both initially suspected of murder before being cleared or having charges reduced. Biso was publicly arrested in front of customers; Angela was publicly accused in court before the assisted suicide defense emerged."},{"custom_id":"lo_s16_e14","season":"16","episode_number":"14","episode_title":"Magnet","air_date":"","source_notes":"Full transcript appears complete through verdict.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"High school student Alex Garcia is murdered in a music room. Investigation reveals he was selling test answers to other students. Greg Loomis, a wealthy student whose grades depended on Alex's cheating scheme, killed Alex after he refused to provide more answers. Defense claimed Centinall (ADHD medication) caused involuntary intoxication, but prosecution proved Greg was selling his pills rather than taking them. Freddie Colon committed perjury by falsely claiming he bought pills from Greg (at victim's father's urging), but Greg was ultimately convicted of Murder in the Second Degree. No innocent parties were publicly accused or harmed by false accusations in this episode."},{"custom_id":"lo_s16_e15","season":"16","episode_number":"15","episode_title":"Choice of Evils","air_date":"","source_notes":"Complex case involving mother killing son; includes wrongful ATM murder accusation subplot","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Danny Ashburn, a troubled teen living on the streets, is murdered by his mother Allison. Investigation reveals Danny had Type 2 Conduct Disorder and his biological father was serial killer Walter Flint. During trial, defense uses justification argument that Danny posed imminent threat. A surveillance video emerges showing Danny committed an ATM murder of Philip Brown - an innocent victim wrongly counted in initial suspect Shawn's profile, and Philip Brown himself as murder victim. Tina Keith (Danny's girlfriend) knew details but didn't report. Mother convicted of Murder 2."},{"custom_id":"lo_s16_e16","season":"16","episode_number":"16","episode_title":"Cost of Capital","air_date":"","source_notes":"Transcript appears complete through final scene where defense accepts plea deal.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Derek Miller, an investment banker, is murdered after threatening to expose his affair with his boss Sophia Keener. Detectives initially suspect Lucas Brody (jealous colleague) and Robert White (estranged husband). Both are publicly questioned but later cleared. Robert White is arrested based on forensic evidence but ultimately cooperates against Sophia. The case reveals decades of sexual abuse by Andrew Keener (Sophia's father) of both Sophia and her daughter Katie, used as leverage for alibis and corporate control."},{"custom_id":"lo_s16_e17","season":"16","episode_number":"17","episode_title":"America, Inc.","air_date":"","source_notes":"Transcript appears complete through most of trial but cuts off during final dialogue.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Jeffrey Pope, a supervisor for private military contractor Diamond River Group, is murdered in a NYC hotel. Investigation leads to Kevin Boatman (ex-colleague who blamed Pope for deaths in Iraq roadside bomb) and Robbie Howell (brother of Nick Howell, killed in that ambush). Both are charged with murder. Defense introduces video of Nick Howell's ambush/beheading to show Pope's incompetence created enemies. Boatman reveals Pope was in NYC to ransom an Iraqi terrorist (Abu Zayeed) to Israelis for $15M - DRG team captured him and held him in secret facility. Pentagon needs Boatman's cooperation to locate Zayeed and potentially save three captured Marines. DA dismisses charges against Boatman in exchange for cooperation; proceeds against Robbie Howell alone. No falsely accused innocent persons are identified in this episode - the defendants appear to be the actual perpetrators, though defense argues justification/context."},{"custom_id":"lo_s16_e18","season":"16","episode_number":"18","episode_title":"Thinking Makes It So","air_date":"","source_notes":"Transcript shows bank robbery case where manager Howard Grant is initially suspected of complicity but was forced to participate under threat to his daughter Julie.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Bank manager Howard Grant is arrested after robbing his own bank and killing security guard. Detectives discover Grant's 6-year-old daughter Julie was kidnapped by accomplices to force his cooperation. Grant was publicly arrested at work and initially treated as criminal before truth emerged. Mitchell Lowell is eventually identified as mastermind."},{"custom_id":"lo_s16_e19","season":"16","episode_number":"19","episode_title":"Positive","air_date":"","source_notes":"Transcript appears truncated mid-testimony. Dr. Copelan's final answer cut off.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"A diner shooting initially targets the wrong victim (Oscar Morales killed instead of hospital administrator Elaine Clemens). The shooter, 14-year-old Jeremy Miller, believed Clemens and Children's Healing House killed his sister Emily through medical mistreatment. Jeremy dies by suicide during arrest. Investigation reveals Dr. Andrew Copelan was conducting unauthorized drug experiments on foster children with AIDS, including Emily Miller, who died from over-medication. Foster mother Pamela Henson was wrongly charged with abuse for taking Emily off medications. Drug dealer Prim is briefly suspected but cleared. The trial focuses on whether Dr. Copelan's experimental treatment constituted depraved indifference murder."},{"custom_id":"lo_s16_e20","season":"16","episode_number":"20","episode_title":"Kingmaker","air_date":"","source_notes":"Transcript appears complete through final scene with Lund plea negotiation.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Undercover detective Dana Baker is murdered after her cover is blown by a newspaper column written by Veronica Drake. Investigation reveals political operative Eric Lund leaked her identity to discredit her father Tom Baker's book criticizing Congressman Prescott. Lund obtained Baker's info by impersonating Homeland Security to NYPD Payroll, then fed it to reporters. No innocent persons were falsely accused in this episode - the investigation correctly identified Lund as responsible, though he attempted to fabricate exculpatory evidence during trial. The victim Dana Baker was undercover but never accused of crimes; her father Tom Baker inadvertently mentioned she was NYPD at a private gathering but was not formally accused of wrongdoing."},{"custom_id":"lo_s16_e21","season":"16","episode_number":"21","episode_title":"Hindsight","air_date":"","source_notes":"Transcript appears complete through investigation and first trial","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Detective Nick Falco wakes up to find Sonia Vasquez murdered in his bathroom. He becomes a suspect but insists he was drugged. Investigation reveals Sonia was part of a robbery crew drugging wealthy men. Keisha Sipes is charged with Sonia's murder (motivated by Sonia's pregnancy with Keisha's boyfriend Henry's baby) but is acquitted. Evidence emerges suggesting Angela Young (Henry's mother) orchestrated both murders as payback against Falco for imprisoning her ex-husband Tyrell Young years earlier. Multiple innocent people are publicly accused and harmed."},{"custom_id":"lo_s16_e22","season":"16","episode_number":"22","episode_title":"Invaders","air_date":"","source_notes":"Complex case involving home invasions, corrupt DEA agent, and controversial prosecutorial tactics following ADA Borgia's murder","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Home invaders kill the Andreas family while trying to lure Frank Andreas home. Andreas had been cooperating with ADA Borgia about selling fake DEA badges to the killers. The case reveals a corrupt DEA agent (Kevin Almonte) was tipping the home invaders to drug houses. Multiple innocent people are publicly accused before the real perpetrators (Ricky Robinson and Vincent Mulkowsky) are caught. ADA Borgia is kidnapped and murdered. McCoy stages a controversial fake prosecution to pressure Almonte into revealing the killers' location."},{"custom_id":"lo_s17_e01","season":"17","episode_number":"1","episode_title":"Fame","air_date":"","source_notes":"Transcript appears complete through most of trial scenes but cuts off mid-sentence at end during plea negotiation.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A police officer (Det. Carvahal) is killed interrupting a burglary. Gary Blanchard is initially questioned as the former tenant whose apartment was burglarized. Celebrity photographer Blanchard is accused/suspected of involvement but is later revealed to be the victim of the burglary and a co-conspirator/blackmail target of the actual killer Justin Smolka. Blanchard cooperates and testifies against Smolka. No evidence he was ever seriously accused of the murder itself, but he faced public questioning and potential charges for obstruction/blackmail before cooperating."},{"custom_id":"lo_s19_e01","season":"19","episode_number":"1","episode_title":"Rumble","air_date":"","source_notes":"Episode involves organized street fighting leading to death of Todd Hauser, then a retaliatory brawl. Multiple suspects cleared or charges reduced.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Todd Hauser dies from injuries sustained in a Union Square street fight. Vince Fonsella is arrested for murder but pleads to negligent homicide and avoids jail time. Hauser's friends and Fonsella's crew engage in a retaliatory brawl that kills three people including Fonsella. Key defendants are charged with terrorism but ultimately plead to lesser charges. Donna (the girl who introduced Todd to street fighting) is initially accused of conspiracy but cleared. The prosecution's terrorism theory is controversial but used as leverage for plea deals."},{"custom_id":"lo_s19_e02","season":"19","episode_number":"2","episode_title":"Challenged","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Rick Devon is murdered in a park. Police initially suspect drug dealers Big Chuck and Momo, who are arrested and charged. Later, Rick's brother Ted Devon is revealed as the actual killer. Pete Harris (Rick's mentally disabled brother) is coerced by family to falsely confess to protect Ted, leading the ADA to threaten charging Pete with murder to force the truth out."},{"custom_id":"lo_s19_e03","season":"19","episode_number":"3","episode_title":"Lost Boys","air_date":"","source_notes":"Polygamist fundamentalist Mormon sect (Church of the True Path) from Boyd Canyon, Arizona. Episode involves murder, attempted kidnapping conspiracy, and systemic abuse within religious compound.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Caleb Friendly is murdered in Central Park. Patrick Friendly is arrested and charged with murder after confessing to stabbing Caleb with a chisel to protect Michelle Landon (a runaway wife of the sect's Prophet Wyatt Landon) from kidnapping. Evidence later reveals Wyatt Landon orchestrated a kidnapping conspiracy involving Caleb, making Patrick's actions potentially justified. Wyatt Landon and co-conspirators are charged with attempted kidnapping and felony murder but charges are ultimately dismissed when Michelle, now pregnant with Wyatt's child, refuses to testify and returns to the compound."},{"custom_id":"lo_s19_e04","season":"19","episode_number":"4","episode_title":"Falling","air_date":"","source_notes":"Transcript appears truncated mid-sentence during final plea negotiation","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"A crane collapse kills worker Carlos Lazaro, initially blamed on bribery/overloading. Investigation reveals Carlos's wife Amelia was pushed into a pool by employer Sandra Talbot (not over suspected affair with Gary Talbot as first believed, but over Amelia's religious opposition to controversial medical procedure planned for the Talbots' disabled daughter). Gary Talbot falsely accused of affair; city inspector Eddie O'Connor falsely suspected of being sole bribe recipient. Transcript cuts off during final plea negotiation."},{"custom_id":"lo_s19_e05","season":"19","episode_number":"5","episode_title":"Knock Off","air_date":"","source_notes":"Transcript appears complete through investigation and arrest but may be cut before final resolution.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"William Timmons, a reformed drug addict and confidential informant for Sheriff Burkhart, is murdered in NYC. Dianne Cary, whom Timmons raped 3 years prior (charges dropped due to Burkhart's protection of his CI), is initially suspected and arrested. Investigation reveals Sheriff Burkhart murdered Timmons to prevent him from exposing Burkhart's cover-up of the rape and other crimes. Deputy Linz is framed/pressured into suicide with the murder weapon. Dianne Cary is publicly arrested, jailed, and exposed despite being innocent of murder."},{"custom_id":"lo_s19_e06","season":"19","episode_number":"6","episode_title":"Sweetie","air_date":"","source_notes":"Transcript involves fake memoir scandal, multiple false identities claiming to be 'Sweetie Ness', and wrongful conviction.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Dale Marks, an actor hired to impersonate the author 'Sweetie Ness,' is murdered. Cody Larson is accused and convicted of the murder, but evidence later suggests the agent Kate Tenny (who may be the real 'Sweetie Ness' and wrote the memoir herself) committed the crime. The prosecution moves to vacate Larson's conviction at episode's end."},{"custom_id":"lo_s19_e07","season":"19","episode_number":"7","episode_title":"Zero","air_date":"","source_notes":"Judge Reynolds' mental decline becomes central to trial proceedings; case involves Nancy Hartwig's murder and Chris Mason's involvement.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Nancy Hartwig is murdered with a shovel at a community garden. Chris Mason, who borrowed her car to visit his children, becomes the prime suspect after the car is found at a New Jersey cop-killing scene. Joe Hartwig, Nancy's husband, is also investigated as a potential jealous spouse. Mason is eventually established as the true killer, but Joe faces public accusations of being involved due to the unusual zero-carbon lifestyle and Nancy's secret rule-breaking (meeting Mason at bars, driving their car). The case is complicated by Judge Reynolds' cognitive decline and his law clerk manipulating court proceedings."},{"custom_id":"lo_s19_e08","season":"19","episode_number":"8","episode_title":"Chattel","air_date":"","source_notes":"Episode involves adoption fraud/slavery ring; double murder of lawyers investigating child welfare.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Frederick and Elizabeth Bellamy, family law attorneys, are murdered. Investigation reveals they were looking into the welfare of Isabelle Carter, an adopted Haitian girl returned to Haiti after her adoptive parents' divorce. The case uncovers a slavery ring operated by Eric and Miriam Johnson, who fraudulently adopted Haitian children (including Patrick Johnson) to use as servants. The Johnsons' daughter Karen coerced Patrick into shooting the Bellamys to protect her parents. No innocent persons were falsely accused with public exposure or material harm in this episode. Bill Carter was initially investigated but never publicly accused or arrested. Patrick Johnson, while technically innocent (coerced into the murders by Karen), is charged as a defendant rather than being falsely accused, and his harm stems from his enslaved status rather than a false accusation."},{"custom_id":"lo_s19_e09","season":"19","episode_number":"9","episode_title":"By Perjury","air_date":"","source_notes":"Transcript appears complete through courtroom scenes. Episode centers on attorney Martin Winston who allegedly committed perjury that led to Victor Cruz's wrongful execution.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Contractor Charles Sawyer is murdered after discovering potential exculpatory evidence for PanWorld Airlines in a class action lawsuit. Investigation reveals his attorney Martin Winston likely killed him to protect a potential $400M settlement. Winston had previously testified falsely against his own client Victor Cruz in a judge's murder case, leading to Cruz's wrongful conviction and execution. Winston is arrested for Sawyer's murder but evidence is suppressed. He is later charged with Cruz's murder via depraved indifference/perjury theory."},{"custom_id":"lo_s19_e10","season":"19","episode_number":"10","episode_title":"Pledge","air_date":"","source_notes":"Transcript appears truncated mid-sentence at trial. Susan Walden appears to be about to testify but transcript ends.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"Y","summary":"A science writer Ned Lasky is charged with murdering 12-year-old Eric Foley and housekeeper Grazinya to revenge a 30-year-old slight at a Dartmouth sorority mixer where Joyce Foley (Eric's mother) asked him to leave. Lasky's daughter Molly testifies against him regarding evidence (briefcase, gas receipt), motivated by a $100,000 reward. Joyce Foley identifies Lasky from a college photo as the boy she 'squashed' at the mixer. The defense attacks both witnesses' credibility. No falsely accused persons are identified in the transcript - Lasky is the primary suspect throughout and no one else is seriously pursued or publicly exposed as a suspect. The transcript ends mid-trial with Susan Walden about to testify."},{"custom_id":"lo_s19_e11","season":"19","episode_number":"11","episode_title":"Lucky Stiff","air_date":"","source_notes":"Transcript appears complete through courtroom scenes discussing inheritance and abatement","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Vladimir Rezanov (Vic Russell) is murdered; Stanley Klein is accused, convicted of enterprise corruption for fraud/murder, but is himself later murdered. The investigation reveals Klein's son Chad may have killed both Klein and Klein's wife for inheritance purposes. Klein was initially the prime suspect for Rezanov's murder and was publicly tried and convicted before being killed."},{"custom_id":"lo_s19_e12","season":"19","episode_number":"12","episode_title":"Illegitimate","air_date":"","source_notes":"Transcript appears complete through resolution","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Sergeant Scott Waylon is killed after taking hostages; investigation reveals he robbed collector Norman Lukovitch (who died in struggle) for John McIntyre, who wanted JFK's hair to prove paternity. Multiple innocent people publicly accused before real connections emerge."},{"custom_id":"lo_s19_e13","season":"19","episode_number":"13","episode_title":"Crimebusters","air_date":"","source_notes":"Transcript appears truncated mid-sentence at end.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"Y","summary":"A firebomb at a military recruitment center kills a baby. Initially Derek Sherman is arrested after vigilante group Operation Molly identifies him and finds evidence (bricks, butane in backpack). Later the widow Carly Di Gravia is arrested after drunk statements and revelations about her husband's bomb-making history. Operation Molly members plant evidence (butane in backpack), and testimony reveals Derek dealt marijuana (non-violent profile). The transcript ends before verdict, but both Derek and Carly appear to be wrongly accused at different points, with Derek's arrest dropped when focus shifts to Carly."},{"custom_id":"lo_s19_e14","season":"19","episode_number":"14","episode_title":"Rapture","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Larry Novak confesses to murdering his wife years ago after mistakenly believing the rapture occurred. Sam Burwell is murdered after discovering George Darvey embezzled from Sacred Exodus charity. Evan Corliss is initially suspected after confronting Burwell about stolen gold coins. Reverend Reeves initially provides false testimony to protect the charity's work before ultimately revealing the truth about Darvey."},{"custom_id":"lo_s19_e15","season":"19","episode_number":"15","episode_title":"Bailout","air_date":"","source_notes":"Transcript appears complete through verdict","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Blair Carlson is kidnapped and held in a Harlem building, then dies fleeing into traffic. Ronny Aldridge, who runs Fresh Horizons youth program, is charged with kidnap-murder after failing to get $200k from Pete Gardner (Carlson's boyfriend, a disgraced Wall Street CEO) to buy a farm for his boys. Carlos, a youth in the program, is initially suspected but cleared. Aldridge claims Carlson suggested faking her own kidnapping. Despite strong evidence, jury acquits Aldridge (jury nullification influenced by Gardner's Wall Street greed). No persons shown to be falsely accused meet the innocence + public harm criteria."},{"custom_id":"lo_s19_e16","season":"19","episode_number":"16","episode_title":"Take-Out","air_date":"","source_notes":"Transcript appears complete through final scene where Martin Garvik reveals the truth about his wife being the actual spy.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Alex Boone, a journalist who spent 6 years in Chinese prison for espionage, is murdered while writing a book about a 1998 espionage case. Police initially suspect David Sutton, son of convicted spy Martin Garvik, of hiring hitman Mike Adams to silence Boone. The case reveals Martin Garvik took the fall for his wife Elyse, who actually passed defense secrets to China before committing suicide. David believed he was protecting his father by having Boone killed, not knowing his mother was the real spy."},{"custom_id":"lo_s19_e17","season":"19","episode_number":"17","episode_title":"Anchors Away","air_date":"","source_notes":"Transcript provided; episode centers on murder of TV reporter Dawn Prescott investigating fraud; fraud mastermind's wife Irene Matson is the killer.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"TV reporter Dawn Prescott is murdered while investigating hedge fund fraud by Frederic Matson. Initially, Matson himself is suspected, then Colombian drug lord Livan Santana (who had motive to silence Prescott). Evidence eventually points to Matson's wife Irene, who confesses. Frederic Matson nearly takes the fall by falsely claiming Santana did it to protect his wife. Joe Delaney, a news anchor, is briefly threatened with murder charges for endangering Prescott by tipping off Matson, but is never formally charged—he loses his job instead. Livan Santana is accused of murdering whistleblower Vince Decker but is not prosecuted (fled to Colombia). The episode shows multiple false paths before reaching the true killer."},{"custom_id":"lo_s19_e18","season":"19","episode_number":"18","episode_title":"Promote This!","air_date":"","source_notes":"Complete transcript available","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Three white teenagers (Tony Stratton, Timothy Moore, Kyle Chase) attack Hispanic day laborers in a series of hate crimes, including branding victims with a heated Mexican peso. Oswaldo Morales is thrown from their car after being assaulted and branded, left in a coma. Rey Alvarez, an unemployed auto worker from Detroit, is murdered by the same group. All three teens are arrested and prosecuted. Kyle Chase testifies against the other two in exchange for a lighter sentence. The defendants are acquitted of murder but convicted of first-degree assault against Morales. They receive 5-year sentences. After the trial, Morales dies when his mother signs a DNR order, leading to new murder charges. No person in this episode qualifies as falsely accused then proven/strongly implied innocent."},{"custom_id":"lo_s19_e19","season":"19","episode_number":"19","episode_title":"All New","air_date":"","source_notes":"Law & Order transcript: murdered firefighter couple, hidden drug money, rookie firefighter Nick Spence wrongly implicated then killed in suspicious warehouse fire","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Firefighter Lt. Thomas Cooper and wife Linda are murdered in home invasion. Investigation reveals Cooper found $400K in 40-year-old drug money hidden in walls. Rookie firefighter Nick Spence becomes suspect due to hazing motive and knowledge of money. Spence dies in suspicious warehouse fire before arrest. Later revealed: senior firefighters Brad Toshack, Walters, and McShane committed murders for money; Toshack deliberately sent Spence to death in fire to silence him."},{"custom_id":"lo_s19_e20","season":"19","episode_number":"20","episode_title":"Exchange","air_date":"","source_notes":"Transcript shows two British exchange students murdered; initial suspect Charlie Headlind (bipolar neighbor) died trying to save them; actual killer was Wendy Teal (bipolar woman whose brother withheld her meds); brother Dennis convicted via conspiracy theory after initial depraved indifference case collapsed.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Two British grad students (Colin Tilbrook and Geraldine Sarfield) were murdered and set on fire. Police initially suspected Charlie Headlind, a bipolar neighbor, but he died from smoke inhalation trying to save them. Investigation revealed Wendy Teal (Charlie's girlfriend, also bipolar) killed them during a psychotic episode. Her brother Dennis had withheld her medication for three months to incapacitate her while he stole/sold a family heirloom. The prosecution initially pursued Dennis for depraved indifference murder, then pivoted to conspiracy/felony murder theory when Dennis's own testimony about Wendy being 'rational' undermined the original case. Dennis took a plea for 20-to-life."},{"custom_id":"lo_s19_e21","season":"19","episode_number":"21","episode_title":"Skate or Die","air_date":"","source_notes":"Transcript analyzed for false accusation patterns","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Three homeless men are murdered in a copycat of the 'Boxcar Basher' serial killer. Police initially suspect Jonah Applebaum (the 'Bipolar Roller'), a mentally ill street performer, believing victim Paco was killed because he wore Jonah's skates. Jonah is arrested, publicly exposed, and jailed. Later evidence reveals Jonah's business partners Grant and Bob Carpenter committed the murders to frame Jonah or eliminate him from their failing T-shirt business. Jonah is cleared of these three murders but is subsequently revealed to be the actual Boxcar Basher serial killer (9 prior murders). The partners are prosecuted for the three copycat murders."},{"custom_id":"lo_s19_e22","season":"19","episode_number":"22","episode_title":"The Drowned and the Saved","air_date":"","source_notes":"Transcript shows complex political corruption case involving Governor Shalvoy's wife Rita arranging murder of Charles Whitley to obtain his job at Boland Initiative","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Charles Whitley, executive director of Boland Initiative, is murdered. Investigation reveals Rita Shalvoy (Governor's wife) hired Bobby Amato to force Whitley out of his job so she could take it as part of a political deal involving a U.S. Senate seat appointment. Amato made compromising S&M videos of Whitley, then killed him when he wouldn't resign. No falsely accused innocent persons with public exposure - Amato confessed and was actually guilty; investigation targeted the correct perpetrators throughout."},{"custom_id":"lo_s20_e01","season":"20","episode_number":"1","episode_title":"Memo from the Dark Side","air_date":"","source_notes":"Transcript appears complete through courtroom proceedings but cuts off before verdict is read.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Greg Tanner, a war veteran dealing drugs on campus and suffering PTSD from Abu Ghraib, is shot and killed by Professor Kevin Franklin. Franklin claims self-defense, saying Tanner threatened him. Investigation reveals Tanner witnessed torture sanctioned by Franklin's legal memos and may have been trying to implicate Franklin or seek compensation. Case pivots from self-defense murder trial to prosecution of Franklin and Bush administration officials for conspiracy to commit torture. No falsely accused innocent parties are identified—Franklin is the defendant throughout and claims self-defense rather than innocence of the shooting itself."},{"custom_id":"lo_s20_e02","season":"20","episode_number":"2","episode_title":"Just a Girl in the World","air_date":"","source_notes":"Transcript analyzed for false accusation patterns","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Emma Kim falsely accuses livery driver Nestor Maldonado of attempted rape to deflect from her involvement in murdering Daisy Chao. Maldonado is arrested, publicly identified in lineup, and held in custody before charges are dropped when Emma's lies unravel. Jim Anderson (Daisy's fiancé) is also falsely suspected of murder and arrested for obstruction before Emma is revealed as the actual killer. Emma also falsely accuses Detective Lupo and Judge Maxen of sexual coercion during trial."},{"custom_id":"lo_s20_e03","season":"20","episode_number":"3","episode_title":"Great Satan","air_date":"","source_notes":"Transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Episode involves two parallel bomb plots targeting synagogues. One plot (led by Charles Cole, Ali Hossam, and Joe Darwish) is entirely orchestrated by police informant Sameer Ahmed with fake explosives. A second, real plot (Arthur Jackson group) uses a police-supplied detonator that was meant for the fake plot. Don Sorenson shoots James Caruso (an innocent dumpster diver) during a virtual kidnapping scheme, believing Caruso was his daughter's kidnapper. Multiple people are falsely accused or entrapped."},{"custom_id":"lo_s20_e04","season":"20","episode_number":"4","episode_title":"Reality Bites","air_date":"","source_notes":"Transcript includes complete dialogue and stage directions.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Joy Johnson is murdered. Multiple people are accused or investigated: son Tim (autistic, initially confesses), teen D.J. Lovell (took Tim's key), reality show competitor Belinda Alvarez (visited house day of murder). All are later cleared. Larry Johnson (husband) is ultimately charged but trial ends in mistrial. Tim, D.J., and Belinda all experienced public exposure and consequences from accusations before being cleared."},{"custom_id":"lo_s20_e05","season":"20","episode_number":"5","episode_title":"Dignity","air_date":"","source_notes":"Transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Dr. Walter Benning, a late-term abortion provider, is murdered during church service. Detectives investigate several suspects including Jonah Leland (boyfriend of patient), Kevin Morton (grandfather of patient's fetus), and ultimately Wayne Grogan, a pro-life protestor who confesses. During investigation, Jonah Leland and Kevin Morton are both publicly accused/questioned but proven innocent. Morton was publicly confronted at his workplace (university) and interrogated regarding the murder. Jonah was also publicly questioned at his workplace in front of his boss."},{"custom_id":"lo_s20_e06","season":"20","episode_number":"6","episode_title":"Human Flesh Search Engine","air_date":"","source_notes":"Transcript shows Sid Maxwell/Todd Bissell murdered by Kerry Sands (insane); several people from FlashPosse website prosecuted for manslaughter. Detective Bernard publicly exposed for child support issues during trial.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Sid Maxwell is found dead in apparent autoerotic asphyxiation. Investigation reveals he was murdered by Kerry Sands, a schizophrenic woman incited by the FlashPosse website that posted his address, building codes, and threats. During prosecution of website operators, defense attorney publicly exposes Detective Bernard's past child support failures using internet-sourced information, humiliating him in court. Bernard's personal life becomes evidence to attack his credibility."},{"custom_id":"lo_s20_e07","season":"20","episode_number":"7","episode_title":"Boy Gone Astray","air_date":"","source_notes":"Transcript shows investigation of Nina Wilshere murder by Mexican cartel-trained child assassins. Focus on Rafael Alvarez's prosecution and cooperation.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Nina Wilshere is murdered by cartel-trained teenage assassins. Investigation initially focuses on chiropractor Lucas Evra, who owed money and had confrontation with victim. He is cleared when police discover Nina was a marijuana dealer targeted by rival cartel. Episode examines prosecution of juvenile killers and witness intimidation."},{"custom_id":"lo_s20_e08","season":"20","episode_number":"8","episode_title":"Doped","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Brenda Sawyer is accused of drunk driving after a fatal crash killing 7 people (including 3 children). Public and family believe she was intoxicated (.09 BAC, grain alcohol bottle found). Later proven she was drugged with Propofol by coworker Zach Marshall, who wanted to discredit her whistleblowing about Lextenda (a cancer drug). Marshall intended a minor accident/DWI to ruin her credibility with FDA, but it resulted in mass fatalities. Brenda suffered extreme public vilification, family accusations, media coverage, and died from injuries - all while innocent of drunk driving."},{"custom_id":"lo_s20_e09","season":"20","episode_number":"9","episode_title":"For the Defense","air_date":"","source_notes":"Complex episode involving defense attorney Marcus Woll conspiring to murder witnesses across multiple cases spanning 5 years","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Defense attorney Marcus Woll (former ADA) systematically murders or arranges murders of witnesses who threaten his cases. Henry Lovett, a pharmacist who could have cleared Alvin 'Mad Dog' Jackson of murder, was killed after Woll obtained his location. Maggie Hayes was murdered before testifying against Woll's client William Avery. Jackson was wrongfully convicted and served 5+ years. The episode also features failed attempt to kill witness Paige Regan."},{"custom_id":"lo_s20_e10","season":"20","episode_number":"10","episode_title":"Shotgun","air_date":"","source_notes":"Three men enter Stan Harkavy's tax office for what appears to be a robbery. Stan shoots all three with his shotgun, killing two. Investigation reveals the 'robbery' was actually a shakedown orchestrated by Max Purcell to intimidate Stan into selling his building. Stan recognized one of the men (Duane Jefferson) from an earlier encounter but lied about it, suggesting he knew it wasn't a real robbery when he opened fire.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"This episode contains NO qualifying innocent people who suffered harm from false accusations. While Max Purcell was accused and charged, he was actually guilty of orchestrating the shakedown. Stan Harkavy killed two men who were not actually planning to rob him (it was intimidation), but the men themselves were willing participants in the criminal scheme and were not falsely accused. The episode explores Stan's potential guilt for an unjustified shooting, but no innocent person was harmed by false accusations."},{"custom_id":"lo_s20_e11","season":"20","episode_number":"11","episode_title":"Fed","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Community organizer James Landy is murdered and initially believed to be a federal employee. Investigation reveals he was secretly videotaping Rights Alliance colleagues to expose potential extortion. Multiple suspects emerge: Jerry Ganz (Patriot Ranger who threatened Landy), Marissa Rumstead and Arturo Ramirez (Rights Alliance employees who disposed of evidence), and ultimately Courtney Owens and Davis Webb (who ordered the killing to prevent exposure of their affair and embezzlement cover-up). Jerry Ganz is arrested, jailed, and publicly protested over before being cleared as the killer."},{"custom_id":"lo_s20_e12","season":"20","episode_number":"12","episode_title":"Blackmail","air_date":"","source_notes":"Transcript shows a blackmail scheme involving journalist Megan Kerik's research on Vanessa Carville's relationships with female employees. Multiple people accused during investigation.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Journalist Megan Kerik is murdered while researching an exposé about TV personality Vanessa Carville's sexual relationships with female employees. Initial investigation focuses on Carville as a suspect due to motive to silence Kerik. Editor Dennis Di Palma is later revealed to have hijacked Kerik's research for blackmail, then arrested for extortion. Di Palma is initially suspected of murder before evidence points to his accomplice Derek Fanning. The case involves false accusations against Carville and temporary suspicion of Di Palma for murder before the real killer is identified."},{"custom_id":"lo_s20_e13","season":"20","episode_number":"13","episode_title":"Steel-Eyed Death","air_date":"","source_notes":"Triple homicide case involving Justin Sachs and Amanda Evans (aka Bonnie). Amanda claims amnesia and is found legally insane, then testifies against Justin.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Justin Sachs and Amanda Evans (going by 'Bonnie') murder the Morgan family (5 victims). Amanda is found legally insane and pleads NGRI. She testifies against Justin, who is convicted. No innocent persons are wrongfully accused in this episode - the investigation correctly identifies the perpetrators from the start. Detective Lupes' past PTSD issues are revealed during cross-examination but are not related to a false accusation in this case."},{"custom_id":"lo_s20_e14","season":"20","episode_number":"14","episode_title":"Boy on Fire","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Cesar Ramirez, a 16-year-old charter school student, is murdered by being set on fire. Investigation initially focuses on jealousy and school rivalries. Abel Dolan and three friends from Aaron Burr High School are eventually revealed as the killers. The case involves false alibis provided by Principal Woodside, a gang-rape of witness Jolie Henderson to silence her, and Moses Dolan (Abel's brother) initially providing then retracting a tip about evidence. Jolie Henderson emerges as a key false suspect who suffered severe consequences including gang-rape as retaliation for potential testimony."},{"custom_id":"lo_s20_e15","season":"20","episode_number":"15","episode_title":"Brilliant Disguise","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Justine Stebbins, a physical therapy student moonlighting as an escort, is murdered in a NYC hotel. Lab tech Robby Vickery, who dated her, is initially arrested. He's later cleared when evidence points to grad student Alex Conway, who was robbing escorts to fund gambling. Vickery was publicly arrested at work and interrogated before being cleared."},{"custom_id":"lo_s20_e16","season":"20","episode_number":"16","episode_title":"Innocence","air_date":"","source_notes":"Transcript shows complex case with Innocence Coalition challenge to conviction; main defendant Cedric Stuber ultimately pleads guilty to man one (25 years). Multiple layers including witness credibility issues, potential alternative suspect Jon Sorrentino, and prosecutor Mike Cutter's license controversy.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Cedric Stuber is arrested and convicted for a gay-bashing murder based on eyewitness ID. The Innocence Coalition challenges the conviction with new evidence suggesting the victim's husband Jon Sorrentino may have arranged the killing. Investigation reveals the Coalition's witness (drug dealer Rodrigo Diaz) was likely lying in retaliation. Stuber is ultimately not innocent but Jon Sorrentino was also falsely accused of hiring a hit man during the investigation. The episode explores themes of wrongful accusation, prosecutorial conduct, and the complexity of determining innocence."},{"custom_id":"lo_s20_e17","season":"20","episode_number":"17","episode_title":"Four Cops Shot","air_date":"","source_notes":"Four police officers shot in pizzeria; shooter Calvin Stokes arrested. Investigation reveals Officers Ramos and Colson were running an informant operation, pressuring Stokes.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Calvin Stokes kills four police officers. During investigation, detectives briefly suspect and publicly question an innocent man who had stolen a BMW near the crime scene. The suspect is brought in for lineup, interrogated, tested for gunshot residue, and witnesses (including a widow of one of the victims) are brought to identify him before he is cleared. This public process occurs in front of multiple officers and the widow."},{"custom_id":"lo_s20_e18","season":"20","episode_number":"18","episode_title":"Brazil","air_date":"","source_notes":"Transcript appears complete through courtroom testimony","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Dr. Oscar Silva is poisoned at a climate symposium. Initially, Dr. Everett Brown is suspected due to stolen emails showing data manipulation and Brown's statement against cap-and-trade that benefited Silva financially. Investigation reveals Silva's ex-wife Dana and her father Nelson Lehman as the true conspirators, with Dana's current husband Phillip Shoemaker also involved. Brown was publicly accused and threatened despite being innocent."},{"custom_id":"lo_s20_e19","season":"20","episode_number":"19","episode_title":"Crashers","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Brenna Lane is murdered after trying to expose her brother Dustin's inappropriate relationship with Senator Peterson's wife, Camille. Initially, police suspect Dustin of killing Brenna out of jealousy/obsession. Evidence is gathered via a terrorism-justified search warrant (later suppressed). Andrea Wheaton, the senator's chief of staff, is arrested for the murder after cat hair from the crime scene is found in a rental car she procured. Andrea falsely confesses to an affair with Dustin to protect Camille Peterson. Eventually, Camille confesses to killing Brenna to prevent her from exposing the affair and destroying her relationship with Dustin. Andrea served as an accessory after the fact, cleaning up the crime scene and planting evidence in Dustin's apartment to frame him."},{"custom_id":"lo_s20_e20","season":"20","episode_number":"20","episode_title":"The Taxman Cometh","air_date":"","source_notes":"Transcript appears complete through courtroom scenes and final dialogue.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Randy Colwyn is initially accused of murdering his cousin Annie Douglas via heroin overdose to benefit from inheritance; he is later proven to have supplied drugs but not murdered her. Catherine Douglas, Bruce Graham, Dr. Balicheck, Roger Weil, and Louise Casey are arrested for murder conspiracy related to deaths timed for 2010 estate tax avoidance. Charges against Casey and Weil are dismissed; Dr. Balicheck is revealed as an unwitting participant and charges dropped. The episode focuses on proving Catherine Douglas orchestrated her father's death through accountant Graham and Dr. Balicheck's clinic."},{"custom_id":"lo_s20_e21","season":"20","episode_number":"21","episode_title":"Immortal","air_date":"","source_notes":"Transcript appears complete with full courtroom scenes and resolution","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Jerome Turner is murdered by his cousin Michael Reed over a dispute about cooperating with Hema Labs regarding DNA testing of Jerome's son Jaden. While Joseph Hernandez (the PI hired by Hema) is investigated as a suspect, the evidence shows Michael Reed committed the murder out of anger that Jerome was accepting payment from the company that had exploited their family for decades. No one is proven or strongly implied innocent - Michael Reed is the actual perpetrator, and Hernandez, while morally culpable for his tactics, did not commit the murder. The case resolves with a plea deal and settlement for the Robinson family."},{"custom_id":"lo_s20_e22","season":"20","episode_number":"22","episode_title":"Love Eternal","air_date":"","source_notes":"Transcript appears complete through verdict. Final dialogue from Marielle Di Napoli cut off mid-sentence.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"David Di Napoli is murdered in his home, stabbed in a dog cage. Wife Marielle is initially suspected and arrested. She's publicly accused, tried in media coverage, and eventually exonerated when evidence points to Josh Felner, who murdered David to protect an asset-hiding divorce scheme. Marielle suffered arrest, public exposure, trial preparation before charges dismissed. Episode also involves wrongful suspicion of Marty Ashcroft briefly."},{"custom_id":"lo_s20_e23","season":"20","episode_number":"23","episode_title":"Rubber Room","air_date":"","source_notes":"Transcript shows detectives investigating a credible school shooting/bombing threat from a blogger called 'Moot.' Investigation leads to identifying Rick Benson, a teacher who was falsely accused of molesting a student.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Rick Benson, a 9th grade English teacher with only 3 years experience, was accused of molesting a student after the student urinated in a classroom trashcan and Benson tried to stop him. The accusation was fabricated. Benson spent 8 months in a 'rubber room' (Temporary Reassignment Center) during proceedings. The complaint was eventually dismissed, but the Department of Education told him he'd never get tenure, effectively ending his teaching career. His girlfriend left him during the accusations. The experience drove him to plan a school shooting/bombing, which was thwarted by police before any deaths occurred."},{"custom_id":"lo_s21_e01","season":"21","episode_number":"1","episode_title":"The Right Thing","air_date":"2022-02-24","source_notes":"Transcript appears complete through closing arguments. Episode focuses on Nicole Bell shooting Henry King, a celebrity accused of 40+ rapes who was released after appellate court vacated conviction due to prosecutor's immunity promise.","has_false_suspect":"N","has_public_exposure":"N/A","needs_deep_review":"N","summary":"Henry King, a celebrity released from prison after rape conviction was overturned, is murdered. Nicole Bell, one of his rape victims, is arrested and confesses to the killing. The episode centers on whether her actions constitute murder or justifiable homicide. No innocent people are falsely accused in this episode - the investigation correctly identifies Nicole Bell as the shooter, and she confesses. The moral/legal conflict is whether a rape victim killing her rapist should be prosecuted, not whether an innocent person was wrongly accused."},{"custom_id":"lo_s21_e02","season":"21","episode_number":"2","episode_title":"Impossible Dream","air_date":"2022-03-03","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Kyle Morrison is murdered in Central Park. Nina Ellis, his fiancée and CEO of Hythena (a medical testing company), is arrested and tried for his murder. During trial, Nina claims she was a victim of domestic abuse by Kyle and killed him in self-defense. The prosecution proves Nina fabricated the abuse claims - her broken arm came from falling off a horse during polo practice, not from Kyle's violence. Derek Seaver, the former CTO who was initially suspected and nearly framed by Nina, is proven innocent when investigators discover Nina called in a false tip to implicate him."},{"custom_id":"lo_s21_e03","season":"21","episode_number":"3","episode_title":"Filtered Life","air_date":"March 10, 2022","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Amanda Larson, a social media influencer, goes missing in NYC. Joseph Denzig is initially arrested as detectives find Amanda's driver's license in his closet and his blood at the crime scene. He's publicly arrested and accused of involvement but is later cleared when he explains he was burglarizing her van and witnessed someone else abduct Amanda. The real perpetrator, Daniel Garrett, is subsequently identified and convicted. Denzig faces arrest, interrogation, and public exposure for crimes he didn't commit (kidnapping/murder), though he did commit burglary."},{"custom_id":"lo_s21_e04","season":"21","episode_number":"4","episode_title":"Fault Lines","air_date":"2022-03-17","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Judge David Keating is murdered in a parking garage. Investigation reveals Lucy McDaniel, a world-class tennis player, killed him after he refused to allow her to marry her boyfriend. The case exposes that Lucy was under an exploitative guardianship controlled by her father and the judge. Greg Wallace and Jesse Weisman ('Dr. Weisman') were initially suspected but cleared. Wallace was publicly confronted and investigated; Weisman was present at the crime scene and threatened the judge but had been paid. Both experienced consequences from being falsely suspected."},{"custom_id":"lo_s21_e05","season":"21","episode_number":"5","episode_title":"Free Speech","air_date":"","source_notes":"Transcript provided","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Derek Hoyt, a family man planning to run for Congress, is pushed in front of a bus and killed. The murder is committed by Manny Lopez, a follower of right-wing media mogul Jordan Reed. Reed had orchestrated a smear campaign against Hoyt, posting fake photos depicting him as a pedophile and posting inflammatory lies to incite his followers. Lopez believed the lies and killed Hoyt thinking he was protecting children. Reed is ultimately convicted of Murder Two under a depraved indifference theory. While multiple people were accused during the investigation (the business rival, etc.), none were publicly exposed or materially harmed by false accusations - they were quickly cleared through standard questioning. The case centers on incitement to violence rather than wrongful accusation."},{"custom_id":"lo_s21_e07","season":"21","episode_number":"7","episode_title":"Legacy","air_date":"2022-04-28","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Head of School Henry Gleason is murdered at Davenport prep school. Cooper Young, a scholarship student, becomes initial suspect after being found running from scene with blood on jacket. He is publicly arrested and held before his lawyer intervenes. Cooper is later proven innocent when evidence reveals Bennett Richardson brought gun to school and accidentally shot Gleason while targeting Cooper. The prosecution ultimately charges both Bennett and his father John Richardson, who provided the gun and encouraged confrontation."},{"custom_id":"lo_s21_e08","season":"21","episode_number":"8","episode_title":"Severance","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Alexis Morphew, CFO of QuestArc, is strangled to death. Multiple suspects are publicly investigated: Terry Bellantoni (ex-CFO with anger issues and threatening emails), Robert Fletcher (journalist initially suspected of affair), Gus Imelski (solar company founder who lost $250M deal), and Colin Baker (consultant who made fatal error). All are exposed through police investigation before Baker is tried and acquitted by reason of insanity (Havana Syndrome defense). Bellantoni, Fletcher, and Imelski are cleared; all experience public exposure and harm from the accusation process."},{"custom_id":"lo_s21_e09","season":"21","episode_number":"9","episode_title":"The Great Pretender","air_date":"","source_notes":"Episode focuses on the murder of Mary Costello (living as Ella Whitlock) and subsequent prosecution of pharmaceutical CEO Charles Ackman. Multiple suspects were investigated before Wyatt Ackman was charged.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Mary Costello, living under the false identity of Ella Whitlock, is murdered. Multiple people are investigated and publicly questioned before Wyatt Ackman is charged. Matthew Dooley and an unnamed Mexican man were both publicly accused and threatened by detectives before being cleared. The case pivots to prosecuting Charles Ackman for manslaughter related to opioid deaths."},{"custom_id":"lo_s21_e10","season":"21","episode_number":"10","episode_title":"Black and Blue","air_date":"May 19, 2022","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Detective Jimmy Doyle is shot and killed while off-duty. Initially, evidence points to Ezrie's ex-boyfriend, but he provides information leading to Kendra Daniels, who threatened Scott Gleacher with a gun. Doyle intervened and was killed. Kendra claims self-defense against a racist cop; she's acquitted of 1st-degree manslaughter but convicted of 2nd-degree. Scott Gleacher was briefly a suspect but is later cleared and becomes a cooperating witness after receiving immunity for alleged domestic abuse."},{"custom_id":"lo_s22_e01","season":"22","episode_number":"1","episode_title":"Gimme Shelter (Part 3)","air_date":"September 22, 2022","source_notes":"Part 3 of crossover event; continues from previous SVU episodes","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Mark Sirenko and Daniel Rublev are accused and convicted of murder, sex trafficking, and terrorism. Sirenko pleads guilty and testifies against Rublev. Rublev is killed before trial concludes. No innocent persons are falsely accused - both primary defendants are guilty. While the prosecution strategy changes (cutting deal with Sirenko to convict Rublev), no one is shown or implied to be innocent of the crimes they're accused of."},{"custom_id":"lo_s22_e02","season":"22","episode_number":"2","episode_title":"Battle Lines","air_date":"","source_notes":"Transcript provided; abortion context central to plot","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Becca Carter, daughter of Texas Governor Ron Carter, is murdered in Central Park after traveling to NYC for an abortion. Multiple suspects are investigated before brother Blake Carter is convicted. Steven Cabrera, a dishwasher, is falsely accused based on video proximity and fled when police approached; he was working and late for his second job. An unnamed Black man is also stopped by uniformed officer despite not matching suspect description (white male, baseball cap), appearing to be racial profiling. Both experienced public exposure during police stops/pursuits."},{"custom_id":"lo_s22_e03","season":"22","episode_number":"3","episode_title":"Camouflage","air_date":"","source_notes":"Mass shooting in Canal Street subway station; 7 DOA, 11+ injured; suspect John Nelson arrested; federal death penalty case","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A white supremacist commits a mass shooting targeting Asian Americans in a subway. Police initially pursue Aaron Rossi, who picked up the shooter's discarded gym bag containing ammunition. Rossi is publicly arrested and accused before being cleared when Jessica Farrell (the actual shooter's ex and mother of his child) provides information leading to the real perpetrator, John Nelson. Jessica is later forced to testify publicly despite promises of confidentiality, exposing her and her daughter to public scrutiny and online harassment."},{"custom_id":"lo_s22_e04","season":"22","episode_number":"4","episode_title":"Benefit of the Doubt","air_date":"","source_notes":"Transcript shows Jerry Ryan (retired detective, godfather to Cosgrove's daughter) possibly planted the necklace evidence in the warehouse to frame Niles Harper for the murder of Christina Watkins. Multiple suspects were cleared during investigation.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Christina Watkins, a published author, is found murdered. Initial suspect Victor Bernini (the chef criticized in her book) is publicly confronted and arrested in a dramatic standoff at his former restaurant, then cleared via alibi at a strip club. Actor Niles Harper becomes the prime suspect after lying about giving Christina a ride; he is arrested and convicted, but the episode strongly implies Detective Jerry Ryan planted the victim's necklace as evidence. Victor Bernini suffered severe public humiliation and arrest despite being innocent of the murder."},{"custom_id":"lo_s22_e05","season":"22","episode_number":"5","episode_title":"12 Seconds","air_date":"","source_notes":"Transcript shows a law student James Pell blackmailing Professor Ezra Nichols over a slur caught on video. Multiple people become suspects before the actual killer (Nichols' 14-year-old son Cyrus) is revealed.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"James Pell is murdered at a boathouse. Detectives initially suspect Sebastian (phone thief), Larry Brand (boathouse worker/fence), April Parks (Pell's ex), and a rival student before arresting Michelle Nichols (professor's wife). Ezra Nichols then falsely confesses. All are later cleared when evidence reveals the actual killer was Cyrus Nichols, the professor's 14-year-old son, who killed Pell to protect his family from blackmail."},{"custom_id":"lo_s22_e06","season":"22","episode_number":"6","episode_title":"Vicious Cycle","air_date":"","source_notes":"Transcript shows Perry Sutton (fashion designer) murdered after confronting shoplifter Nick Castillo. The episode focuses on prosecuting Castillo, not wrongful accusations of innocent people.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Fashion designer Perry Sutton is murdered after confronting shoplifter Nick Castillo outside a pharmacy. Detectives initially investigate Sutton's ex-girlfriend Sofia (who had threatened him) but she is quickly cleared via alibi. The episode primarily follows the prosecution of the actual perpetrator Castillo, who has 107 prior arrests. ADA Maroun discovers she previously handled a misdemeanor case against Castillo where victim Jasmine Omari mentioned a gun but the detail was lost in translation/case overload. No innocent person suffers meaningful harm from false accusation in this episode."},{"custom_id":"lo_s22_e07","season":"22","episode_number":"7","episode_title":"Only the Lonely","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Law student James Pell is murdered. Multiple suspects are investigated and publicly accused before the true killer is revealed to be 14-year-old Cyrus Nichols, who killed Pell to protect his father from blackmail. Several innocent people suffered exposure and consequences from false accusations during the investigation."},{"custom_id":"lo_s22_e08","season":"22","episode_number":"8","episode_title":"Chain of Command","air_date":"","source_notes":"Transcript analysis","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Alexander Lockett, former Army colonel and corporate executive, is murdered. Investigation initially focuses on business associates (Sonya Chakrabarti, CFO, and CEO) who had conflicts with him over a fraudulent loan. Both are publicly confronted and investigated but are later cleared. The actual killer is Luke Fallon, a veteran from Lockett's unit seeking revenge over burn pit exposure, though Lockett had actually tried to protect his men."},{"custom_id":"lo_s22_e09","season":"22","episode_number":"9","episode_title":"The System","air_date":"","source_notes":"Transcript analysis of S22E09 'The System'","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Troy Booker is wrongfully arrested and charged with murder based on a coerced confession and circumstantial evidence (blood on clothes). He is held at Rikers for 18 months without trial. Video evidence later surfaces proving he was rendering aid to the victim, not committing murder. During this wrongful incarceration, he is threatened by a white supremacist inmate. He escapes, killing a corrections officer in the process, and is ultimately convicted of that killing. The episode extensively documents the harm caused by his wrongful prosecution."},{"custom_id":"lo_s22_e10","season":"22","episode_number":"10","episode_title":"Land of Opportunity","air_date":"","source_notes":"Transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Venezuelan migrant Luis Morales is murdered after witnessing the burial of two construction workers killed in an accident. Multiple people are falsely accused during the investigation: Gavin Stulner (assaulted Morales the day before), Samantha Morris (pulled gun on Morales over alleged theft), and Randall Tully (foreman who buried the bodies). All three faced public exposure—Stulner via police questioning at work, Morris via investigation at her home, and Tully via arrest and public implication in wire-recorded conversation. The actual killer was Ian Belsky, hired by developer Eric Wise."},{"custom_id":"lo_s22_e11","season":"22","episode_number":"11","episode_title":"Second Chance","air_date":"","source_notes":"Transcript appears complete with full investigation and trial","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Derek Stanton is murdered. Jordan Spall, an ex-con who served time with Stanton at Fishkill, becomes an early suspect based on his refusal to answer Stanton's calls and their history of fighting in prison. He is publicly chased and arrested but later cleared. The actual perpetrator is Jesse Erickson, a prep school student who killed Stanton while high on concentrated cannabis."},{"custom_id":"lo_s22_e12","season":"22","episode_number":"12","episode_title":"Almost Famous","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A 14-year-old boy, Eli Barone, is shot and killed by building superintendent Virgil Gilbert when Eli kicks in Gilbert's door as part of a social media 'door-kick challenge' orchestrated by influencer manager Jason Wheeler. Initially, Sean Kapinski (a registered sex offender working as an acting coach) is suspected, and Virgil Gilbert is accused of murder before self-defense is established. The defense falsely accuses Gilbert of having pedophilic interest in Eli during trial. Jason Wheeler is ultimately convicted of manslaughter for causing Eli's death through reckless endangerment of minors."},{"custom_id":"lo_s22_e13","season":"22","episode_number":"13","episode_title":"Mammon","air_date":"","source_notes":"Complex case involving a murder-for-hire by a prosperity gospel pastor. Multiple suspects cleared during investigation.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Emily Wade is murdered outside her apartment. Investigation initially focuses on ex-boyfriend Nathan Brae and then current boyfriend Bobby Gorman, both cleared. Evidence leads to Reverend Henry Sherman driving a church van, who is arrested and charged. Sherman initially cooperates, revealing Pastor Mike Butler hired him to kill Emily after she threatened to expose his fraudulent prosperity gospel scheme. Sherman later recants on the stand (likely due to witness tampering), but other evidence convicts Pastor Mike. Multiple innocent people publicly accused and exposed during the investigation."},{"custom_id":"lo_s22_e14","season":"22","episode_number":"14","episode_title":"Heroes","air_date":"","source_notes":"Transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"A nightclub shooting kills model Hannah Gray. Police initially suspect rapper King Matisse when they discover he deleted surveillance video, but he did so only to hide that he ran from danger rather than protecting Hannah. Officer Nick Riley initially lies about his arrival time and seeing the shooter, then admits he froze in his patrol car. His testimony convicts Bishop Bell of murder. Riley commits suicide after public exposure of his cowardice. Matisse's reputation is publicly damaged despite being innocent of the shooting."},{"custom_id":"lo_s22_e15","season":"22","episode_number":"15","episode_title":"Fear and Loathing","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Dr. Darian Marshall, a heart surgeon, is killed by Brian Burke who claims self-defense based on a false social media post by Daniel Deluca depicting Marshall as an armed, dangerous Black man. The episode also features Detective Jalen Shaw being racially profiled by fellow officers Wagner and Farley, who mistake him for a murder suspect. Shaw faces retaliation when he files a complaint, ultimately being suspended while the officers who profiled him face no consequences."},{"custom_id":"lo_s22_e16","season":"22","episode_number":"16","episode_title":"Deadline","air_date":"","source_notes":"Transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Jacob Ackerman, a legendary journalist, is murdered while investigating city embezzlement involving a shell company (SiteShield) responsible for fire safety door failures that killed six people. Lucas Hobbs, a neo-Nazi who vandalized Ackerman's house, is initially suspected but cleared. Lamar Cordell, a podcaster who threatened Ackerman online, is also ruled out via alibi. David Costa is eventually convicted of Ackerman's murder, having also killed Deputy Mayor Patricia Simonian to cover up their embezzlement scheme."},{"custom_id":"lo_s22_e17","season":"22","episode_number":"17","episode_title":"Bias","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Public defender Rachel Bender is murdered. Investigation initially focuses on her clients with criminal backgrounds and violent priors. Luis Cortez, son of a convicted client, is arrested with weapons and Rachel's address but is cleared. Adam Grassley, father of a rape/murder victim whose killer Rachel successfully defended, confronts Rachel publicly but is also cleared. Owen Bardo, another client seen following Rachel, alibis out. Judge Ephraim Raymer, Rachel's ex-boyfriend, is ultimately convicted of her murder."},{"custom_id":"lo_s22_e18","season":"22","episode_number":"18","episode_title":"Collateral Damage","air_date":"","source_notes":"Transcript shows a cult-related murder case where the cult leader Jocelyn Davis is prosecuted for felony murder of Ava Newhall. The true cult leader 'Lodestar' (Zach Elfont) is killed in jail before trial.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Episode focuses on the prosecution of cult leader Jocelyn Davis for the death of Ava Newhall, who died from an infected branding wound. No innocent persons were falsely accused with public exposure or material consequences. The doorman Donnie Preston was questioned about attempted kidnapping but was acting on behalf of Ava's parents to rescue her from the cult, not falsely accused of a crime he didn't commit. All investigated parties were either guilty or complicit in the crimes."},{"custom_id":"lo_s22_e19","season":"22","episode_number":"19","episode_title":"Private Lives","air_date":"","source_notes":"Transcript shows murder of Dr. Ryan Bartell by Robert Myers. Case involves controversial medical treatment of transgender child.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Dr. Ryan Bartell is murdered by Robert Myers after providing gender-affirming care (puberty blockers) to Myers's 13-year-old transgender daughter Taylor without the father's consent (though with the mother's consent). The case initially investigates political activists and threats against Bartell's wife, Congresswoman Kristin Bartell, before identifying the true motive. Paul Koening, an Antifa activist who was near the scene, is detained and investigated but proven innocent via DNA."},{"custom_id":"lo_s22_e20","season":"22","episode_number":"20","episode_title":"Class Retreat","air_date":"","source_notes":"Transcript analysis complete","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Jerome Elliot, a billionaire CEO, is murdered in East River Park. Initially, a fired business partner is suspected due to threatening texts and recent conflict. Investigation shifts when it's revealed Elliot's daughter Sophia made abuse allegations at a school retreat. Boyfriend Aaron Cole confesses to the murder, claiming he killed Elliot to protect Sophia. The fired partner is publicly questioned and exposed at work despite being innocent of the murder."},{"custom_id":"lo_s22_e21","season":"22","episode_number":"21","episode_title":"Appraisal","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Sarah Baker murdered at art gallery; Madison Platt goes missing. Multiple suspects investigated including Brett Greyson (owed money by Madison), landlord Marquette (spying on Sarah), and Matthew Nelson (Sarah's ex). Greyson was wrongly suspected but had alibi. Marquette arrested for voyeurism but cleared of murder. Nelson ultimately convicted of Sarah's murder."},{"custom_id":"lo_s22_e22","season":"22","episode_number":"22","episode_title":"Open Wounds","air_date":"","source_notes":"Episode centers on Derek Quinn, a mass shooting survivor and PTSD sufferer who assassinates Senator Alan Chandler. Quinn's trajectory involves intense public exposure through arrest, media coverage, and trial, but he is ultimately convicted (guilty verdict). Since he was found guilty, he does not qualify as innocent and therefore no person_rows are generated.","has_false_suspect":"N","has_public_exposure":"N/A","needs_deep_review":"N","summary":"Senator Alan Chandler is assassinated at his daughter's wedding by Derek Quinn, a history teacher and hero who survived a mass school shooting in 2019. Quinn bought a gun in New Hampshire and shot Chandler twice in the chest after the senator voted against gun-control legislation. Quinn was arrested holding the murder weapon and pled not guilty by reason of insanity, citing severe PTSD from the school shooting where 16 students died in his classroom. The defense argued Quinn couldn't appreciate the wrongfulness of his acts due to trauma. The prosecution, led by ADA Nolan Price (who himself survived a subway shooting), argued this was premeditated political assassination. Quinn was convicted of murder in the first degree. No false suspects or wrongfully accused persons appear in this episode."},{"custom_id":"lo_s23_e03","season":"23","episode_number":"3","episode_title":"Turn the Page","air_date":"","source_notes":"Transcript shows murder investigation of Celeste Clark; Detective Riley interviewed Bruce Elliot years earlier regarding Olivia Washington disappearance and concluded he was not a suspect. Riley's credibility impeached at trial for prior suspension (punched captain while drinking). Bruce Elliot ultimately convicted of Celeste Clark's murder.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Detective Vincent Riley interviewed Bruce Elliot in 2020 regarding Olivia Washington's disappearance and cleared him as not a suspect. Years later, Elliot is arrested for murdering Celeste Clark and suspected in three other murders including Olivia's. At trial, defense attorney uses Riley's prior conclusion that Elliot was innocent to bolster defense. Prosecution impeaches Riley by revealing his suspension for punching a captain while drinking during the period he interviewed Elliot. Riley is publicly humiliated in court regarding his drinking, personal problems, and professional judgment. Elliot is convicted."},{"custom_id":"lo_s23_e06","season":"23","episode_number":"6","episode_title":"On the Ledge","air_date":"","source_notes":"Transcript shows Kenneth Cartwright was accused/arrested but was actually guilty of the murder. No qualifying innocent persons identified.","has_false_suspect":"N","has_public_exposure":"N","needs_deep_review":"N","summary":"Kenneth Cartwright shoots and kills Dr. Bryan Jeffers and injures a nurse at Mercy General Hospital after his wife Nora and unborn baby die from what he believes was medical negligence. Initially considered as a jumper/suicide risk by Detective Shaw, Cartwright later committed premeditated murder. He confessed ('an eye for an eye') and was convicted. The defense attempted an insanity plea based on race-based traumatic stress, but Cartwright was found guilty. No innocent persons were falsely accused in this episode - Cartwright was the actual perpetrator from the start of the investigation."},{"custom_id":"lo_s23_e07","season":"23","episode_number":"7","episode_title":"Balance of Power","air_date":"","source_notes":"Transcript appears complete with full dialogue and scene descriptions.","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Jonah Barlowe, a stock market figure who became wealthy from the Reels Rental short squeeze, is murdered. Multiple suspects are investigated including his ex-wife and former romantic partners involved in BDSM/financial domination relationships. Dominic Sargento is publicly confronted at his workplace for threatening Barlowe but is cleared. The ex-wife is questioned but also cleared. Jessica Reese, Barlowe's financial dominatrix, is ultimately convicted of his murder after trying to leverage information about actor Evan Connelly's alleged crimes for a plea deal."},{"custom_id":"lo_s23_e08","season":"23","episode_number":"8","episode_title":"Facade","air_date":"","source_notes":"Full transcript provided","has_false_suspect":"Y","has_public_exposure":"Y","needs_deep_review":"N","summary":"Ellis Joyner, a Black comedian, is strangled to death on the subway. Initially, Malcolm Paige (who had a public altercation with Joyner) is suspected, then Michael Zane (Joyner's boyfriend) becomes a suspect due to threatening messages and prior assault conviction. Both are later cleared. Brandon Arnou, a white elementary school teacher with ties to a white nationalist MMA gym, is arrested and charged with murder but acquitted after a witness corroborates his self-defense claim. Both Paige and Zane suffered public exposure and consequences from being accused."}]